#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_crossstrong

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_crossstrong.uw_fight_crossstrong_C.OnFireStrengthening
// 0x0002 (0x0002 - 0x0000)
struct Uw_fight_crossstrong_C_OnFireStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bSmall;                                            // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_crossstrong_C_OnFireStrengthening) == 0x000001, "Wrong alignment on Uw_fight_crossstrong_C_OnFireStrengthening");
static_assert(sizeof(Uw_fight_crossstrong_C_OnFireStrengthening) == 0x000002, "Wrong size on Uw_fight_crossstrong_C_OnFireStrengthening");
static_assert(offsetof(Uw_fight_crossstrong_C_OnFireStrengthening, bStart) == 0x000000, "Member 'Uw_fight_crossstrong_C_OnFireStrengthening::bStart' has a wrong offset!");
static_assert(offsetof(Uw_fight_crossstrong_C_OnFireStrengthening, bSmall) == 0x000001, "Member 'Uw_fight_crossstrong_C_OnFireStrengthening::bSmall' has a wrong offset!");

// Function uw_fight_crossstrong.uw_fight_crossstrong_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_crossstrong_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_crossstrong_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_crossstrong_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_crossstrong_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_crossstrong_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_crossstrong_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_crossstrong_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// Function uw_fight_crossstrong.uw_fight_crossstrong_C.ExecuteUbergraph_uw_fight_crossstrong
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bSmall;                               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong) == 0x000004, "Wrong alignment on Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong");
static_assert(sizeof(Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong) == 0x000010, "Wrong size on Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong");
static_assert(offsetof(Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong, EntryPoint) == 0x000000, "Member 'Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong, K2Node_Event_AnimName) == 0x000004, "Member 'Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong::K2Node_Event_AnimName' has a wrong offset!");
static_assert(offsetof(Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong, K2Node_Event_bStart) == 0x00000D, "Member 'Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong::K2Node_Event_bStart' has a wrong offset!");
static_assert(offsetof(Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong, K2Node_Event_bSmall) == 0x00000E, "Member 'Uw_fight_crossstrong_C_ExecuteUbergraph_uw_fight_crossstrong::K2Node_Event_bSmall' has a wrong offset!");

}

