#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_propitem

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_propitem.uw_fight_propitem_C.ExecuteUbergraph_uw_fight_propitem
// 0x0018 (0x0018 - 0x0000)
struct uw_fight_propitem_C_ExecuteUbergraph_uw_fight_propitem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_propitem_C_ExecuteUbergraph_uw_fight_propitem;

// Function uw_fight_propitem.uw_fight_propitem_C.OnListItemObjectSet__Overridden
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_propitem_C_OnListItemObjectSet__Overridden final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_propitem_C_OnListItemObjectSet__Overridden;

// Function uw_fight_propitem.uw_fight_propitem_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_propitem_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_propitem_C_BP_OnItemSelectionChanged;

// Function uw_fight_propitem.uw_fight_propitem_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_propitem_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_propitem_C_BP_OnItemExpansionChanged;

// LuaFunction uw_fight_propitem.uw_fight_propitem_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_propitem_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_uw_fight_propitem_C_K2_OnCustomUmgAnimFinished;

// LuaFunction uw_fight_propitem.uw_fight_propitem_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_propitem_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_propitem_C_OnListItemObjectSet;

// Function uw_fight_propitem.uw_fight_propitem_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_propitem_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_propitem_C_GetModuleName;

}

