#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_scene_off

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_scene_off.uw_fight_scene_off_C
// 0x00A8 (0x0328 - 0x0280)
class UUw_fight_scene_off_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Off;                                               // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCustomPostProcess*                     CustomPostProcess_72;                              // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         Time;                                              // 0x0298(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               As_Material_Instance_Dynamic;                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Material_time_off;                                 // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Color_value_off;                                   // 0x02AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Fault_value_off;                                   // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2B4[0x4];                                      // 0x02B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            Fault_curve_off;                                   // 0x02B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                            Color_curve_off;                                   // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, float>                      Values;                                            // 0x02C8(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                           TimeHandle;                                        // 0x0318(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         In_Delta_Time;                                     // 0x0320(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SceneOff();
	void Construct();
	void Data_transmission_off();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_uw_fight_scene_off(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_scene_off_C">();
	}
	static class UUw_fight_scene_off_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_scene_off_C>();
	}
};
static_assert(alignof(UUw_fight_scene_off_C) == 0x000008, "Wrong alignment on UUw_fight_scene_off_C");
static_assert(sizeof(UUw_fight_scene_off_C) == 0x000328, "Wrong size on UUw_fight_scene_off_C");
static_assert(offsetof(UUw_fight_scene_off_C, UberGraphFrame) == 0x000280, "Member 'UUw_fight_scene_off_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, Off) == 0x000288, "Member 'UUw_fight_scene_off_C::Off' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, CustomPostProcess_72) == 0x000290, "Member 'UUw_fight_scene_off_C::CustomPostProcess_72' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, Time) == 0x000298, "Member 'UUw_fight_scene_off_C::Time' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, As_Material_Instance_Dynamic) == 0x0002A0, "Member 'UUw_fight_scene_off_C::As_Material_Instance_Dynamic' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, Material_time_off) == 0x0002A8, "Member 'UUw_fight_scene_off_C::Material_time_off' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, Color_value_off) == 0x0002AC, "Member 'UUw_fight_scene_off_C::Color_value_off' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, Fault_value_off) == 0x0002B0, "Member 'UUw_fight_scene_off_C::Fault_value_off' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, Fault_curve_off) == 0x0002B8, "Member 'UUw_fight_scene_off_C::Fault_curve_off' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, Color_curve_off) == 0x0002C0, "Member 'UUw_fight_scene_off_C::Color_curve_off' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, Values) == 0x0002C8, "Member 'UUw_fight_scene_off_C::Values' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, TimeHandle) == 0x000318, "Member 'UUw_fight_scene_off_C::TimeHandle' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_off_C, In_Delta_Time) == 0x000320, "Member 'UUw_fight_scene_off_C::In_Delta_Time' has a wrong offset!");

}

