#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_player_item_pc

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.OnUIEffectSkillLongPress
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_OnUIEffectSkillLongPress final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_OnUIEffectSkillLongPress) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_OnUIEffectSkillLongPress");
static_assert(sizeof(Uw_fight_player_item_pc_C_OnUIEffectSkillLongPress) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_OnUIEffectSkillLongPress");
static_assert(offsetof(Uw_fight_player_item_pc_C_OnUIEffectSkillLongPress, bStart) == 0x000000, "Member 'Uw_fight_player_item_pc_C_OnUIEffectSkillLongPress::bStart' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.ExecuteUbergraph_uw_fight_player_item_pc
// 0x0018 (0x0018 - 0x0000)
struct Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bStart;                               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerItemEffectType                         K2Node_Event_InEffectType_1;                       // 0x0005(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bQTEEndSwitchBack;                    // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EPlayerItemEffectType                         K2Node_Event_InEffectType;                         // 0x0008(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bPlay;                                // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimPlayingFromAnimation_ReturnValue;   // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNotNormalSwitch;                     // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPress;                               // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPresent;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFull;                                // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFight_InFight;                        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlayAnim;                            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_1;                             // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc) == 0x000004, "Wrong alignment on Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc");
static_assert(sizeof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc) == 0x000018, "Wrong size on Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, EntryPoint) == 0x000000, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_bStart) == 0x000004, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_bStart' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_InEffectType_1) == 0x000005, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_InEffectType_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_bQTEEndSwitchBack) == 0x000006, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_bQTEEndSwitchBack' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_SwitchEnum_CmpSuccess) == 0x000007, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_InEffectType) == 0x000008, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_InEffectType' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_bPlay) == 0x000009, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_bPlay' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_SwitchEnum_CmpSuccess_1) == 0x00000A, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, CallFunc_IsAnimPlayingFromAnimation_ReturnValue) == 0x00000B, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::CallFunc_IsAnimPlayingFromAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_bNotNormalSwitch) == 0x00000C, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_bNotNormalSwitch' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_bPress) == 0x00000D, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_bPress' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_bPresent) == 0x00000E, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_bPresent' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_bFull) == 0x00000F, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_bFull' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, CallFunc_IsInFight_InFight) == 0x000010, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::CallFunc_IsInFight_InFight' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_bPlayAnim) == 0x000011, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_bPlayAnim' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, CallFunc_Not_PreBool_ReturnValue) == 0x000012, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, CallFunc_Not_PreBool_ReturnValue_1) == 0x000013, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, CallFunc_BooleanAND_ReturnValue) == 0x000014, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, CallFunc_BooleanAND_ReturnValue_1) == 0x000015, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc, K2Node_Event_bStart_1) == 0x000016, "Member 'Uw_fight_player_item_pc_C_ExecuteUbergraph_uw_fight_player_item_pc::K2Node_Event_bStart_1' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.OnSkillStrengthening
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_OnSkillStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_OnSkillStrengthening) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_OnSkillStrengthening");
static_assert(sizeof(Uw_fight_player_item_pc_C_OnSkillStrengthening) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_OnSkillStrengthening");
static_assert(offsetof(Uw_fight_player_item_pc_C_OnSkillStrengthening, bStart) == 0x000000, "Member 'Uw_fight_player_item_pc_C_OnSkillStrengthening::bStart' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.K2_PlaySustainAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_K2_PlaySustainAnim final
{
public:
	bool                                          bPlayAnim;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_K2_PlaySustainAnim) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_K2_PlaySustainAnim");
static_assert(sizeof(Uw_fight_player_item_pc_C_K2_PlaySustainAnim) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_K2_PlaySustainAnim");
static_assert(offsetof(Uw_fight_player_item_pc_C_K2_PlaySustainAnim, bPlayAnim) == 0x000000, "Member 'Uw_fight_player_item_pc_C_K2_PlaySustainAnim::bPlayAnim' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.K2_NormalEnergyChange
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_K2_NormalEnergyChange final
{
public:
	bool                                          bFull;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_K2_NormalEnergyChange) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_K2_NormalEnergyChange");
static_assert(sizeof(Uw_fight_player_item_pc_C_K2_NormalEnergyChange) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_K2_NormalEnergyChange");
static_assert(offsetof(Uw_fight_player_item_pc_C_K2_NormalEnergyChange, bFull) == 0x000000, "Member 'Uw_fight_player_item_pc_C_K2_NormalEnergyChange::bFull' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.PlayPresentAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_PlayPresentAnim final
{
public:
	bool                                          bPresent;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_PlayPresentAnim) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_PlayPresentAnim");
static_assert(sizeof(Uw_fight_player_item_pc_C_PlayPresentAnim) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_PlayPresentAnim");
static_assert(offsetof(Uw_fight_player_item_pc_C_PlayPresentAnim, bPresent) == 0x000000, "Member 'Uw_fight_player_item_pc_C_PlayPresentAnim::bPresent' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.OnBackSkillPress
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_OnBackSkillPress final
{
public:
	bool                                          bPress;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_OnBackSkillPress) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_OnBackSkillPress");
static_assert(sizeof(Uw_fight_player_item_pc_C_OnBackSkillPress) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_OnBackSkillPress");
static_assert(offsetof(Uw_fight_player_item_pc_C_OnBackSkillPress, bPress) == 0x000000, "Member 'Uw_fight_player_item_pc_C_OnBackSkillPress::bPress' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.OnNotNormalSwitch
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_OnNotNormalSwitch final
{
public:
	bool                                          bNotNormalSwitch;                                  // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_OnNotNormalSwitch) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_OnNotNormalSwitch");
static_assert(sizeof(Uw_fight_player_item_pc_C_OnNotNormalSwitch) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_OnNotNormalSwitch");
static_assert(offsetof(Uw_fight_player_item_pc_C_OnNotNormalSwitch, bNotNormalSwitch) == 0x000000, "Member 'Uw_fight_player_item_pc_C_OnNotNormalSwitch::bNotNormalSwitch' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.K2_PlaySwitchCDAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_K2_PlaySwitchCDAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_K2_PlaySwitchCDAnim) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_K2_PlaySwitchCDAnim");
static_assert(sizeof(Uw_fight_player_item_pc_C_K2_PlaySwitchCDAnim) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_K2_PlaySwitchCDAnim");
static_assert(offsetof(Uw_fight_player_item_pc_C_K2_PlaySwitchCDAnim, bPlay) == 0x000000, "Member 'Uw_fight_player_item_pc_C_K2_PlaySwitchCDAnim::bPlay' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.StopEffect
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_StopEffect final
{
public:
	EPlayerItemEffectType                         InEffectType;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_player_item_pc_C_StopEffect) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_StopEffect");
static_assert(sizeof(Uw_fight_player_item_pc_C_StopEffect) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_StopEffect");
static_assert(offsetof(Uw_fight_player_item_pc_C_StopEffect, InEffectType) == 0x000000, "Member 'Uw_fight_player_item_pc_C_StopEffect::InEffectType' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.PlayEffect
// 0x0002 (0x0002 - 0x0000)
struct Uw_fight_player_item_pc_C_PlayEffect final
{
public:
	EPlayerItemEffectType                         InEffectType;                                      // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bQTEEndSwitchBack;                                 // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_PlayEffect) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_PlayEffect");
static_assert(sizeof(Uw_fight_player_item_pc_C_PlayEffect) == 0x000002, "Wrong size on Uw_fight_player_item_pc_C_PlayEffect");
static_assert(offsetof(Uw_fight_player_item_pc_C_PlayEffect, InEffectType) == 0x000000, "Member 'Uw_fight_player_item_pc_C_PlayEffect::InEffectType' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_PlayEffect, bQTEEndSwitchBack) == 0x000001, "Member 'Uw_fight_player_item_pc_C_PlayEffect::bQTEEndSwitchBack' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.Play Activation
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_Play_Activation final
{
public:
	bool                                          bForward;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_Play_Activation) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_Play_Activation");
static_assert(sizeof(Uw_fight_player_item_pc_C_Play_Activation) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_Play_Activation");
static_assert(offsetof(Uw_fight_player_item_pc_C_Play_Activation, bForward) == 0x000000, "Member 'Uw_fight_player_item_pc_C_Play_Activation::bForward' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.IsInFight
// 0x0018 (0x0018 - 0x0000)
struct Uw_fight_player_item_pc_C_IsInFight final
{
public:
	bool                                          InFight;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCacheCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCurrentCharacter_ReturnValue;           // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_pc_C_IsInFight) == 0x000008, "Wrong alignment on Uw_fight_player_item_pc_C_IsInFight");
static_assert(sizeof(Uw_fight_player_item_pc_C_IsInFight) == 0x000018, "Wrong size on Uw_fight_player_item_pc_C_IsInFight");
static_assert(offsetof(Uw_fight_player_item_pc_C_IsInFight, InFight) == 0x000000, "Member 'Uw_fight_player_item_pc_C_IsInFight::InFight' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_IsInFight, CallFunc_GetCacheCharacter_ReturnValue) == 0x000008, "Member 'Uw_fight_player_item_pc_C_IsInFight::CallFunc_GetCacheCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_IsInFight, CallFunc_IsCurrentCharacter_ReturnValue) == 0x000010, "Member 'Uw_fight_player_item_pc_C_IsInFight::CallFunc_IsCurrentCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_IsInFight, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'Uw_fight_player_item_pc_C_IsInFight::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// LuaFunction uw_fight_player_item_pc.uw_fight_player_item_pc_C.OnChargeTimesChange
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_player_item_pc_C_OnChargeTimesChange final
{
public:
	int32                                         InCurrentTimes;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMaxTimes;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_player_item_pc_C_OnChargeTimesChange) == 0x000004, "Wrong alignment on Uw_fight_player_item_pc_C_OnChargeTimesChange");
static_assert(sizeof(Uw_fight_player_item_pc_C_OnChargeTimesChange) == 0x000008, "Wrong size on Uw_fight_player_item_pc_C_OnChargeTimesChange");
static_assert(offsetof(Uw_fight_player_item_pc_C_OnChargeTimesChange, InCurrentTimes) == 0x000000, "Member 'Uw_fight_player_item_pc_C_OnChargeTimesChange::InCurrentTimes' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_pc_C_OnChargeTimesChange, InMaxTimes) == 0x000004, "Member 'Uw_fight_player_item_pc_C_OnChargeTimesChange::InMaxTimes' has a wrong offset!");

// LuaFunction uw_fight_player_item_pc.uw_fight_player_item_pc_C.NotifyClick
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_pc_C_NotifyClick final
{
public:
	EPlayerBtnType                                BtnType;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_player_item_pc_C_NotifyClick) == 0x000001, "Wrong alignment on Uw_fight_player_item_pc_C_NotifyClick");
static_assert(sizeof(Uw_fight_player_item_pc_C_NotifyClick) == 0x000001, "Wrong size on Uw_fight_player_item_pc_C_NotifyClick");
static_assert(offsetof(Uw_fight_player_item_pc_C_NotifyClick, BtnType) == 0x000000, "Member 'Uw_fight_player_item_pc_C_NotifyClick::BtnType' has a wrong offset!");

// LuaFunction uw_fight_player_item_pc.uw_fight_player_item_pc_C.UpdateKeyboard
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_player_item_pc_C_UpdateKeyboard final
{
public:
	int32                                         InIndex;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_player_item_pc_C_UpdateKeyboard) == 0x000004, "Wrong alignment on Uw_fight_player_item_pc_C_UpdateKeyboard");
static_assert(sizeof(Uw_fight_player_item_pc_C_UpdateKeyboard) == 0x000004, "Wrong size on Uw_fight_player_item_pc_C_UpdateKeyboard");
static_assert(offsetof(Uw_fight_player_item_pc_C_UpdateKeyboard, InIndex) == 0x000000, "Member 'Uw_fight_player_item_pc_C_UpdateKeyboard::InIndex' has a wrong offset!");

// LuaFunction uw_fight_player_item_pc.uw_fight_player_item_pc_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_player_item_pc_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_player_item_pc_C_OnAnimationFinished) == 0x000008, "Wrong alignment on Uw_fight_player_item_pc_C_OnAnimationFinished");
static_assert(sizeof(Uw_fight_player_item_pc_C_OnAnimationFinished) == 0x000008, "Wrong size on Uw_fight_player_item_pc_C_OnAnimationFinished");
static_assert(offsetof(Uw_fight_player_item_pc_C_OnAnimationFinished, Animation) == 0x000000, "Member 'Uw_fight_player_item_pc_C_OnAnimationFinished::Animation' has a wrong offset!");

// LuaFunction uw_fight_player_item_pc.uw_fight_player_item_pc_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_player_item_pc_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_player_item_pc_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_player_item_pc_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_player_item_pc_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_player_item_pc_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_player_item_pc_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_player_item_pc_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// Function uw_fight_player_item_pc.uw_fight_player_item_pc_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_player_item_pc_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_player_item_pc_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_player_item_pc_C_GetModuleName");
static_assert(sizeof(Uw_fight_player_item_pc_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_player_item_pc_C_GetModuleName");
static_assert(offsetof(Uw_fight_player_item_pc_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_player_item_pc_C_GetModuleName::ReturnValue' has a wrong offset!");

}

