#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_dodge_button

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_dodge_button.uw_fight_dodge_button_C
// 0x0028 (0x03D8 - 0x03B0)
class UUw_fight_dodge_button_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       Reset;                                             // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NoPower;                                           // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgIcon;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         PressImg;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_dodge_button_C">();
	}
	static class UUw_fight_dodge_button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_dodge_button_C>();
	}
};
static_assert(alignof(UUw_fight_dodge_button_C) == 0x000008, "Wrong alignment on UUw_fight_dodge_button_C");
static_assert(sizeof(UUw_fight_dodge_button_C) == 0x0003D8, "Wrong size on UUw_fight_dodge_button_C");
static_assert(offsetof(UUw_fight_dodge_button_C, Reset) == 0x0003B0, "Member 'UUw_fight_dodge_button_C::Reset' has a wrong offset!");
static_assert(offsetof(UUw_fight_dodge_button_C, NoPower) == 0x0003B8, "Member 'UUw_fight_dodge_button_C::NoPower' has a wrong offset!");
static_assert(offsetof(UUw_fight_dodge_button_C, ImgBG) == 0x0003C0, "Member 'UUw_fight_dodge_button_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_dodge_button_C, ImgIcon) == 0x0003C8, "Member 'UUw_fight_dodge_button_C::ImgIcon' has a wrong offset!");
static_assert(offsetof(UUw_fight_dodge_button_C, PressImg) == 0x0003D0, "Member 'UUw_fight_dodge_button_C::PressImg' has a wrong offset!");

}

