#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_tipsgain

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_tipsgain.uw_fight_tipsgain_C
// 0x0098 (0x0448 - 0x03B0)
class UUw_fight_tipsgain_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       Enter;                                             // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         BG1;                                               // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Bg2;                                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         FX_BG1_1;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         FX_BG2_2;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgItem;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularListView*                      ListItem;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               NiagaraSystemWidget_lizi_1;                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               NiagaraSystemWidget_lizi_2;                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelItem;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlphaMaskImage*                        Shadow1;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlphaMaskImage*                        Shadow2;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       TitleFinish;                                       // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtGain;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White01;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White01_1;                                         // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White01_2;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White01_3;                                         // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White01_4;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_tipsgain_C">();
	}
	static class UUw_fight_tipsgain_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_tipsgain_C>();
	}
};
static_assert(alignof(UUw_fight_tipsgain_C) == 0x000008, "Wrong alignment on UUw_fight_tipsgain_C");
static_assert(sizeof(UUw_fight_tipsgain_C) == 0x000448, "Wrong size on UUw_fight_tipsgain_C");
static_assert(offsetof(UUw_fight_tipsgain_C, Enter) == 0x0003B0, "Member 'UUw_fight_tipsgain_C::Enter' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, BG1) == 0x0003B8, "Member 'UUw_fight_tipsgain_C::BG1' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, Bg2) == 0x0003C0, "Member 'UUw_fight_tipsgain_C::Bg2' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, FX_BG1_1) == 0x0003C8, "Member 'UUw_fight_tipsgain_C::FX_BG1_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, FX_BG2_2) == 0x0003D0, "Member 'UUw_fight_tipsgain_C::FX_BG2_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, ImgItem) == 0x0003D8, "Member 'UUw_fight_tipsgain_C::ImgItem' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, ListItem) == 0x0003E0, "Member 'UUw_fight_tipsgain_C::ListItem' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, NiagaraSystemWidget_lizi_1) == 0x0003E8, "Member 'UUw_fight_tipsgain_C::NiagaraSystemWidget_lizi_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, NiagaraSystemWidget_lizi_2) == 0x0003F0, "Member 'UUw_fight_tipsgain_C::NiagaraSystemWidget_lizi_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, PanelItem) == 0x0003F8, "Member 'UUw_fight_tipsgain_C::PanelItem' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, Shadow1) == 0x000400, "Member 'UUw_fight_tipsgain_C::Shadow1' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, Shadow2) == 0x000408, "Member 'UUw_fight_tipsgain_C::Shadow2' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, TitleFinish) == 0x000410, "Member 'UUw_fight_tipsgain_C::TitleFinish' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, TxtGain) == 0x000418, "Member 'UUw_fight_tipsgain_C::TxtGain' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, White01) == 0x000420, "Member 'UUw_fight_tipsgain_C::White01' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, White01_1) == 0x000428, "Member 'UUw_fight_tipsgain_C::White01_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, White01_2) == 0x000430, "Member 'UUw_fight_tipsgain_C::White01_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, White01_3) == 0x000438, "Member 'UUw_fight_tipsgain_C::White01_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipsgain_C, White01_4) == 0x000440, "Member 'UUw_fight_tipsgain_C::White01_4' has a wrong offset!");

}

