#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_special_ui

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_special_ui.uw_fight_special_ui_C
// 0x0040 (0x0430 - 0x03F0)
class UUw_fight_special_ui_C final : public UFightSpecialUI
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PassiveAim;                                        // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       InScreen;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PanelPassive;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelPassiveEnd;                                   // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           PanelPassiveStart;                                 // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelSence;                                        // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Root;                                              // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_uw_fight_special_ui(int32 EntryPoint);
	void Construct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_special_ui_C">();
	}
	static class UUw_fight_special_ui_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_special_ui_C>();
	}
};
static_assert(alignof(UUw_fight_special_ui_C) == 0x000008, "Wrong alignment on UUw_fight_special_ui_C");
static_assert(sizeof(UUw_fight_special_ui_C) == 0x000430, "Wrong size on UUw_fight_special_ui_C");
static_assert(offsetof(UUw_fight_special_ui_C, UberGraphFrame) == 0x0003F0, "Member 'UUw_fight_special_ui_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_special_ui_C, PassiveAim) == 0x0003F8, "Member 'UUw_fight_special_ui_C::PassiveAim' has a wrong offset!");
static_assert(offsetof(UUw_fight_special_ui_C, InScreen) == 0x000400, "Member 'UUw_fight_special_ui_C::InScreen' has a wrong offset!");
static_assert(offsetof(UUw_fight_special_ui_C, PanelPassive) == 0x000408, "Member 'UUw_fight_special_ui_C::PanelPassive' has a wrong offset!");
static_assert(offsetof(UUw_fight_special_ui_C, PanelPassiveEnd) == 0x000410, "Member 'UUw_fight_special_ui_C::PanelPassiveEnd' has a wrong offset!");
static_assert(offsetof(UUw_fight_special_ui_C, PanelPassiveStart) == 0x000418, "Member 'UUw_fight_special_ui_C::PanelPassiveStart' has a wrong offset!");
static_assert(offsetof(UUw_fight_special_ui_C, PanelSence) == 0x000420, "Member 'UUw_fight_special_ui_C::PanelSence' has a wrong offset!");
static_assert(offsetof(UUw_fight_special_ui_C, Root) == 0x000428, "Member 'UUw_fight_special_ui_C::Root' has a wrong offset!");

}

