#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_time

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_time.uw_fight_time_C
// 0x0028 (0x03D0 - 0x03A8)
class UUw_fight_time_C final : public UFightTime
{
public:
	class UWidgetAnimation*                       AllEnter;                                          // 0x03A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_26;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_120;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_time_C">();
	}
	static class UUw_fight_time_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_time_C>();
	}
};
static_assert(alignof(UUw_fight_time_C) == 0x000008, "Wrong alignment on UUw_fight_time_C");
static_assert(sizeof(UUw_fight_time_C) == 0x0003D0, "Wrong size on UUw_fight_time_C");
static_assert(offsetof(UUw_fight_time_C, AllEnter) == 0x0003A8, "Member 'UUw_fight_time_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUw_fight_time_C, Image) == 0x0003B0, "Member 'UUw_fight_time_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_time_C, Image_1) == 0x0003B8, "Member 'UUw_fight_time_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_time_C, Image_26) == 0x0003C0, "Member 'UUw_fight_time_C::Image_26' has a wrong offset!");
static_assert(offsetof(UUw_fight_time_C, Image_120) == 0x0003C8, "Member 'UUw_fight_time_C::Image_120' has a wrong offset!");

}

