#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_danger_retreat

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_danger_retreat.uw_fight_danger_retreat_C
// 0x00E8 (0x0430 - 0x0348)
class UUw_fight_danger_retreat_C final : public UUserWidgetAnimation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Aim;                                               // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_102;                                 // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         HorizontalBox_228;                                 // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_2;                                           // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_4;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_54;                                          // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_241;                                         // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgRedBg;                                          // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_1;                                   // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_2;                                   // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_3;                                   // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_4;                                   // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_5;                                   // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_6;                                   // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_7;                                   // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_8;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_9;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_10;                                  // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_11;                                  // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_96;                                  // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_380;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Shadow1;                                           // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Shadow2;                                           // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtRetreatWarn;                                    // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_uw_fight_danger_retreat(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_danger_retreat_C">();
	}
	static class UUw_fight_danger_retreat_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_danger_retreat_C>();
	}
};
static_assert(alignof(UUw_fight_danger_retreat_C) == 0x000008, "Wrong alignment on UUw_fight_danger_retreat_C");
static_assert(sizeof(UUw_fight_danger_retreat_C) == 0x000430, "Wrong size on UUw_fight_danger_retreat_C");
static_assert(offsetof(UUw_fight_danger_retreat_C, UberGraphFrame) == 0x000348, "Member 'UUw_fight_danger_retreat_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, Aim) == 0x000350, "Member 'UUw_fight_danger_retreat_C::Aim' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, HorizontalBox_102) == 0x000358, "Member 'UUw_fight_danger_retreat_C::HorizontalBox_102' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, HorizontalBox_228) == 0x000360, "Member 'UUw_fight_danger_retreat_C::HorizontalBox_228' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, Image) == 0x000368, "Member 'UUw_fight_danger_retreat_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, Image_1) == 0x000370, "Member 'UUw_fight_danger_retreat_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, Image_2) == 0x000378, "Member 'UUw_fight_danger_retreat_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, Image_3) == 0x000380, "Member 'UUw_fight_danger_retreat_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, Image_4) == 0x000388, "Member 'UUw_fight_danger_retreat_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, Image_54) == 0x000390, "Member 'UUw_fight_danger_retreat_C::Image_54' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, Image_241) == 0x000398, "Member 'UUw_fight_danger_retreat_C::Image_241' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, ImgRedBg) == 0x0003A0, "Member 'UUw_fight_danger_retreat_C::ImgRedBg' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage) == 0x0003A8, "Member 'UUw_fight_danger_retreat_C::RedirectImage' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_1) == 0x0003B0, "Member 'UUw_fight_danger_retreat_C::RedirectImage_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_2) == 0x0003B8, "Member 'UUw_fight_danger_retreat_C::RedirectImage_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_3) == 0x0003C0, "Member 'UUw_fight_danger_retreat_C::RedirectImage_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_4) == 0x0003C8, "Member 'UUw_fight_danger_retreat_C::RedirectImage_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_5) == 0x0003D0, "Member 'UUw_fight_danger_retreat_C::RedirectImage_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_6) == 0x0003D8, "Member 'UUw_fight_danger_retreat_C::RedirectImage_6' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_7) == 0x0003E0, "Member 'UUw_fight_danger_retreat_C::RedirectImage_7' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_8) == 0x0003E8, "Member 'UUw_fight_danger_retreat_C::RedirectImage_8' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_9) == 0x0003F0, "Member 'UUw_fight_danger_retreat_C::RedirectImage_9' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_10) == 0x0003F8, "Member 'UUw_fight_danger_retreat_C::RedirectImage_10' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_11) == 0x000400, "Member 'UUw_fight_danger_retreat_C::RedirectImage_11' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_96) == 0x000408, "Member 'UUw_fight_danger_retreat_C::RedirectImage_96' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, RedirectImage_380) == 0x000410, "Member 'UUw_fight_danger_retreat_C::RedirectImage_380' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, Shadow1) == 0x000418, "Member 'UUw_fight_danger_retreat_C::Shadow1' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, Shadow2) == 0x000420, "Member 'UUw_fight_danger_retreat_C::Shadow2' has a wrong offset!");
static_assert(offsetof(UUw_fight_danger_retreat_C, TxtRetreatWarn) == 0x000428, "Member 'UUw_fight_danger_retreat_C::TxtRetreatWarn' has a wrong offset!");

}

