#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_tipskey

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_tipskey.uw_fight_tipskey_C
// 0x00C0 (0x0408 - 0x0348)
class UUw_fight_tipskey_C final : public UUserWidgetAnimation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Close;                                             // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Open;                                              // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_0;                                     // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHyperTextBlock*                        ChangeMsg;                                         // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fighttips_01_p_C*                 Effect;                                            // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHyperTextBlock*                        FinishMsg;                                         // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_66;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_blue;                                        // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_blue_0;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_blue_1;                                      // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_blue_2;                                      // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine10;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine10_1;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine11;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine11_1;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine12;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine12_1;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine20;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine21;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgLine22;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgMask;                                           // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               NiagaraSystemWidget_lizi;                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTuw_fight_tipskey_0();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void OnAnimationStarted(const class UWidgetAnimation* Animation);
	void SequenceEvent_0();
	void ExecuteUbergraph_uw_fight_tipskey(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_tipskey_C">();
	}
	static class UUw_fight_tipskey_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_tipskey_C>();
	}
};
static_assert(alignof(UUw_fight_tipskey_C) == 0x000008, "Wrong alignment on UUw_fight_tipskey_C");
static_assert(sizeof(UUw_fight_tipskey_C) == 0x000408, "Wrong size on UUw_fight_tipskey_C");
static_assert(offsetof(UUw_fight_tipskey_C, UberGraphFrame) == 0x000348, "Member 'UUw_fight_tipskey_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, Close) == 0x000350, "Member 'UUw_fight_tipskey_C::Close' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, Open) == 0x000358, "Member 'UUw_fight_tipskey_C::Open' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, CanvasPanel_0) == 0x000360, "Member 'UUw_fight_tipskey_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ChangeMsg) == 0x000368, "Member 'UUw_fight_tipskey_C::ChangeMsg' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, Effect) == 0x000370, "Member 'UUw_fight_tipskey_C::Effect' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, FinishMsg) == 0x000378, "Member 'UUw_fight_tipskey_C::FinishMsg' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, Image) == 0x000380, "Member 'UUw_fight_tipskey_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, Image_66) == 0x000388, "Member 'UUw_fight_tipskey_C::Image_66' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, Image_blue) == 0x000390, "Member 'UUw_fight_tipskey_C::Image_blue' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, Image_blue_0) == 0x000398, "Member 'UUw_fight_tipskey_C::Image_blue_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, Image_blue_1) == 0x0003A0, "Member 'UUw_fight_tipskey_C::Image_blue_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, Image_blue_2) == 0x0003A8, "Member 'UUw_fight_tipskey_C::Image_blue_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ImgLine10) == 0x0003B0, "Member 'UUw_fight_tipskey_C::ImgLine10' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ImgLine10_1) == 0x0003B8, "Member 'UUw_fight_tipskey_C::ImgLine10_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ImgLine11) == 0x0003C0, "Member 'UUw_fight_tipskey_C::ImgLine11' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ImgLine11_1) == 0x0003C8, "Member 'UUw_fight_tipskey_C::ImgLine11_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ImgLine12) == 0x0003D0, "Member 'UUw_fight_tipskey_C::ImgLine12' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ImgLine12_1) == 0x0003D8, "Member 'UUw_fight_tipskey_C::ImgLine12_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ImgLine20) == 0x0003E0, "Member 'UUw_fight_tipskey_C::ImgLine20' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ImgLine21) == 0x0003E8, "Member 'UUw_fight_tipskey_C::ImgLine21' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ImgLine22) == 0x0003F0, "Member 'UUw_fight_tipskey_C::ImgLine22' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, ImgMask) == 0x0003F8, "Member 'UUw_fight_tipskey_C::ImgMask' has a wrong offset!");
static_assert(offsetof(UUw_fight_tipskey_C, NiagaraSystemWidget_lizi) == 0x000400, "Member 'UUw_fight_tipskey_C::NiagaraSystemWidget_lizi' has a wrong offset!");

}

