#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_laser_cross

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_laser_cross.uw_fight_laser_cross_C
// 0x0018 (0x03C8 - 0x03B0)
class UUw_fight_laser_cross_C final : public ULuaWidget
{
public:
	class URedirectImage*                         Center;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Center_1;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CrossPanel;                                        // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_laser_cross_C">();
	}
	static class UUw_fight_laser_cross_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_laser_cross_C>();
	}
};
static_assert(alignof(UUw_fight_laser_cross_C) == 0x000008, "Wrong alignment on UUw_fight_laser_cross_C");
static_assert(sizeof(UUw_fight_laser_cross_C) == 0x0003C8, "Wrong size on UUw_fight_laser_cross_C");
static_assert(offsetof(UUw_fight_laser_cross_C, Center) == 0x0003B0, "Member 'UUw_fight_laser_cross_C::Center' has a wrong offset!");
static_assert(offsetof(UUw_fight_laser_cross_C, Center_1) == 0x0003B8, "Member 'UUw_fight_laser_cross_C::Center_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_laser_cross_C, CrossPanel) == 0x0003C0, "Member 'UUw_fight_laser_cross_C::CrossPanel' has a wrong offset!");

}

