#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_ammunition6

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_ammunition6.uw_fight_ammunition6_C.ExecuteUbergraph_uw_fight_ammunition6
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bShow;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6) == 0x000004, "Wrong alignment on Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6");
static_assert(sizeof(Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6) == 0x000008, "Wrong size on Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6");
static_assert(offsetof(Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6, EntryPoint) == 0x000000, "Member 'Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6, K2Node_Event_bShow_1) == 0x000004, "Member 'Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6::K2Node_Event_bShow_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6, K2Node_Event_bShow) == 0x000005, "Member 'Uw_fight_ammunition6_C_ExecuteUbergraph_uw_fight_ammunition6::K2Node_Event_bShow' has a wrong offset!");

// Function uw_fight_ammunition6.uw_fight_ammunition6_C.SetBulletTimeEffect
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_ammunition6_C_SetBulletTimeEffect final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_ammunition6_C_SetBulletTimeEffect) == 0x000001, "Wrong alignment on Uw_fight_ammunition6_C_SetBulletTimeEffect");
static_assert(sizeof(Uw_fight_ammunition6_C_SetBulletTimeEffect) == 0x000001, "Wrong size on Uw_fight_ammunition6_C_SetBulletTimeEffect");
static_assert(offsetof(Uw_fight_ammunition6_C_SetBulletTimeEffect, bShow) == 0x000000, "Member 'Uw_fight_ammunition6_C_SetBulletTimeEffect::bShow' has a wrong offset!");

// Function uw_fight_ammunition6.uw_fight_ammunition6_C.SetBulletEffect
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_ammunition6_C_SetBulletEffect final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_ammunition6_C_SetBulletEffect) == 0x000001, "Wrong alignment on Uw_fight_ammunition6_C_SetBulletEffect");
static_assert(sizeof(Uw_fight_ammunition6_C_SetBulletEffect) == 0x000001, "Wrong size on Uw_fight_ammunition6_C_SetBulletEffect");
static_assert(offsetof(Uw_fight_ammunition6_C_SetBulletEffect, bShow) == 0x000000, "Member 'Uw_fight_ammunition6_C_SetBulletEffect::bShow' has a wrong offset!");

}

