#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_boss_hp

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_boss_hp.uw_fight_boss_hp_C.ExecuteUbergraph_uw_fight_boss_hp
// 0x004C (0x004C - 0x0000)
struct Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_Precent;                              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bBreak;                               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_B[0x1];                                        // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x000C(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnimPlayingFromAnimation_ReturnValue;   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp) == 0x000004, "Wrong alignment on Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp");
static_assert(sizeof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp) == 0x00004C, "Wrong size on Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, EntryPoint) == 0x000000, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, K2Node_Event_Precent) == 0x000004, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::K2Node_Event_Precent' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, K2Node_Event_bBreak) == 0x000008, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::K2Node_Event_bBreak' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000009, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00000A, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, K2Node_Event_MyGeometry) == 0x00000C, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, K2Node_Event_InDeltaTime) == 0x000044, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, CallFunc_IsAnimPlayingFromAnimation_ReturnValue) == 0x000048, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::CallFunc_IsAnimPlayingFromAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, CallFunc_BooleanAND_ReturnValue) == 0x000049, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, CallFunc_Not_PreBool_ReturnValue) == 0x00004A, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp, CallFunc_BooleanAND_ReturnValue_1) == 0x00004B, "Member 'Uw_fight_boss_hp_C_ExecuteUbergraph_uw_fight_boss_hp::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function uw_fight_boss_hp.uw_fight_boss_hp_C.Tick
// 0x003C (0x003C - 0x0000)
struct Uw_fight_boss_hp_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_boss_hp_C_Tick) == 0x000004, "Wrong alignment on Uw_fight_boss_hp_C_Tick");
static_assert(sizeof(Uw_fight_boss_hp_C_Tick) == 0x00003C, "Wrong size on Uw_fight_boss_hp_C_Tick");
static_assert(offsetof(Uw_fight_boss_hp_C_Tick, MyGeometry) == 0x000000, "Member 'Uw_fight_boss_hp_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_Tick, InDeltaTime) == 0x000038, "Member 'Uw_fight_boss_hp_C_Tick::InDeltaTime' has a wrong offset!");

// Function uw_fight_boss_hp.uw_fight_boss_hp_C.StageBreakProgressPlayAnim
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_boss_hp_C_StageBreakProgressPlayAnim final
{
public:
	float                                         Precent;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bBreak;                                            // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_boss_hp_C_StageBreakProgressPlayAnim) == 0x000004, "Wrong alignment on Uw_fight_boss_hp_C_StageBreakProgressPlayAnim");
static_assert(sizeof(Uw_fight_boss_hp_C_StageBreakProgressPlayAnim) == 0x000008, "Wrong size on Uw_fight_boss_hp_C_StageBreakProgressPlayAnim");
static_assert(offsetof(Uw_fight_boss_hp_C_StageBreakProgressPlayAnim, Precent) == 0x000000, "Member 'Uw_fight_boss_hp_C_StageBreakProgressPlayAnim::Precent' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_StageBreakProgressPlayAnim, bBreak) == 0x000004, "Member 'Uw_fight_boss_hp_C_StageBreakProgressPlayAnim::bBreak' has a wrong offset!");

// LuaFunction uw_fight_boss_hp.uw_fight_boss_hp_C.K2_OnAppliedModifierChange
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_boss_hp_C_K2_OnAppliedModifierChange final
{
public:
	int32                                         ModifierID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsApply;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         InLauncherCharacterHashIndex;                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_boss_hp_C_K2_OnAppliedModifierChange) == 0x000008, "Wrong alignment on Uw_fight_boss_hp_C_K2_OnAppliedModifierChange");
static_assert(sizeof(Uw_fight_boss_hp_C_K2_OnAppliedModifierChange) == 0x000010, "Wrong size on Uw_fight_boss_hp_C_K2_OnAppliedModifierChange");
static_assert(offsetof(Uw_fight_boss_hp_C_K2_OnAppliedModifierChange, ModifierID) == 0x000000, "Member 'Uw_fight_boss_hp_C_K2_OnAppliedModifierChange::ModifierID' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_K2_OnAppliedModifierChange, IsApply) == 0x000004, "Member 'Uw_fight_boss_hp_C_K2_OnAppliedModifierChange::IsApply' has a wrong offset!");
static_assert(offsetof(Uw_fight_boss_hp_C_K2_OnAppliedModifierChange, InLauncherCharacterHashIndex) == 0x000008, "Member 'Uw_fight_boss_hp_C_K2_OnAppliedModifierChange::InLauncherCharacterHashIndex' has a wrong offset!");

// LuaFunction uw_fight_boss_hp.uw_fight_boss_hp_C.OnDamageNumChange
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_boss_hp_C_OnDamageNumChange final
{
public:
	float                                         DamageTaken;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_boss_hp_C_OnDamageNumChange) == 0x000004, "Wrong alignment on Uw_fight_boss_hp_C_OnDamageNumChange");
static_assert(sizeof(Uw_fight_boss_hp_C_OnDamageNumChange) == 0x000004, "Wrong size on Uw_fight_boss_hp_C_OnDamageNumChange");
static_assert(offsetof(Uw_fight_boss_hp_C_OnDamageNumChange, DamageTaken) == 0x000000, "Member 'Uw_fight_boss_hp_C_OnDamageNumChange::DamageTaken' has a wrong offset!");

// LuaFunction uw_fight_boss_hp.uw_fight_boss_hp_C.K2_OnUpdate
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_boss_hp_C_K2_OnUpdate final
{
public:
	float                                         InDeltaTime;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_boss_hp_C_K2_OnUpdate) == 0x000004, "Wrong alignment on Uw_fight_boss_hp_C_K2_OnUpdate");
static_assert(sizeof(Uw_fight_boss_hp_C_K2_OnUpdate) == 0x000004, "Wrong size on Uw_fight_boss_hp_C_K2_OnUpdate");
static_assert(offsetof(Uw_fight_boss_hp_C_K2_OnUpdate, InDeltaTime) == 0x000000, "Member 'Uw_fight_boss_hp_C_K2_OnUpdate::InDeltaTime' has a wrong offset!");

// Function uw_fight_boss_hp.uw_fight_boss_hp_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_boss_hp_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_boss_hp_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_boss_hp_C_GetModuleName");
static_assert(sizeof(Uw_fight_boss_hp_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_boss_hp_C_GetModuleName");
static_assert(offsetof(Uw_fight_boss_hp_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_boss_hp_C_GetModuleName::ReturnValue' has a wrong offset!");

}

