#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_countdown

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_countdown.uw_fight_countdown_C
// 0x0030 (0x0378 - 0x0348)
class UUw_fight_countdown_C final : public UUserWidgetAnimation
{
public:
	class UWidgetAnimation*                       Out;                                               // 0x0348(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AllEnter;                                          // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Time;                                              // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtTime1;                                          // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtTime2;                                          // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_countdown_C">();
	}
	static class UUw_fight_countdown_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_countdown_C>();
	}
};
static_assert(alignof(UUw_fight_countdown_C) == 0x000008, "Wrong alignment on UUw_fight_countdown_C");
static_assert(sizeof(UUw_fight_countdown_C) == 0x000378, "Wrong size on UUw_fight_countdown_C");
static_assert(offsetof(UUw_fight_countdown_C, Out) == 0x000348, "Member 'UUw_fight_countdown_C::Out' has a wrong offset!");
static_assert(offsetof(UUw_fight_countdown_C, AllEnter) == 0x000350, "Member 'UUw_fight_countdown_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUw_fight_countdown_C, Time) == 0x000358, "Member 'UUw_fight_countdown_C::Time' has a wrong offset!");
static_assert(offsetof(UUw_fight_countdown_C, ImgBG) == 0x000360, "Member 'UUw_fight_countdown_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_countdown_C, TxtTime1) == 0x000368, "Member 'UUw_fight_countdown_C::TxtTime1' has a wrong offset!");
static_assert(offsetof(UUw_fight_countdown_C, TxtTime2) == 0x000370, "Member 'UUw_fight_countdown_C::TxtTime2' has a wrong offset!");

}

