#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_boss_hp_animation

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_boss_hp_animation.uw_fight_boss_hp_animation_C
// 0x0018 (0x0360 - 0x0348)
class UUw_fight_boss_hp_animation_C final : public UFightBossHpAnim
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       boss_hp;                                           // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_400;                                         // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_fight_boss_hp_animation(int32 EntryPoint);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void K2_Play(float InDelayTime);
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_boss_hp_animation_C">();
	}
	static class UUw_fight_boss_hp_animation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_boss_hp_animation_C>();
	}
};
static_assert(alignof(UUw_fight_boss_hp_animation_C) == 0x000008, "Wrong alignment on UUw_fight_boss_hp_animation_C");
static_assert(sizeof(UUw_fight_boss_hp_animation_C) == 0x000360, "Wrong size on UUw_fight_boss_hp_animation_C");
static_assert(offsetof(UUw_fight_boss_hp_animation_C, UberGraphFrame) == 0x000348, "Member 'UUw_fight_boss_hp_animation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_animation_C, boss_hp) == 0x000350, "Member 'UUw_fight_boss_hp_animation_C::boss_hp' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_animation_C, Image_400) == 0x000358, "Member 'UUw_fight_boss_hp_animation_C::Image_400' has a wrong offset!");

}

