#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_crosshair_panel

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_crosshair_panel.uw_fight_crosshair_panel_C
// 0x0018 (0x0360 - 0x0348)
class UUw_fight_crosshair_panel_C final : public UCrossHairPanel
{
public:
	class UInvalidationBox*                       InvaVary;                                          // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_crossstrong_C*                Panel_crossstrong;                                 // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Root;                                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void K2_OnUpdate(float InDeltaTime);
	void InitCrossHair(const struct FSoftClassPath& CrossPath, const struct FSoftClassPath& AmmunitionPath);
	void Construct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_crosshair_panel_C">();
	}
	static class UUw_fight_crosshair_panel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_crosshair_panel_C>();
	}
};
static_assert(alignof(UUw_fight_crosshair_panel_C) == 0x000008, "Wrong alignment on UUw_fight_crosshair_panel_C");
static_assert(sizeof(UUw_fight_crosshair_panel_C) == 0x000360, "Wrong size on UUw_fight_crosshair_panel_C");
static_assert(offsetof(UUw_fight_crosshair_panel_C, InvaVary) == 0x000348, "Member 'UUw_fight_crosshair_panel_C::InvaVary' has a wrong offset!");
static_assert(offsetof(UUw_fight_crosshair_panel_C, Panel_crossstrong) == 0x000350, "Member 'UUw_fight_crosshair_panel_C::Panel_crossstrong' has a wrong offset!");
static_assert(offsetof(UUw_fight_crosshair_panel_C, Root) == 0x000358, "Member 'UUw_fight_crosshair_panel_C::Root' has a wrong offset!");

}

