#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_scene_switch_fast2

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_scene_switch_fast2.uw_fight_scene_switch_fast2_C.ExecuteUbergraph_uw_fight_scene_switch_fast2
// 0x0038 (0x0038 - 0x0000)
struct Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ASwitchMgr_C*                           CallFunc_GetActorOfClass_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_LoadClassAsset_Blocking_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_SpawnObject_ReturnValue;                  // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPostProcessMaterialParams*             K2Node_DynamicCast_AsPost_Process_Material_Params; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_StartPostProcessNew_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2) == 0x000008, "Wrong alignment on Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2");
static_assert(sizeof(Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2) == 0x000038, "Wrong size on Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2");
static_assert(offsetof(Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2, EntryPoint) == 0x000000, "Member 'Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2, CallFunc_GetActorOfClass_ReturnValue) == 0x000008, "Member 'Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2::CallFunc_GetActorOfClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2, CallFunc_LoadClassAsset_Blocking_ReturnValue) == 0x000018, "Member 'Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2::CallFunc_LoadClassAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2, CallFunc_SpawnObject_ReturnValue) == 0x000020, "Member 'Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2, K2Node_DynamicCast_AsPost_Process_Material_Params) == 0x000028, "Member 'Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2::K2Node_DynamicCast_AsPost_Process_Material_Params' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2, CallFunc_StartPostProcessNew_ReturnValue) == 0x000034, "Member 'Uw_fight_scene_switch_fast2_C_ExecuteUbergraph_uw_fight_scene_switch_fast2::CallFunc_StartPostProcessNew_ReturnValue' has a wrong offset!");

}

