#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_task_list_item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_task_list_item.uw_fight_level_task_list_item_C
// 0x0090 (0x0440 - 0x03B0)
class UUw_fight_level_task_list_item_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Reset;                                             // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Task_refreshsmall;                                 // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Task_refresh;                                      // 0x03C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Enter;                                             // 0x03D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BottomBg;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Des;                                               // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_24;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_174;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_241;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDown;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgIcon;                                           // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelDirection;                                    // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Root;                                              // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVtaSlateTexture*                       ProgressImg;                                       // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVtaSlateTexture*                       FinishImg;                                         // 0x0428(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVtaSlateTexture*                       DisableImg;                                        // 0x0430(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVtaSlateTexture*                       FileImg;                                           // 0x0438(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetState(uint8 InState);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet__Overridden(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_fight_level_task_list_item(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_task_list_item_C">();
	}
	static class UUw_fight_level_task_list_item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_task_list_item_C>();
	}
};
static_assert(alignof(UUw_fight_level_task_list_item_C) == 0x000008, "Wrong alignment on UUw_fight_level_task_list_item_C");
static_assert(sizeof(UUw_fight_level_task_list_item_C) == 0x000440, "Wrong size on UUw_fight_level_task_list_item_C");
static_assert(offsetof(UUw_fight_level_task_list_item_C, UberGraphFrame) == 0x0003B0, "Member 'UUw_fight_level_task_list_item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, Reset) == 0x0003B8, "Member 'UUw_fight_level_task_list_item_C::Reset' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, Task_refreshsmall) == 0x0003C0, "Member 'UUw_fight_level_task_list_item_C::Task_refreshsmall' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, Task_refresh) == 0x0003C8, "Member 'UUw_fight_level_task_list_item_C::Task_refresh' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, Enter) == 0x0003D0, "Member 'UUw_fight_level_task_list_item_C::Enter' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, BottomBg) == 0x0003D8, "Member 'UUw_fight_level_task_list_item_C::BottomBg' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, Des) == 0x0003E0, "Member 'UUw_fight_level_task_list_item_C::Des' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, Image_24) == 0x0003E8, "Member 'UUw_fight_level_task_list_item_C::Image_24' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, Image_174) == 0x0003F0, "Member 'UUw_fight_level_task_list_item_C::Image_174' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, Image_241) == 0x0003F8, "Member 'UUw_fight_level_task_list_item_C::Image_241' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, ImgDown) == 0x000400, "Member 'UUw_fight_level_task_list_item_C::ImgDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, ImgIcon) == 0x000408, "Member 'UUw_fight_level_task_list_item_C::ImgIcon' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, PanelDirection) == 0x000410, "Member 'UUw_fight_level_task_list_item_C::PanelDirection' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, Root) == 0x000418, "Member 'UUw_fight_level_task_list_item_C::Root' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, ProgressImg) == 0x000420, "Member 'UUw_fight_level_task_list_item_C::ProgressImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, FinishImg) == 0x000428, "Member 'UUw_fight_level_task_list_item_C::FinishImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, DisableImg) == 0x000430, "Member 'UUw_fight_level_task_list_item_C::DisableImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_list_item_C, FileImg) == 0x000438, "Member 'UUw_fight_level_task_list_item_C::FileImg' has a wrong offset!");

}

