#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_boss_hp_animation

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_boss_hp_animation.uw_fight_boss_hp_animation_C.ExecuteUbergraph_uw_fight_boss_hp_animation
// 0x0020 (0x0020 - 0x0000)
struct uw_fight_boss_hp_animation_C_ExecuteUbergraph_uw_fight_boss_hp_animation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_InDelayTime;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_boss_hp_animation_C_ExecuteUbergraph_uw_fight_boss_hp_animation;

// Function uw_fight_boss_hp_animation.uw_fight_boss_hp_animation_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_boss_hp_animation_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_boss_hp_animation_C_K2_OnCustomUmgAnimFinished;

// Function uw_fight_boss_hp_animation.uw_fight_boss_hp_animation_C.K2_Play
// 0x0004 (0x0004 - 0x0000)
struct uw_fight_boss_hp_animation_C_K2_Play final
{
public:
	float                                         InDelayTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_boss_hp_animation_C_K2_Play;

// Function uw_fight_boss_hp_animation.uw_fight_boss_hp_animation_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_boss_hp_animation_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_boss_hp_animation_C_OnListItemObjectSet;

// Function uw_fight_boss_hp_animation.uw_fight_boss_hp_animation_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_boss_hp_animation_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_boss_hp_animation_C_BP_OnItemSelectionChanged;

// Function uw_fight_boss_hp_animation.uw_fight_boss_hp_animation_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_boss_hp_animation_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_boss_hp_animation_C_BP_OnItemExpansionChanged;

}

