#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_backtrack

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_backtrack.uw_fight_backtrack_C
// 0x01E0 (0x0460 - 0x0280)
class UUw_fight_backtrack_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Click2;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Click1;                                            // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AllEnter;                                          // 0x0298(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ALLloop;                                           // 0x02A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Zero1;                                             // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Zero2;                                             // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Zero3;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Zero4;                                             // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Zero5;                                             // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           BarTime;                                           // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Black;                                             // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnLeft;                                           // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnRight;                                          // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel1;                                      // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel2;                                      // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel3;                                      // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_Left;                                  // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_Right;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img1;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img1_1;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img2;                                              // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img3;                                              // 0x0330(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img4;                                              // 0x0338(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img4_1;                                            // 0x0340(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img5;                                              // 0x0348(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img6;                                              // 0x0350(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img7;                                              // 0x0358(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBarBg;                                          // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgClickLeft;                                      // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgClickRight;                                     // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDown;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgNormalLeft;                                     // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgNormalRight;                                    // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgUp;                                             // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn1;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn2;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn3;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn_Left;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn_Right;                                      // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage1;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage2;                                      // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage3;                                      // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage_Left;                                  // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage_Right;                                 // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBar;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKey1;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKey2;                                         // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKey3;                                         // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKeyLeft;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKeyRight;                                     // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelLeft;                                         // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage;                                     // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_1;                                   // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_2;                                   // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_1216;                                // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_1309;                                // 0x0448(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                                SliderTime;                                        // 0x0450(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAlphaMaskImage*                        VXlensCap;                                         // 0x0458(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnMoveLeftStart__Overridden();
	void Construct();
	void OnMoveLeftEnd__Overridden();
	void ExecuteUbergraph_uw_fight_backtrack(int32 EntryPoint);
	void ConstructInLua__Overridden();
	void OnMoveRightStart__Overridden();
	void OnMoveRightEnd__Overridden();
	void OnMoveLeftStart();
	void OnMoveRightEnd();
	void ConstructInLua();
	void OnMoveLeftEnd();
	void OnMoveRightStart();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_backtrack_C">();
	}
	static class UUw_fight_backtrack_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_backtrack_C>();
	}
};
static_assert(alignof(UUw_fight_backtrack_C) == 0x000008, "Wrong alignment on UUw_fight_backtrack_C");
static_assert(sizeof(UUw_fight_backtrack_C) == 0x000460, "Wrong size on UUw_fight_backtrack_C");
static_assert(offsetof(UUw_fight_backtrack_C, UberGraphFrame) == 0x000280, "Member 'UUw_fight_backtrack_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Click2) == 0x000288, "Member 'UUw_fight_backtrack_C::Click2' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Click1) == 0x000290, "Member 'UUw_fight_backtrack_C::Click1' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, AllEnter) == 0x000298, "Member 'UUw_fight_backtrack_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, ALLloop) == 0x0002A0, "Member 'UUw_fight_backtrack_C::ALLloop' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Zero1) == 0x0002A8, "Member 'UUw_fight_backtrack_C::Zero1' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Zero2) == 0x0002B0, "Member 'UUw_fight_backtrack_C::Zero2' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Zero3) == 0x0002B8, "Member 'UUw_fight_backtrack_C::Zero3' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Zero4) == 0x0002C0, "Member 'UUw_fight_backtrack_C::Zero4' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Zero5) == 0x0002C8, "Member 'UUw_fight_backtrack_C::Zero5' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, BarTime) == 0x0002D0, "Member 'UUw_fight_backtrack_C::BarTime' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Black) == 0x0002D8, "Member 'UUw_fight_backtrack_C::Black' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, BtnLeft) == 0x0002E0, "Member 'UUw_fight_backtrack_C::BtnLeft' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, BtnRight) == 0x0002E8, "Member 'UUw_fight_backtrack_C::BtnRight' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, CanvasPanel1) == 0x0002F0, "Member 'UUw_fight_backtrack_C::CanvasPanel1' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, CanvasPanel2) == 0x0002F8, "Member 'UUw_fight_backtrack_C::CanvasPanel2' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, CanvasPanel3) == 0x000300, "Member 'UUw_fight_backtrack_C::CanvasPanel3' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, CanvasPanel_Left) == 0x000308, "Member 'UUw_fight_backtrack_C::CanvasPanel_Left' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, CanvasPanel_Right) == 0x000310, "Member 'UUw_fight_backtrack_C::CanvasPanel_Right' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Img1) == 0x000318, "Member 'UUw_fight_backtrack_C::Img1' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Img1_1) == 0x000320, "Member 'UUw_fight_backtrack_C::Img1_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Img2) == 0x000328, "Member 'UUw_fight_backtrack_C::Img2' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Img3) == 0x000330, "Member 'UUw_fight_backtrack_C::Img3' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Img4) == 0x000338, "Member 'UUw_fight_backtrack_C::Img4' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Img4_1) == 0x000340, "Member 'UUw_fight_backtrack_C::Img4_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Img5) == 0x000348, "Member 'UUw_fight_backtrack_C::Img5' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Img6) == 0x000350, "Member 'UUw_fight_backtrack_C::Img6' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, Img7) == 0x000358, "Member 'UUw_fight_backtrack_C::Img7' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, ImgBarBg) == 0x000360, "Member 'UUw_fight_backtrack_C::ImgBarBg' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, ImgBG) == 0x000368, "Member 'UUw_fight_backtrack_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, ImgClickLeft) == 0x000370, "Member 'UUw_fight_backtrack_C::ImgClickLeft' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, ImgClickRight) == 0x000378, "Member 'UUw_fight_backtrack_C::ImgClickRight' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, ImgDown) == 0x000380, "Member 'UUw_fight_backtrack_C::ImgDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, ImgNormalLeft) == 0x000388, "Member 'UUw_fight_backtrack_C::ImgNormalLeft' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, ImgNormalRight) == 0x000390, "Member 'UUw_fight_backtrack_C::ImgNormalRight' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, ImgUp) == 0x000398, "Member 'UUw_fight_backtrack_C::ImgUp' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, KeyBtn1) == 0x0003A0, "Member 'UUw_fight_backtrack_C::KeyBtn1' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, KeyBtn2) == 0x0003A8, "Member 'UUw_fight_backtrack_C::KeyBtn2' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, KeyBtn3) == 0x0003B0, "Member 'UUw_fight_backtrack_C::KeyBtn3' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, KeyBtn_Left) == 0x0003B8, "Member 'UUw_fight_backtrack_C::KeyBtn_Left' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, KeyBtn_Right) == 0x0003C0, "Member 'UUw_fight_backtrack_C::KeyBtn_Right' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, KeyBtnImage1) == 0x0003C8, "Member 'UUw_fight_backtrack_C::KeyBtnImage1' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, KeyBtnImage2) == 0x0003D0, "Member 'UUw_fight_backtrack_C::KeyBtnImage2' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, KeyBtnImage3) == 0x0003D8, "Member 'UUw_fight_backtrack_C::KeyBtnImage3' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, KeyBtnImage_Left) == 0x0003E0, "Member 'UUw_fight_backtrack_C::KeyBtnImage_Left' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, KeyBtnImage_Right) == 0x0003E8, "Member 'UUw_fight_backtrack_C::KeyBtnImage_Right' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, PanelBar) == 0x0003F0, "Member 'UUw_fight_backtrack_C::PanelBar' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, PanelKey1) == 0x0003F8, "Member 'UUw_fight_backtrack_C::PanelKey1' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, PanelKey2) == 0x000400, "Member 'UUw_fight_backtrack_C::PanelKey2' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, PanelKey3) == 0x000408, "Member 'UUw_fight_backtrack_C::PanelKey3' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, PanelKeyLeft) == 0x000410, "Member 'UUw_fight_backtrack_C::PanelKeyLeft' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, PanelKeyRight) == 0x000418, "Member 'UUw_fight_backtrack_C::PanelKeyRight' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, PanelLeft) == 0x000420, "Member 'UUw_fight_backtrack_C::PanelLeft' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, RedirectImage) == 0x000428, "Member 'UUw_fight_backtrack_C::RedirectImage' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, RedirectImage_1) == 0x000430, "Member 'UUw_fight_backtrack_C::RedirectImage_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, RedirectImage_2) == 0x000438, "Member 'UUw_fight_backtrack_C::RedirectImage_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, RedirectImage_1216) == 0x000440, "Member 'UUw_fight_backtrack_C::RedirectImage_1216' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, RedirectImage_1309) == 0x000448, "Member 'UUw_fight_backtrack_C::RedirectImage_1309' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, SliderTime) == 0x000450, "Member 'UUw_fight_backtrack_C::SliderTime' has a wrong offset!");
static_assert(offsetof(UUw_fight_backtrack_C, VXlensCap) == 0x000458, "Member 'UUw_fight_backtrack_C::VXlensCap' has a wrong offset!");

}

