#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_ammunition6

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_ammunition6.uw_fight_ammunition6_C
// 0x0040 (0x03B0 - 0x0370)
class UUw_fight_ammunition6_C final : public UCrossAmmunition1
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0370(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Change;                                            // 0x0378(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UE_ui_fightstrong_08_p_C*               E_ui_fightstrong_08_p_C;                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fightstrong_08_p_C*               E_ui_fightstrong_08_p_C_354;                       // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_2;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelStrongNum;                                    // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelStrongTime;                                   // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_uw_fight_ammunition6(int32 EntryPoint);
	void SetBulletTimeEffect(bool bShow);
	void SetBulletEffect(bool bShow);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_ammunition6_C">();
	}
	static class UUw_fight_ammunition6_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_ammunition6_C>();
	}
};
static_assert(alignof(UUw_fight_ammunition6_C) == 0x000008, "Wrong alignment on UUw_fight_ammunition6_C");
static_assert(sizeof(UUw_fight_ammunition6_C) == 0x0003B0, "Wrong size on UUw_fight_ammunition6_C");
static_assert(offsetof(UUw_fight_ammunition6_C, UberGraphFrame) == 0x000370, "Member 'UUw_fight_ammunition6_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition6_C, Change) == 0x000378, "Member 'UUw_fight_ammunition6_C::Change' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition6_C, E_ui_fightstrong_08_p_C) == 0x000380, "Member 'UUw_fight_ammunition6_C::E_ui_fightstrong_08_p_C' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition6_C, E_ui_fightstrong_08_p_C_354) == 0x000388, "Member 'UUw_fight_ammunition6_C::E_ui_fightstrong_08_p_C_354' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition6_C, Image_1) == 0x000390, "Member 'UUw_fight_ammunition6_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition6_C, Image_2) == 0x000398, "Member 'UUw_fight_ammunition6_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition6_C, PanelStrongNum) == 0x0003A0, "Member 'UUw_fight_ammunition6_C::PanelStrongNum' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition6_C, PanelStrongTime) == 0x0003A8, "Member 'UUw_fight_ammunition6_C::PanelStrongTime' has a wrong offset!");

}

