#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_gainitem

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_gainitem.uw_fight_gainitem_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_gainitem_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_gainitem_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on Uw_fight_gainitem_C_BP_OnItemExpansionChanged");
static_assert(sizeof(Uw_fight_gainitem_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on Uw_fight_gainitem_C_BP_OnItemExpansionChanged");
static_assert(offsetof(Uw_fight_gainitem_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'Uw_fight_gainitem_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function uw_fight_gainitem.uw_fight_gainitem_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_gainitem_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_gainitem_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on Uw_fight_gainitem_C_BP_OnItemSelectionChanged");
static_assert(sizeof(Uw_fight_gainitem_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on Uw_fight_gainitem_C_BP_OnItemSelectionChanged");
static_assert(offsetof(Uw_fight_gainitem_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'Uw_fight_gainitem_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function uw_fight_gainitem.uw_fight_gainitem_C.OnListItemObjectSet__Overridden
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_gainitem_C_OnListItemObjectSet__Overridden final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_gainitem_C_OnListItemObjectSet__Overridden) == 0x000008, "Wrong alignment on Uw_fight_gainitem_C_OnListItemObjectSet__Overridden");
static_assert(sizeof(Uw_fight_gainitem_C_OnListItemObjectSet__Overridden) == 0x000008, "Wrong size on Uw_fight_gainitem_C_OnListItemObjectSet__Overridden");
static_assert(offsetof(Uw_fight_gainitem_C_OnListItemObjectSet__Overridden, ListItemObject) == 0x000000, "Member 'Uw_fight_gainitem_C_OnListItemObjectSet__Overridden::ListItemObject' has a wrong offset!");

// Function uw_fight_gainitem.uw_fight_gainitem_C.ExecuteUbergraph_uw_fight_gainitem
// 0x0018 (0x0018 - 0x0000)
struct Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem) == 0x000008, "Wrong alignment on Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem");
static_assert(sizeof(Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem) == 0x000018, "Wrong size on Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem");
static_assert(offsetof(Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem, EntryPoint) == 0x000000, "Member 'Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem, K2Node_Event_ListItemObject) == 0x000008, "Member 'Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem, K2Node_Event_bIsExpanded) == 0x000010, "Member 'Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem, K2Node_Event_bIsSelected) == 0x000011, "Member 'Uw_fight_gainitem_C_ExecuteUbergraph_uw_fight_gainitem::K2Node_Event_bIsSelected' has a wrong offset!");

// LuaFunction uw_fight_gainitem.uw_fight_gainitem_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_gainitem_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_gainitem_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on Uw_fight_gainitem_C_OnListItemObjectSet");
static_assert(sizeof(Uw_fight_gainitem_C_OnListItemObjectSet) == 0x000008, "Wrong size on Uw_fight_gainitem_C_OnListItemObjectSet");
static_assert(offsetof(Uw_fight_gainitem_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'Uw_fight_gainitem_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function uw_fight_gainitem.uw_fight_gainitem_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_gainitem_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_gainitem_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_gainitem_C_GetModuleName");
static_assert(sizeof(Uw_fight_gainitem_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_gainitem_C_GetModuleName");
static_assert(offsetof(Uw_fight_gainitem_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_gainitem_C_GetModuleName::ReturnValue' has a wrong offset!");

}

