#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_damage_gamelevel

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_damage_gamelevel.uw_fight_damage_gamelevel_C
// 0x0018 (0x0298 - 0x0280)
class UUw_fight_damage_gamelevel_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Enter;                                             // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtDamage1;                                        // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtKillNum;                                        // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_damage_gamelevel_C">();
	}
	static class UUw_fight_damage_gamelevel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_damage_gamelevel_C>();
	}
};
static_assert(alignof(UUw_fight_damage_gamelevel_C) == 0x000008, "Wrong alignment on UUw_fight_damage_gamelevel_C");
static_assert(sizeof(UUw_fight_damage_gamelevel_C) == 0x000298, "Wrong size on UUw_fight_damage_gamelevel_C");
static_assert(offsetof(UUw_fight_damage_gamelevel_C, Enter) == 0x000280, "Member 'UUw_fight_damage_gamelevel_C::Enter' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_gamelevel_C, TxtDamage1) == 0x000288, "Member 'UUw_fight_damage_gamelevel_C::TxtDamage1' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_gamelevel_C, TxtKillNum) == 0x000290, "Member 'UUw_fight_damage_gamelevel_C::TxtKillNum' has a wrong offset!");

}

