#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_task_item_pc

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_level_task_item_pc.uw_fight_level_task_item_pc_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_level_task_item_pc_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_level_task_item_pc_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on Uw_fight_level_task_item_pc_C_BP_OnItemExpansionChanged");
static_assert(sizeof(Uw_fight_level_task_item_pc_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on Uw_fight_level_task_item_pc_C_BP_OnItemExpansionChanged");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'Uw_fight_level_task_item_pc_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function uw_fight_level_task_item_pc.uw_fight_level_task_item_pc_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_level_task_item_pc_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_level_task_item_pc_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on Uw_fight_level_task_item_pc_C_BP_OnItemSelectionChanged");
static_assert(sizeof(Uw_fight_level_task_item_pc_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on Uw_fight_level_task_item_pc_C_BP_OnItemSelectionChanged");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'Uw_fight_level_task_item_pc_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function uw_fight_level_task_item_pc.uw_fight_level_task_item_pc_C.OnListItemObjectSet__Overridden
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_level_task_item_pc_C_OnListItemObjectSet__Overridden final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_level_task_item_pc_C_OnListItemObjectSet__Overridden) == 0x000008, "Wrong alignment on Uw_fight_level_task_item_pc_C_OnListItemObjectSet__Overridden");
static_assert(sizeof(Uw_fight_level_task_item_pc_C_OnListItemObjectSet__Overridden) == 0x000008, "Wrong size on Uw_fight_level_task_item_pc_C_OnListItemObjectSet__Overridden");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_OnListItemObjectSet__Overridden, ListItemObject) == 0x000000, "Member 'Uw_fight_level_task_item_pc_C_OnListItemObjectSet__Overridden::ListItemObject' has a wrong offset!");

// Function uw_fight_level_task_item_pc.uw_fight_level_task_item_pc_C.ExecuteUbergraph_uw_fight_level_task_item_pc
// 0x0058 (0x0058 - 0x0000)
struct Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_16[0x2];                                       // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ALevelPathPainter*                      CallFunc_GetLevelPathPainter_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue_1;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller_1;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc) == 0x000008, "Wrong alignment on Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc");
static_assert(sizeof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc) == 0x000058, "Wrong size on Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, EntryPoint) == 0x000000, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, K2Node_Event_bIsExpanded) == 0x000014, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, K2Node_Event_bIsSelected) == 0x000015, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, K2Node_Event_ListItemObject) == 0x000018, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, CallFunc_GetLevelPathPainter_ReturnValue) == 0x000020, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::CallFunc_GetLevelPathPainter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, CallFunc_GetPlayerController_ReturnValue) == 0x000028, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, CallFunc_GetPlayerController_ReturnValue_1) == 0x000030, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::CallFunc_GetPlayerController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000038, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, K2Node_DynamicCast_AsGame_Player_Controller_1) == 0x000048, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::K2Node_DynamicCast_AsGame_Player_Controller_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'Uw_fight_level_task_item_pc_C_ExecuteUbergraph_uw_fight_level_task_item_pc::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// LuaFunction uw_fight_level_task_item_pc.uw_fight_level_task_item_pc_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_level_task_item_pc_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_level_task_item_pc_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on Uw_fight_level_task_item_pc_C_OnListItemObjectSet");
static_assert(sizeof(Uw_fight_level_task_item_pc_C_OnListItemObjectSet) == 0x000008, "Wrong size on Uw_fight_level_task_item_pc_C_OnListItemObjectSet");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'Uw_fight_level_task_item_pc_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function uw_fight_level_task_item_pc.uw_fight_level_task_item_pc_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_level_task_item_pc_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_level_task_item_pc_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_level_task_item_pc_C_GetModuleName");
static_assert(sizeof(Uw_fight_level_task_item_pc_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_level_task_item_pc_C_GetModuleName");
static_assert(offsetof(Uw_fight_level_task_item_pc_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_level_task_item_pc_C_GetModuleName::ReturnValue' has a wrong offset!");

}

