#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_monster_hp_ordinary

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_monster_hp_ordinary.uw_fight_monster_hp_ordinary_C.UpdateImage
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_monster_hp_ordinary_C_UpdateImage final
{
public:
	EFightMonsterTipsType                         InTipsType;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_monster_hp_ordinary_C_UpdateImage) == 0x000001, "Wrong alignment on Uw_fight_monster_hp_ordinary_C_UpdateImage");
static_assert(sizeof(Uw_fight_monster_hp_ordinary_C_UpdateImage) == 0x000001, "Wrong size on Uw_fight_monster_hp_ordinary_C_UpdateImage");
static_assert(offsetof(Uw_fight_monster_hp_ordinary_C_UpdateImage, InTipsType) == 0x000000, "Member 'Uw_fight_monster_hp_ordinary_C_UpdateImage::InTipsType' has a wrong offset!");

// Function uw_fight_monster_hp_ordinary.uw_fight_monster_hp_ordinary_C.ExecuteUbergraph_uw_fight_monster_hp_ordinary
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFightMonsterTipsType                         K2Node_Event_InTipsType;                           // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary) == 0x000004, "Wrong alignment on Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary");
static_assert(sizeof(Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary) == 0x000008, "Wrong size on Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary");
static_assert(offsetof(Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary, EntryPoint) == 0x000000, "Member 'Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary, K2Node_Event_InTipsType) == 0x000004, "Member 'Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary::K2Node_Event_InTipsType' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'Uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// LuaFunction uw_fight_monster_hp_ordinary.uw_fight_monster_hp_ordinary_C.K2_OnAppliedModifierChange
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange final
{
public:
	int32                                         ModifierID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsApply;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         InLauncherCharacterHashIndex;                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange) == 0x000008, "Wrong alignment on Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange");
static_assert(sizeof(Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange) == 0x000010, "Wrong size on Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange");
static_assert(offsetof(Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange, ModifierID) == 0x000000, "Member 'Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange::ModifierID' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange, IsApply) == 0x000004, "Member 'Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange::IsApply' has a wrong offset!");
static_assert(offsetof(Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange, InLauncherCharacterHashIndex) == 0x000008, "Member 'Uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange::InLauncherCharacterHashIndex' has a wrong offset!");

// Function uw_fight_monster_hp_ordinary.uw_fight_monster_hp_ordinary_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_monster_hp_ordinary_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_monster_hp_ordinary_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_monster_hp_ordinary_C_GetModuleName");
static_assert(sizeof(Uw_fight_monster_hp_ordinary_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_monster_hp_ordinary_C_GetModuleName");
static_assert(offsetof(Uw_fight_monster_hp_ordinary_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_monster_hp_ordinary_C_GetModuleName::ReturnValue' has a wrong offset!");

}

