#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_cancel_button_left_New

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_cancel_button_left_New.uw_fight_cancel_button_left_new_C
// 0x0020 (0x04E8 - 0x04C8)
class UUw_fight_cancel_button_left_new_C final : public UNewLeftCancel
{
public:
	class URedirectImage*                         Nomral;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Press;                                             // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Press_1;                                           // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_34;                                  // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_cancel_button_left_new_C">();
	}
	static class UUw_fight_cancel_button_left_new_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_cancel_button_left_new_C>();
	}
};
static_assert(alignof(UUw_fight_cancel_button_left_new_C) == 0x000008, "Wrong alignment on UUw_fight_cancel_button_left_new_C");
static_assert(sizeof(UUw_fight_cancel_button_left_new_C) == 0x0004E8, "Wrong size on UUw_fight_cancel_button_left_new_C");
static_assert(offsetof(UUw_fight_cancel_button_left_new_C, Nomral) == 0x0004C8, "Member 'UUw_fight_cancel_button_left_new_C::Nomral' has a wrong offset!");
static_assert(offsetof(UUw_fight_cancel_button_left_new_C, Press) == 0x0004D0, "Member 'UUw_fight_cancel_button_left_new_C::Press' has a wrong offset!");
static_assert(offsetof(UUw_fight_cancel_button_left_new_C, Press_1) == 0x0004D8, "Member 'UUw_fight_cancel_button_left_new_C::Press_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_cancel_button_left_new_C, RedirectImage_34) == 0x0004E0, "Member 'UUw_fight_cancel_button_left_new_C::RedirectImage_34' has a wrong offset!");

}

