#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_bar

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_bar.uw_fight_level_bar_C
// 0x0050 (0x0400 - 0x03B0)
class UUw_fight_level_bar_C final : public ULuaWidget
{
public:
	class UProgressBar*                           BarNum;                                            // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_2;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_4;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgType;                                           // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgType_1;                                         // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtName;                                           // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtNum;                                            // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_bar_C">();
	}
	static class UUw_fight_level_bar_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_bar_C>();
	}
};
static_assert(alignof(UUw_fight_level_bar_C) == 0x000008, "Wrong alignment on UUw_fight_level_bar_C");
static_assert(sizeof(UUw_fight_level_bar_C) == 0x000400, "Wrong size on UUw_fight_level_bar_C");
static_assert(offsetof(UUw_fight_level_bar_C, BarNum) == 0x0003B0, "Member 'UUw_fight_level_bar_C::BarNum' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_bar_C, Image) == 0x0003B8, "Member 'UUw_fight_level_bar_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_bar_C, Image_1) == 0x0003C0, "Member 'UUw_fight_level_bar_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_bar_C, Image_2) == 0x0003C8, "Member 'UUw_fight_level_bar_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_bar_C, Image_3) == 0x0003D0, "Member 'UUw_fight_level_bar_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_bar_C, Image_4) == 0x0003D8, "Member 'UUw_fight_level_bar_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_bar_C, ImgType) == 0x0003E0, "Member 'UUw_fight_level_bar_C::ImgType' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_bar_C, ImgType_1) == 0x0003E8, "Member 'UUw_fight_level_bar_C::ImgType_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_bar_C, TxtName) == 0x0003F0, "Member 'UUw_fight_level_bar_C::TxtName' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_bar_C, TxtNum) == 0x0003F8, "Member 'UUw_fight_level_bar_C::TxtNum' has a wrong offset!");

}

