#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_skill_panel_pc

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_skill_panel_pc.uw_fight_skill_panel_pc_C.OnWeaponChange
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_skill_panel_pc_C_OnWeaponChange final
{
public:
	class APlayerWeapon*                          InWeapon;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_skill_panel_pc_C_OnWeaponChange;

// Function uw_fight_skill_panel_pc.uw_fight_skill_panel_pc_C.ShowOrHideCancelBtn
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_panel_pc_C_ShowOrHideCancelBtn final
{
public:
	bool                                          bShow;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_panel_pc_C_ShowOrHideCancelBtn;

// Function uw_fight_skill_panel_pc.uw_fight_skill_panel_pc_C.ExecuteUbergraph_uw_fight_skill_panel_pc
// 0x0018 (0x0018 - 0x0000)
struct uw_fight_skill_panel_pc_C_ExecuteUbergraph_uw_fight_skill_panel_pc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          K2Node_Event_InWeapon;                             // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bShow;                                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_panel_pc_C_ExecuteUbergraph_uw_fight_skill_panel_pc;

}

