#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_defense_fullcombo

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_defense_fullcombo.uw_fight_defense_fullcombo_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_defense_fullcombo_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_defense_fullcombo_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_defense_fullcombo_C_GetModuleName");
static_assert(sizeof(Uw_fight_defense_fullcombo_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_defense_fullcombo_C_GetModuleName");
static_assert(offsetof(Uw_fight_defense_fullcombo_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_defense_fullcombo_C_GetModuleName::ReturnValue' has a wrong offset!");

// LuaFunction uw_fight_defense_fullcombo.uw_fight_defense_fullcombo_C.WidgetGeometryReadyFrame
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_defense_fullcombo_C_WidgetGeometryReadyFrame final
{
public:
	int32                                         Frame;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_defense_fullcombo_C_WidgetGeometryReadyFrame) == 0x000004, "Wrong alignment on Uw_fight_defense_fullcombo_C_WidgetGeometryReadyFrame");
static_assert(sizeof(Uw_fight_defense_fullcombo_C_WidgetGeometryReadyFrame) == 0x000004, "Wrong size on Uw_fight_defense_fullcombo_C_WidgetGeometryReadyFrame");
static_assert(offsetof(Uw_fight_defense_fullcombo_C_WidgetGeometryReadyFrame, Frame) == 0x000000, "Member 'Uw_fight_defense_fullcombo_C_WidgetGeometryReadyFrame::Frame' has a wrong offset!");

}

