#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_npcfriend_hp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_npcfriend_hp.uw_fight_npcfriend_hp_C
// 0x0078 (0x03C0 - 0x0348)
class UUw_fight_npcfriend_hp_C final : public UUserWidgetAnimation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0348(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Monsterhp_appear;                                  // 0x0350(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HpBreak;                                           // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HpLow;                                             // 0x0368(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           BarHp;                                             // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           BarHpRed;                                          // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_90;                                          // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBreak;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgTarget;                                         // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         LastPercent;                                       // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurPercent;                                        // 0x03B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LerpTime;                                          // 0x03B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayLowAnim(bool bLow);
	void PlayBreakAnim();
	void SetHpPercent(float Percent);
	void K2_OnUpdate(float InDeltaTime);
	void ExecuteUbergraph_uw_fight_npcfriend_hp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_npcfriend_hp_C">();
	}
	static class UUw_fight_npcfriend_hp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_npcfriend_hp_C>();
	}
};
static_assert(alignof(UUw_fight_npcfriend_hp_C) == 0x000008, "Wrong alignment on UUw_fight_npcfriend_hp_C");
static_assert(sizeof(UUw_fight_npcfriend_hp_C) == 0x0003C0, "Wrong size on UUw_fight_npcfriend_hp_C");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, UberGraphFrame) == 0x000348, "Member 'UUw_fight_npcfriend_hp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, Monsterhp_appear) == 0x000350, "Member 'UUw_fight_npcfriend_hp_C::Monsterhp_appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, Reset) == 0x000358, "Member 'UUw_fight_npcfriend_hp_C::Reset' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, HpBreak) == 0x000360, "Member 'UUw_fight_npcfriend_hp_C::HpBreak' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, HpLow) == 0x000368, "Member 'UUw_fight_npcfriend_hp_C::HpLow' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, BarHp) == 0x000370, "Member 'UUw_fight_npcfriend_hp_C::BarHp' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, BarHpRed) == 0x000378, "Member 'UUw_fight_npcfriend_hp_C::BarHpRed' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, Image) == 0x000380, "Member 'UUw_fight_npcfriend_hp_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, Image_90) == 0x000388, "Member 'UUw_fight_npcfriend_hp_C::Image_90' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, ImgBG) == 0x000390, "Member 'UUw_fight_npcfriend_hp_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, ImgBreak) == 0x000398, "Member 'UUw_fight_npcfriend_hp_C::ImgBreak' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, ImgTarget) == 0x0003A0, "Member 'UUw_fight_npcfriend_hp_C::ImgTarget' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, InvalidationBox_0) == 0x0003A8, "Member 'UUw_fight_npcfriend_hp_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, LastPercent) == 0x0003B0, "Member 'UUw_fight_npcfriend_hp_C::LastPercent' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, CurPercent) == 0x0003B4, "Member 'UUw_fight_npcfriend_hp_C::CurPercent' has a wrong offset!");
static_assert(offsetof(UUw_fight_npcfriend_hp_C, LerpTime) == 0x0003B8, "Member 'UUw_fight_npcfriend_hp_C::LerpTime' has a wrong offset!");

}

