#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_cross8

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_cross8.uw_fight_cross8_C
// 0x0160 (0x05F0 - 0x0490)
class UUw_fight_cross8_C final : public UCrossHair_FightCross6
{
public:
	class UWidgetAnimation*                       ChangeAim1_2;                                      // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChangeAimMode2;                                    // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       ChangeAimMode1;                                    // 0x04A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Center;                                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CrossPanel;                                        // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration11;                                      // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration12;                                      // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration13;                                      // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration13_1;                                    // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration14;                                      // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration15;                                      // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration16;                                      // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration22;                                      // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration24;                                      // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration25;                                      // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration27_1;                                    // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration27_2;                                    // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration27_3;                                    // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration27_4;                                    // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration28_1;                                    // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration28_2;                                    // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration28_3;                                    // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration28_4;                                    // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration32;                                      // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration33;                                      // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration34;                                      // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Decoration35;                                      // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Group_zoom_mode1;                                  // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Group_zoom_mode2;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Group_zoom_mode3;                                  // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       GroupAmmunition;                                   // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Left;                                              // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Left2;                                             // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line01;                                            // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line02;                                            // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line03;                                            // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line04;                                            // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line05;                                            // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line06;                                            // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Line07;                                            // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Right;                                             // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                               Right2;                                            // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Root;                                              // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_cross8_C">();
	}
	static class UUw_fight_cross8_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_cross8_C>();
	}
};
static_assert(alignof(UUw_fight_cross8_C) == 0x000010, "Wrong alignment on UUw_fight_cross8_C");
static_assert(sizeof(UUw_fight_cross8_C) == 0x0005F0, "Wrong size on UUw_fight_cross8_C");
static_assert(offsetof(UUw_fight_cross8_C, ChangeAim1_2) == 0x000490, "Member 'UUw_fight_cross8_C::ChangeAim1_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, ChangeAimMode2) == 0x000498, "Member 'UUw_fight_cross8_C::ChangeAimMode2' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, ChangeAimMode1) == 0x0004A0, "Member 'UUw_fight_cross8_C::ChangeAimMode1' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Center) == 0x0004A8, "Member 'UUw_fight_cross8_C::Center' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, CrossPanel) == 0x0004B0, "Member 'UUw_fight_cross8_C::CrossPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration11) == 0x0004B8, "Member 'UUw_fight_cross8_C::Decoration11' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration12) == 0x0004C0, "Member 'UUw_fight_cross8_C::Decoration12' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration13) == 0x0004C8, "Member 'UUw_fight_cross8_C::Decoration13' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration13_1) == 0x0004D0, "Member 'UUw_fight_cross8_C::Decoration13_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration14) == 0x0004D8, "Member 'UUw_fight_cross8_C::Decoration14' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration15) == 0x0004E0, "Member 'UUw_fight_cross8_C::Decoration15' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration16) == 0x0004E8, "Member 'UUw_fight_cross8_C::Decoration16' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration22) == 0x0004F0, "Member 'UUw_fight_cross8_C::Decoration22' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration24) == 0x0004F8, "Member 'UUw_fight_cross8_C::Decoration24' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration25) == 0x000500, "Member 'UUw_fight_cross8_C::Decoration25' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration27_1) == 0x000508, "Member 'UUw_fight_cross8_C::Decoration27_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration27_2) == 0x000510, "Member 'UUw_fight_cross8_C::Decoration27_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration27_3) == 0x000518, "Member 'UUw_fight_cross8_C::Decoration27_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration27_4) == 0x000520, "Member 'UUw_fight_cross8_C::Decoration27_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration28_1) == 0x000528, "Member 'UUw_fight_cross8_C::Decoration28_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration28_2) == 0x000530, "Member 'UUw_fight_cross8_C::Decoration28_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration28_3) == 0x000538, "Member 'UUw_fight_cross8_C::Decoration28_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration28_4) == 0x000540, "Member 'UUw_fight_cross8_C::Decoration28_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration32) == 0x000548, "Member 'UUw_fight_cross8_C::Decoration32' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration33) == 0x000550, "Member 'UUw_fight_cross8_C::Decoration33' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration34) == 0x000558, "Member 'UUw_fight_cross8_C::Decoration34' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Decoration35) == 0x000560, "Member 'UUw_fight_cross8_C::Decoration35' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Group_zoom_mode1) == 0x000568, "Member 'UUw_fight_cross8_C::Group_zoom_mode1' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Group_zoom_mode2) == 0x000570, "Member 'UUw_fight_cross8_C::Group_zoom_mode2' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Group_zoom_mode3) == 0x000578, "Member 'UUw_fight_cross8_C::Group_zoom_mode3' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, GroupAmmunition) == 0x000580, "Member 'UUw_fight_cross8_C::GroupAmmunition' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Left) == 0x000588, "Member 'UUw_fight_cross8_C::Left' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Left2) == 0x000590, "Member 'UUw_fight_cross8_C::Left2' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Line01) == 0x000598, "Member 'UUw_fight_cross8_C::Line01' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Line02) == 0x0005A0, "Member 'UUw_fight_cross8_C::Line02' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Line03) == 0x0005A8, "Member 'UUw_fight_cross8_C::Line03' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Line04) == 0x0005B0, "Member 'UUw_fight_cross8_C::Line04' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Line05) == 0x0005B8, "Member 'UUw_fight_cross8_C::Line05' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Line06) == 0x0005C0, "Member 'UUw_fight_cross8_C::Line06' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Line07) == 0x0005C8, "Member 'UUw_fight_cross8_C::Line07' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Right) == 0x0005D0, "Member 'UUw_fight_cross8_C::Right' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Right2) == 0x0005D8, "Member 'UUw_fight_cross8_C::Right2' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross8_C, Root) == 0x0005E0, "Member 'UUw_fight_cross8_C::Root' has a wrong offset!");

}

