#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_direction_friend

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_direction_friend.uw_fight_direction_friend_C
// 0x0048 (0x0848 - 0x0800)
class UUw_fight_direction_friend_C final : public UFightMonsterTipsItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0810(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_8;                                           // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_30;                                          // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgArrow6;                                         // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDown;                                           // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgFriendHp;                                       // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgHeight;                                         // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTuw_fight_direction_friend_0();
	void StartLoop(const class UObject* Object, bool HasAppear);
	void SetDefendTargetPercent(float Value);
	void PlayDieAnim();
	void OnVisibilityChanged_Event_0(ESlateVisibility InVisibility);
	void AppearFinish(class UWidgetAnimation* Animation);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_uw_fight_direction_friend(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_direction_friend_C">();
	}
	static class UUw_fight_direction_friend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_direction_friend_C>();
	}
};
static_assert(alignof(UUw_fight_direction_friend_C) == 0x000008, "Wrong alignment on UUw_fight_direction_friend_C");
static_assert(sizeof(UUw_fight_direction_friend_C) == 0x000848, "Wrong size on UUw_fight_direction_friend_C");
static_assert(offsetof(UUw_fight_direction_friend_C, UberGraphFrame) == 0x000800, "Member 'UUw_fight_direction_friend_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_friend_C, Loop) == 0x000808, "Member 'UUw_fight_direction_friend_C::Loop' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_friend_C, Appear) == 0x000810, "Member 'UUw_fight_direction_friend_C::Appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_friend_C, Image_8) == 0x000818, "Member 'UUw_fight_direction_friend_C::Image_8' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_friend_C, Image_30) == 0x000820, "Member 'UUw_fight_direction_friend_C::Image_30' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_friend_C, ImgArrow6) == 0x000828, "Member 'UUw_fight_direction_friend_C::ImgArrow6' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_friend_C, ImgDown) == 0x000830, "Member 'UUw_fight_direction_friend_C::ImgDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_friend_C, ImgFriendHp) == 0x000838, "Member 'UUw_fight_direction_friend_C::ImgFriendHp' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_friend_C, ImgHeight) == 0x000840, "Member 'UUw_fight_direction_friend_C::ImgHeight' has a wrong offset!");

}

