#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_direction_stealth

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_direction_stealth.uw_fight_direction_stealth_C
// 0x0030 (0x0830 - 0x0800)
class UUw_fight_direction_stealth_C final : public UFightMonsterTipsItem
{
public:
	class UWidgetAnimation*                       Activation;                                        // 0x0800(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Enter;                                             // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           BarStealth;                                        // 0x0810(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelArrow;                                        // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_direction_stealth_C">();
	}
	static class UUw_fight_direction_stealth_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_direction_stealth_C>();
	}
};
static_assert(alignof(UUw_fight_direction_stealth_C) == 0x000008, "Wrong alignment on UUw_fight_direction_stealth_C");
static_assert(sizeof(UUw_fight_direction_stealth_C) == 0x000830, "Wrong size on UUw_fight_direction_stealth_C");
static_assert(offsetof(UUw_fight_direction_stealth_C, Activation) == 0x000800, "Member 'UUw_fight_direction_stealth_C::Activation' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_stealth_C, Enter) == 0x000808, "Member 'UUw_fight_direction_stealth_C::Enter' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_stealth_C, BarStealth) == 0x000810, "Member 'UUw_fight_direction_stealth_C::BarStealth' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_stealth_C, Image) == 0x000818, "Member 'UUw_fight_direction_stealth_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_stealth_C, Image_1) == 0x000820, "Member 'UUw_fight_direction_stealth_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_stealth_C, PanelArrow) == 0x000828, "Member 'UUw_fight_direction_stealth_C::PanelArrow' has a wrong offset!");

}

