#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_sign

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_sign.uw_fight_sign_C
// 0x0018 (0x03D0 - 0x03B8)
class UUw_fight_sign_C final : public UFightModifierSpecialSignaItem
{
public:
	class UWidgetAnimation*                       Aim;                                               // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_23;                                  // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_97;                                  // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_sign_C">();
	}
	static class UUw_fight_sign_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_sign_C>();
	}
};
static_assert(alignof(UUw_fight_sign_C) == 0x000008, "Wrong alignment on UUw_fight_sign_C");
static_assert(sizeof(UUw_fight_sign_C) == 0x0003D0, "Wrong size on UUw_fight_sign_C");
static_assert(offsetof(UUw_fight_sign_C, Aim) == 0x0003B8, "Member 'UUw_fight_sign_C::Aim' has a wrong offset!");
static_assert(offsetof(UUw_fight_sign_C, RedirectImage_23) == 0x0003C0, "Member 'UUw_fight_sign_C::RedirectImage_23' has a wrong offset!");
static_assert(offsetof(UUw_fight_sign_C, RedirectImage_97) == 0x0003C8, "Member 'UUw_fight_sign_C::RedirectImage_97' has a wrong offset!");

}

