#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_damage_num_xxx

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_damage_num_xxx.uw_fight_damage_num_xxx_C
// 0x0018 (0x03F8 - 0x03E0)
class UUw_fight_damage_num_xxx_C final : public UDamageFloat_Base
{
public:
	class UWidgetAnimation*                       Anim1;                                             // 0x03E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_damage_num_C*                 Num;                                               // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_79;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_damage_num_xxx_C">();
	}
	static class UUw_fight_damage_num_xxx_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_damage_num_xxx_C>();
	}
};
static_assert(alignof(UUw_fight_damage_num_xxx_C) == 0x000008, "Wrong alignment on UUw_fight_damage_num_xxx_C");
static_assert(sizeof(UUw_fight_damage_num_xxx_C) == 0x0003F8, "Wrong size on UUw_fight_damage_num_xxx_C");
static_assert(offsetof(UUw_fight_damage_num_xxx_C, Anim1) == 0x0003E0, "Member 'UUw_fight_damage_num_xxx_C::Anim1' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_num_xxx_C, Num) == 0x0003E8, "Member 'UUw_fight_damage_num_xxx_C::Num' has a wrong offset!");
static_assert(offsetof(UUw_fight_damage_num_xxx_C, Overlay_79) == 0x0003F0, "Member 'UUw_fight_damage_num_xxx_C::Overlay_79' has a wrong offset!");

}

