#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_reload_turret

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_reload_turret.uw_fight_reload_turret_C
// 0x0028 (0x03B0 - 0x0388)
class UUw_fight_reload_turret_C final : public UFightReload
{
public:
	class UWidgetAnimation*                       Reset;                                             // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Group_Reload;                                      // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_Reload;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_Reload_Bullet;                               // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_reload_turret_C">();
	}
	static class UUw_fight_reload_turret_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_reload_turret_C>();
	}
};
static_assert(alignof(UUw_fight_reload_turret_C) == 0x000008, "Wrong alignment on UUw_fight_reload_turret_C");
static_assert(sizeof(UUw_fight_reload_turret_C) == 0x0003B0, "Wrong size on UUw_fight_reload_turret_C");
static_assert(offsetof(UUw_fight_reload_turret_C, Reset) == 0x000388, "Member 'UUw_fight_reload_turret_C::Reset' has a wrong offset!");
static_assert(offsetof(UUw_fight_reload_turret_C, Group_Reload) == 0x000390, "Member 'UUw_fight_reload_turret_C::Group_Reload' has a wrong offset!");
static_assert(offsetof(UUw_fight_reload_turret_C, Image_Reload) == 0x000398, "Member 'UUw_fight_reload_turret_C::Image_Reload' has a wrong offset!");
static_assert(offsetof(UUw_fight_reload_turret_C, Image_Reload_Bullet) == 0x0003A0, "Member 'UUw_fight_reload_turret_C::Image_Reload_Bullet' has a wrong offset!");
static_assert(offsetof(UUw_fight_reload_turret_C, InvalidationBox_0) == 0x0003A8, "Member 'UUw_fight_reload_turret_C::InvalidationBox_0' has a wrong offset!");

}

