#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_skill_aim_prompt

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_skill_aim_prompt.uw_fight_skill_aim_prompt_C
// 0x0018 (0x02D8 - 0x02C0)
class UUw_fight_skill_aim_prompt_C final : public UFightSkillAim
{
public:
	class UWidgetAnimation*                       Aim;                                               // 0x02C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_29;                                          // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_91;                                          // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_skill_aim_prompt_C">();
	}
	static class UUw_fight_skill_aim_prompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_skill_aim_prompt_C>();
	}
};
static_assert(alignof(UUw_fight_skill_aim_prompt_C) == 0x000008, "Wrong alignment on UUw_fight_skill_aim_prompt_C");
static_assert(sizeof(UUw_fight_skill_aim_prompt_C) == 0x0002D8, "Wrong size on UUw_fight_skill_aim_prompt_C");
static_assert(offsetof(UUw_fight_skill_aim_prompt_C, Aim) == 0x0002C0, "Member 'UUw_fight_skill_aim_prompt_C::Aim' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_aim_prompt_C, Image_29) == 0x0002C8, "Member 'UUw_fight_skill_aim_prompt_C::Image_29' has a wrong offset!");
static_assert(offsetof(UUw_fight_skill_aim_prompt_C, Image_91) == 0x0002D0, "Member 'UUw_fight_skill_aim_prompt_C::Image_91' has a wrong offset!");

}

