#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_guideimg

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_guideimg.uw_fight_guideimg_C
// 0x0028 (0x03D8 - 0x03B0)
class UUw_fight_guideimg_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       Pressed;                                           // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCustomButton*                          BtnGuide;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_40;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_28;                                  // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_guideimg_C">();
	}
	static class UUw_fight_guideimg_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_guideimg_C>();
	}
};
static_assert(alignof(UUw_fight_guideimg_C) == 0x000008, "Wrong alignment on UUw_fight_guideimg_C");
static_assert(sizeof(UUw_fight_guideimg_C) == 0x0003D8, "Wrong size on UUw_fight_guideimg_C");
static_assert(offsetof(UUw_fight_guideimg_C, Pressed) == 0x0003B0, "Member 'UUw_fight_guideimg_C::Pressed' has a wrong offset!");
static_assert(offsetof(UUw_fight_guideimg_C, BtnGuide) == 0x0003B8, "Member 'UUw_fight_guideimg_C::BtnGuide' has a wrong offset!");
static_assert(offsetof(UUw_fight_guideimg_C, Image) == 0x0003C0, "Member 'UUw_fight_guideimg_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_guideimg_C, Image_40) == 0x0003C8, "Member 'UUw_fight_guideimg_C::Image_40' has a wrong offset!");
static_assert(offsetof(UUw_fight_guideimg_C, RedirectImage_28) == 0x0003D0, "Member 'UUw_fight_guideimg_C::RedirectImage_28' has a wrong offset!");

}

