#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_guide_keyprompt

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_guide_keyprompt.uw_fight_guide_keyprompt_C
// 0x0018 (0x03C8 - 0x03B0)
class UUw_fight_guide_keyprompt_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUw_guide_keybtn_C*                     KeyBtn;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtKeybtn;                                         // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet__Overridden(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_fight_guide_keyprompt(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_guide_keyprompt_C">();
	}
	static class UUw_fight_guide_keyprompt_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_guide_keyprompt_C>();
	}
};
static_assert(alignof(UUw_fight_guide_keyprompt_C) == 0x000008, "Wrong alignment on UUw_fight_guide_keyprompt_C");
static_assert(sizeof(UUw_fight_guide_keyprompt_C) == 0x0003C8, "Wrong size on UUw_fight_guide_keyprompt_C");
static_assert(offsetof(UUw_fight_guide_keyprompt_C, UberGraphFrame) == 0x0003B0, "Member 'UUw_fight_guide_keyprompt_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_guide_keyprompt_C, KeyBtn) == 0x0003B8, "Member 'UUw_fight_guide_keyprompt_C::KeyBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_guide_keyprompt_C, TxtKeybtn) == 0x0003C0, "Member 'UUw_fight_guide_keyprompt_C::TxtKeybtn' has a wrong offset!");

}

