#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_online_res_tips

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_online_res_tips.uw_fight_online_res_tips_C
// 0x0098 (0x0448 - 0x03B0)
class UUw_fight_online_res_tips_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       AllEnter;                                          // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_2;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_194;                                         // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelPre;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelStart;                                        // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Time1;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Time2;                                             // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtOnlineResPre;                                   // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtOnlineResPreIntro;                              // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtOnlineResPreTime;                               // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtOnlineResStart;                                 // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtOnlineResStartIntro;                            // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtOnlineResStartTime;                             // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       VX;                                                // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White;                                             // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White_1;                                           // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White_left;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White_right;                                       // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_online_res_tips_C">();
	}
	static class UUw_fight_online_res_tips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_online_res_tips_C>();
	}
};
static_assert(alignof(UUw_fight_online_res_tips_C) == 0x000008, "Wrong alignment on UUw_fight_online_res_tips_C");
static_assert(sizeof(UUw_fight_online_res_tips_C) == 0x000448, "Wrong size on UUw_fight_online_res_tips_C");
static_assert(offsetof(UUw_fight_online_res_tips_C, AllEnter) == 0x0003B0, "Member 'UUw_fight_online_res_tips_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, Image_1) == 0x0003B8, "Member 'UUw_fight_online_res_tips_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, Image_2) == 0x0003C0, "Member 'UUw_fight_online_res_tips_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, Image_194) == 0x0003C8, "Member 'UUw_fight_online_res_tips_C::Image_194' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, PanelPre) == 0x0003D0, "Member 'UUw_fight_online_res_tips_C::PanelPre' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, PanelStart) == 0x0003D8, "Member 'UUw_fight_online_res_tips_C::PanelStart' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, Time1) == 0x0003E0, "Member 'UUw_fight_online_res_tips_C::Time1' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, Time2) == 0x0003E8, "Member 'UUw_fight_online_res_tips_C::Time2' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, TxtOnlineResPre) == 0x0003F0, "Member 'UUw_fight_online_res_tips_C::TxtOnlineResPre' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, TxtOnlineResPreIntro) == 0x0003F8, "Member 'UUw_fight_online_res_tips_C::TxtOnlineResPreIntro' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, TxtOnlineResPreTime) == 0x000400, "Member 'UUw_fight_online_res_tips_C::TxtOnlineResPreTime' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, TxtOnlineResStart) == 0x000408, "Member 'UUw_fight_online_res_tips_C::TxtOnlineResStart' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, TxtOnlineResStartIntro) == 0x000410, "Member 'UUw_fight_online_res_tips_C::TxtOnlineResStartIntro' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, TxtOnlineResStartTime) == 0x000418, "Member 'UUw_fight_online_res_tips_C::TxtOnlineResStartTime' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, VX) == 0x000420, "Member 'UUw_fight_online_res_tips_C::VX' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, White) == 0x000428, "Member 'UUw_fight_online_res_tips_C::White' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, White_1) == 0x000430, "Member 'UUw_fight_online_res_tips_C::White_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, White_left) == 0x000438, "Member 'UUw_fight_online_res_tips_C::White_left' has a wrong offset!");
static_assert(offsetof(UUw_fight_online_res_tips_C, White_right) == 0x000440, "Member 'UUw_fight_online_res_tips_C::White_right' has a wrong offset!");

}

