#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_scene_on

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_scene_on.uw_fight_scene_on_C.SceneOn
// 0x0028 (0x0028 - 0x0000)
struct Uw_fight_scene_on_C_SceneOn final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0018(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterial_AsMaterial_Instance_Dynamic; // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_scene_on_C_SceneOn) == 0x000008, "Wrong alignment on Uw_fight_scene_on_C_SceneOn");
static_assert(sizeof(Uw_fight_scene_on_C_SceneOn) == 0x000028, "Wrong size on Uw_fight_scene_on_C_SceneOn");
static_assert(offsetof(Uw_fight_scene_on_C_SceneOn, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'Uw_fight_scene_on_C_SceneOn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_SceneOn, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Uw_fight_scene_on_C_SceneOn::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_SceneOn, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000018, "Member 'Uw_fight_scene_on_C_SceneOn::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_SceneOn, CallFunc_CreateDynamicMaterial_AsMaterial_Instance_Dynamic) == 0x000020, "Member 'Uw_fight_scene_on_C_SceneOn::CallFunc_CreateDynamicMaterial_AsMaterial_Instance_Dynamic' has a wrong offset!");

// Function uw_fight_scene_on.uw_fight_scene_on_C.Tick
// 0x003C (0x003C - 0x0000)
struct Uw_fight_scene_on_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_scene_on_C_Tick) == 0x000004, "Wrong alignment on Uw_fight_scene_on_C_Tick");
static_assert(sizeof(Uw_fight_scene_on_C_Tick) == 0x00003C, "Wrong size on Uw_fight_scene_on_C_Tick");
static_assert(offsetof(Uw_fight_scene_on_C_Tick, MyGeometry) == 0x000000, "Member 'Uw_fight_scene_on_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_Tick, InDeltaTime) == 0x000038, "Member 'Uw_fight_scene_on_C_Tick::InDeltaTime' has a wrong offset!");

// Function uw_fight_scene_on.uw_fight_scene_on_C.ExecuteUbergraph_uw_fight_scene_on
// 0x0100 (0x0100 - 0x0000)
struct Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      K2Node_MakeMap_Map;                                // 0x0008(0x0050)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0058(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A5[0x3];                                       // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, float>                      K2Node_MakeMap_Map_1;                              // 0x00B0(0x0050)()
};
static_assert(alignof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on) == 0x000008, "Wrong alignment on Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on");
static_assert(sizeof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on) == 0x000100, "Wrong size on Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, EntryPoint) == 0x000000, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, K2Node_MakeMap_Map) == 0x000008, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::K2Node_MakeMap_Map' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, K2Node_Event_MyGeometry) == 0x000058, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, K2Node_Event_InDeltaTime) == 0x000090, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, CallFunc_Add_FloatFloat_ReturnValue) == 0x000094, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000098, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00009C, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, CallFunc_GetFloatValue_ReturnValue) == 0x0000A0, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000A4, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, CallFunc_GetFloatValue_ReturnValue_1) == 0x0000A8, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on, K2Node_MakeMap_Map_1) == 0x0000B0, "Member 'Uw_fight_scene_on_C_ExecuteUbergraph_uw_fight_scene_on::K2Node_MakeMap_Map_1' has a wrong offset!");

}

