#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_direction_dialogue

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_direction_dialogue.uw_fight_direction_dialogue_C.StartLoop
// 0x0018 (0x0018 - 0x0000)
struct Uw_fight_direction_dialogue_C_StartLoop final
{
public:
	const class UObject*                          Object;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          HasAppear;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AnimName;                                          // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_direction_dialogue_C_StartLoop) == 0x000008, "Wrong alignment on Uw_fight_direction_dialogue_C_StartLoop");
static_assert(sizeof(Uw_fight_direction_dialogue_C_StartLoop) == 0x000018, "Wrong size on Uw_fight_direction_dialogue_C_StartLoop");
static_assert(offsetof(Uw_fight_direction_dialogue_C_StartLoop, Object) == 0x000000, "Member 'Uw_fight_direction_dialogue_C_StartLoop::Object' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_StartLoop, HasAppear) == 0x000008, "Member 'Uw_fight_direction_dialogue_C_StartLoop::HasAppear' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_StartLoop, AnimName) == 0x00000C, "Member 'Uw_fight_direction_dialogue_C_StartLoop::AnimName' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_StartLoop, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000014, "Member 'Uw_fight_direction_dialogue_C_StartLoop::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function uw_fight_direction_dialogue.uw_fight_direction_dialogue_C.SetDefendTargetPercent
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_direction_dialogue_C_SetDefendTargetPercent final
{
public:
	float                                         Value;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_direction_dialogue_C_SetDefendTargetPercent) == 0x000004, "Wrong alignment on Uw_fight_direction_dialogue_C_SetDefendTargetPercent");
static_assert(sizeof(Uw_fight_direction_dialogue_C_SetDefendTargetPercent) == 0x000004, "Wrong size on Uw_fight_direction_dialogue_C_SetDefendTargetPercent");
static_assert(offsetof(Uw_fight_direction_dialogue_C_SetDefendTargetPercent, Value) == 0x000000, "Member 'Uw_fight_direction_dialogue_C_SetDefendTargetPercent::Value' has a wrong offset!");

// Function uw_fight_direction_dialogue.uw_fight_direction_dialogue_C.OnVisibilityChanged_Event_0
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_direction_dialogue_C_OnVisibilityChanged_Event_0 final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_direction_dialogue_C_OnVisibilityChanged_Event_0) == 0x000001, "Wrong alignment on Uw_fight_direction_dialogue_C_OnVisibilityChanged_Event_0");
static_assert(sizeof(Uw_fight_direction_dialogue_C_OnVisibilityChanged_Event_0) == 0x000001, "Wrong size on Uw_fight_direction_dialogue_C_OnVisibilityChanged_Event_0");
static_assert(offsetof(Uw_fight_direction_dialogue_C_OnVisibilityChanged_Event_0, InVisibility) == 0x000000, "Member 'Uw_fight_direction_dialogue_C_OnVisibilityChanged_Event_0::InVisibility' has a wrong offset!");

// Function uw_fight_direction_dialogue.uw_fight_direction_dialogue_C.AppearFinish
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_direction_dialogue_C_AppearFinish final
{
public:
	class UWidgetAnimation*                       Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_direction_dialogue_C_AppearFinish) == 0x000008, "Wrong alignment on Uw_fight_direction_dialogue_C_AppearFinish");
static_assert(sizeof(Uw_fight_direction_dialogue_C_AppearFinish) == 0x000008, "Wrong size on Uw_fight_direction_dialogue_C_AppearFinish");
static_assert(offsetof(Uw_fight_direction_dialogue_C_AppearFinish, Animation) == 0x000000, "Member 'Uw_fight_direction_dialogue_C_AppearFinish::Animation' has a wrong offset!");

// Function uw_fight_direction_dialogue.uw_fight_direction_dialogue_C.OnAnimationFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_direction_dialogue_C_OnAnimationFinished final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_direction_dialogue_C_OnAnimationFinished) == 0x000008, "Wrong alignment on Uw_fight_direction_dialogue_C_OnAnimationFinished");
static_assert(sizeof(Uw_fight_direction_dialogue_C_OnAnimationFinished) == 0x000008, "Wrong size on Uw_fight_direction_dialogue_C_OnAnimationFinished");
static_assert(offsetof(Uw_fight_direction_dialogue_C_OnAnimationFinished, Animation) == 0x000000, "Member 'Uw_fight_direction_dialogue_C_OnAnimationFinished::Animation' has a wrong offset!");

// Function uw_fight_direction_dialogue.uw_fight_direction_dialogue_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_direction_dialogue_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_direction_dialogue_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_direction_dialogue_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_direction_dialogue_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_direction_dialogue_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_direction_dialogue_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_direction_dialogue_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// Function uw_fight_direction_dialogue.uw_fight_direction_dialogue_C.ExecuteUbergraph_uw_fight_direction_dialogue
// 0x0030 (0x0030 - 0x0000)
struct Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidgetAnimation*                       K2Node_CustomEvent_Animation;                      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	const class UWidgetAnimation*                 K2Node_Event_Animation;                            // 0x0020(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue) == 0x000008, "Wrong alignment on Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue");
static_assert(sizeof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue) == 0x000030, "Wrong size on Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, EntryPoint) == 0x000000, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, K2Node_Event_AnimName) == 0x000004, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::K2Node_Event_AnimName' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, K2Node_CustomEvent_InVisibility) == 0x00000C, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x00000D, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x00000E, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, K2Node_CustomEvent_Animation) == 0x000010, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::K2Node_CustomEvent_Animation' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, CallFunc_BooleanAND_ReturnValue) == 0x000018, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, K2Node_Event_Animation) == 0x000020, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::K2Node_Event_Animation' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, CallFunc_IsVisible_ReturnValue) == 0x000028, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000029, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, CallFunc_BooleanAND_ReturnValue_1) == 0x00002A, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, CallFunc_Not_PreBool_ReturnValue) == 0x00002B, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue, CallFunc_BooleanAND_ReturnValue_2) == 0x00002C, "Member 'Uw_fight_direction_dialogue_C_ExecuteUbergraph_uw_fight_direction_dialogue::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");

}

