#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_grenade_firebtn

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_grenade_firebtn.uw_fight_grenade_firebtn_C
// 0x0068 (0x0558 - 0x04F0)
class UUw_fight_grenade_firebtn_C final : public UNewFireButton
{
public:
	class URedirectImage*                         BG;                                                // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel;                                       // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UButton*                                Fire;                                              // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_44;                                          // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_81;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn;                                            // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage;                                       // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask;                                              // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKey;                                          // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelPress;                                        // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         PressImg;                                          // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Select;                                            // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Silence;                                           // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_grenade_firebtn_C">();
	}
	static class UUw_fight_grenade_firebtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_grenade_firebtn_C>();
	}
};
static_assert(alignof(UUw_fight_grenade_firebtn_C) == 0x000008, "Wrong alignment on UUw_fight_grenade_firebtn_C");
static_assert(sizeof(UUw_fight_grenade_firebtn_C) == 0x000558, "Wrong size on UUw_fight_grenade_firebtn_C");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, BG) == 0x0004F0, "Member 'UUw_fight_grenade_firebtn_C::BG' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, CanvasPanel) == 0x0004F8, "Member 'UUw_fight_grenade_firebtn_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, Fire) == 0x000500, "Member 'UUw_fight_grenade_firebtn_C::Fire' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, Image_44) == 0x000508, "Member 'UUw_fight_grenade_firebtn_C::Image_44' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, Image_81) == 0x000510, "Member 'UUw_fight_grenade_firebtn_C::Image_81' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, KeyBtn) == 0x000518, "Member 'UUw_fight_grenade_firebtn_C::KeyBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, KeyBtnImage) == 0x000520, "Member 'UUw_fight_grenade_firebtn_C::KeyBtnImage' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, Mask) == 0x000528, "Member 'UUw_fight_grenade_firebtn_C::Mask' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, PanelKey) == 0x000530, "Member 'UUw_fight_grenade_firebtn_C::PanelKey' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, PanelPress) == 0x000538, "Member 'UUw_fight_grenade_firebtn_C::PanelPress' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, PressImg) == 0x000540, "Member 'UUw_fight_grenade_firebtn_C::PressImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, Select) == 0x000548, "Member 'UUw_fight_grenade_firebtn_C::Select' has a wrong offset!");
static_assert(offsetof(UUw_fight_grenade_firebtn_C, Silence) == 0x000550, "Member 'UUw_fight_grenade_firebtn_C::Silence' has a wrong offset!");

}

