#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_npc_hpnpbreak

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_npc_hpnpbreak.uw_fight_npc_hpnpbreak_C.ExecuteUbergraph_uw_fight_npc_hpnpbreak
// 0x0048 (0x0048 - 0x0000)
struct uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_Percent;                        // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bLow;                           // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimPlayingFromAnimation_ReturnValue;   // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_npc_hpnpbreak_C_ExecuteUbergraph_uw_fight_npc_hpnpbreak;

// Function uw_fight_npc_hpnpbreak.uw_fight_npc_hpnpbreak_C.PlayLowAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_npc_hpnpbreak_C_PlayLowAnim final
{
public:
	bool                                          bLow;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_npc_hpnpbreak_C_PlayLowAnim;

// Function uw_fight_npc_hpnpbreak.uw_fight_npc_hpnpbreak_C.Tick
// 0x003C (0x003C - 0x0000)
struct uw_fight_npc_hpnpbreak_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_npc_hpnpbreak_C_Tick;

// Function uw_fight_npc_hpnpbreak.uw_fight_npc_hpnpbreak_C.SetHpPercent
// 0x0004 (0x0004 - 0x0000)
struct uw_fight_npc_hpnpbreak_C_SetHpPercent final
{
public:
	float                                         Percent;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_npc_hpnpbreak_C_SetHpPercent;

}

