#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_grenade_tips

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_grenade_tips.uw_fight_grenade_tips_C
// 0x0030 (0x03E0 - 0x03B0)
class Uuw_fight_grenade_tips_C final : public UGrenadeTips
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Group_Injured;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img_Injured5;                                      // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img_Injured5_1;                                    // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         MaxSpeed;                                          // 0x03D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_uw_fight_grenade_tips(int32 EntryPoint);
	void Tick__Overridden(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Play();
	void Stop();
	void SetPlaySpeed(float InSpeedPre);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void ReceiveWarning(bool IsWarning, float InTotalTime);
	void Destruct();
	void OnConstruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("uw_fight_grenade_tips_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"uw_fight_grenade_tips_C")
	}
	static class Uuw_fight_grenade_tips_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uuw_fight_grenade_tips_C>();
	}
};
DUMPER7_ASSERTS_Uuw_fight_grenade_tips_C;

}

