#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_element_list

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_element_list.uw_fight_element_list_C
// 0x0020 (0x0380 - 0x0360)
class UUw_fight_element_list_C final : public UElemExplosionUIItem
{
public:
	class UWidgetAnimation*                       On;                                                // 0x0360(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_321;                                         // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgElement;                                        // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_element_list_C">();
	}
	static class UUw_fight_element_list_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_element_list_C>();
	}
};
static_assert(alignof(UUw_fight_element_list_C) == 0x000008, "Wrong alignment on UUw_fight_element_list_C");
static_assert(sizeof(UUw_fight_element_list_C) == 0x000380, "Wrong size on UUw_fight_element_list_C");
static_assert(offsetof(UUw_fight_element_list_C, On) == 0x000360, "Member 'UUw_fight_element_list_C::On' has a wrong offset!");
static_assert(offsetof(UUw_fight_element_list_C, Image) == 0x000368, "Member 'UUw_fight_element_list_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_element_list_C, Image_321) == 0x000370, "Member 'UUw_fight_element_list_C::Image_321' has a wrong offset!");
static_assert(offsetof(UUw_fight_element_list_C, ImgElement) == 0x000378, "Member 'UUw_fight_element_list_C::ImgElement' has a wrong offset!");

}

