#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_boss_hp_bosspoint

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_boss_hp_bosspoint.uw_fight_boss_hp_bosspoint_C
// 0x0020 (0x03A0 - 0x0380)
class UUw_fight_boss_hp_bosspoint_C final : public UElemBossModifier
{
public:
	class UWidgetAnimation*                       Recovery;                                          // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Ues;                                               // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgPoint;                                          // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_boss_hp_bosspoint_C">();
	}
	static class UUw_fight_boss_hp_bosspoint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_boss_hp_bosspoint_C>();
	}
};
static_assert(alignof(UUw_fight_boss_hp_bosspoint_C) == 0x000008, "Wrong alignment on UUw_fight_boss_hp_bosspoint_C");
static_assert(sizeof(UUw_fight_boss_hp_bosspoint_C) == 0x0003A0, "Wrong size on UUw_fight_boss_hp_bosspoint_C");
static_assert(offsetof(UUw_fight_boss_hp_bosspoint_C, Recovery) == 0x000380, "Member 'UUw_fight_boss_hp_bosspoint_C::Recovery' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_bosspoint_C, Ues) == 0x000388, "Member 'UUw_fight_boss_hp_bosspoint_C::Ues' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_bosspoint_C, ImgBG) == 0x000390, "Member 'UUw_fight_boss_hp_bosspoint_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_boss_hp_bosspoint_C, ImgPoint) == 0x000398, "Member 'UUw_fight_boss_hp_bosspoint_C::ImgPoint' has a wrong offset!");

}

