#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_direction_servant

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_direction_servant.uw_fight_direction_servant_C
// 0x0048 (0x0848 - 0x0800)
class UUw_fight_direction_servant_C final : public UFightMonsterTipsItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       MonsterDie;                                        // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Loop;                                              // 0x0810(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0818(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgArrow5;                                         // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDown;                                           // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgHeight;                                         // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomText*                            PanelServant;                                      // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTuw_fight_direction_servant_0();
	void StartLoop(const class FName AnimName, bool HasAppear);
	void SetDefendTargetPercent(float Value);
	void OnVisibilityChanged_Event_0(ESlateVisibility InVisibility);
	void AppearFinish(class UWidgetAnimation* Animation);
	void PlayDieAnim();
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_uw_fight_direction_servant(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_direction_servant_C">();
	}
	static class UUw_fight_direction_servant_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_direction_servant_C>();
	}
};
static_assert(alignof(UUw_fight_direction_servant_C) == 0x000008, "Wrong alignment on UUw_fight_direction_servant_C");
static_assert(sizeof(UUw_fight_direction_servant_C) == 0x000848, "Wrong size on UUw_fight_direction_servant_C");
static_assert(offsetof(UUw_fight_direction_servant_C, UberGraphFrame) == 0x000800, "Member 'UUw_fight_direction_servant_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_servant_C, MonsterDie) == 0x000808, "Member 'UUw_fight_direction_servant_C::MonsterDie' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_servant_C, Loop) == 0x000810, "Member 'UUw_fight_direction_servant_C::Loop' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_servant_C, Appear) == 0x000818, "Member 'UUw_fight_direction_servant_C::Appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_servant_C, Image_3) == 0x000820, "Member 'UUw_fight_direction_servant_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_servant_C, ImgArrow5) == 0x000828, "Member 'UUw_fight_direction_servant_C::ImgArrow5' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_servant_C, ImgDown) == 0x000830, "Member 'UUw_fight_direction_servant_C::ImgDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_servant_C, ImgHeight) == 0x000838, "Member 'UUw_fight_direction_servant_C::ImgHeight' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_servant_C, PanelServant) == 0x000840, "Member 'UUw_fight_direction_servant_C::PanelServant' has a wrong offset!");

}

