#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_sudden

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_sudden.uw_fight_level_sudden_C
// 0x0098 (0x0448 - 0x03B0)
class UUw_fight_level_sudden_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       Fail;                                              // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Success;                                           // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       AllEnter;                                          // 0x03C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           BarTime;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Fail2;                                             // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgOn;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgOn_1;                                           // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelFail;                                         // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelOff;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelOn;                                           // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelSuccess;                                      // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fighttask_01_p_C*                 ParticleFail;                                      // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fighttask_01_p_C*                 ParticleOn;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Success2;                                          // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtDescOff;                                        // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtDescOn;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtNameOff;                                        // 0x0438(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtNameOn;                                         // 0x0440(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_sudden_C">();
	}
	static class UUw_fight_level_sudden_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_sudden_C>();
	}
};
static_assert(alignof(UUw_fight_level_sudden_C) == 0x000008, "Wrong alignment on UUw_fight_level_sudden_C");
static_assert(sizeof(UUw_fight_level_sudden_C) == 0x000448, "Wrong size on UUw_fight_level_sudden_C");
static_assert(offsetof(UUw_fight_level_sudden_C, Fail) == 0x0003B0, "Member 'UUw_fight_level_sudden_C::Fail' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, Success) == 0x0003B8, "Member 'UUw_fight_level_sudden_C::Success' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, AllEnter) == 0x0003C0, "Member 'UUw_fight_level_sudden_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, BarTime) == 0x0003C8, "Member 'UUw_fight_level_sudden_C::BarTime' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, Fail2) == 0x0003D0, "Member 'UUw_fight_level_sudden_C::Fail2' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, ImgBG) == 0x0003D8, "Member 'UUw_fight_level_sudden_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, ImgOn) == 0x0003E0, "Member 'UUw_fight_level_sudden_C::ImgOn' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, ImgOn_1) == 0x0003E8, "Member 'UUw_fight_level_sudden_C::ImgOn_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, PanelFail) == 0x0003F0, "Member 'UUw_fight_level_sudden_C::PanelFail' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, PanelOff) == 0x0003F8, "Member 'UUw_fight_level_sudden_C::PanelOff' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, PanelOn) == 0x000400, "Member 'UUw_fight_level_sudden_C::PanelOn' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, PanelSuccess) == 0x000408, "Member 'UUw_fight_level_sudden_C::PanelSuccess' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, ParticleFail) == 0x000410, "Member 'UUw_fight_level_sudden_C::ParticleFail' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, ParticleOn) == 0x000418, "Member 'UUw_fight_level_sudden_C::ParticleOn' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, Success2) == 0x000420, "Member 'UUw_fight_level_sudden_C::Success2' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, TxtDescOff) == 0x000428, "Member 'UUw_fight_level_sudden_C::TxtDescOff' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, TxtDescOn) == 0x000430, "Member 'UUw_fight_level_sudden_C::TxtDescOn' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, TxtNameOff) == 0x000438, "Member 'UUw_fight_level_sudden_C::TxtNameOff' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_sudden_C, TxtNameOn) == 0x000440, "Member 'UUw_fight_level_sudden_C::TxtNameOn' has a wrong offset!");

}

