#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_cross9

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_cross9.uw_fight_cross9_C
// 0x0040 (0x04B0 - 0x0470)
class UUw_fight_cross9_C final : public UCrossHair_FightCross5
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URedirectImage*                         Center;                                            // 0x0478(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CrossPanel;                                        // 0x0480(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Group_zoom;                                        // 0x0488(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       GroupAmmunition;                                   // 0x0490(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvaVary;                                          // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Root;                                              // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              Visibity;                                          // 0x04A8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_uw_fight_cross9(int32 EntryPoint);
	void K2_OnReloading(bool bIsReload, EWeaponType Type, bool bInterrupt, float AnimTime);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_cross9_C">();
	}
	static class UUw_fight_cross9_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_cross9_C>();
	}
};
static_assert(alignof(UUw_fight_cross9_C) == 0x000010, "Wrong alignment on UUw_fight_cross9_C");
static_assert(sizeof(UUw_fight_cross9_C) == 0x0004B0, "Wrong size on UUw_fight_cross9_C");
static_assert(offsetof(UUw_fight_cross9_C, UberGraphFrame) == 0x000470, "Member 'UUw_fight_cross9_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross9_C, Center) == 0x000478, "Member 'UUw_fight_cross9_C::Center' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross9_C, CrossPanel) == 0x000480, "Member 'UUw_fight_cross9_C::CrossPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross9_C, Group_zoom) == 0x000488, "Member 'UUw_fight_cross9_C::Group_zoom' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross9_C, GroupAmmunition) == 0x000490, "Member 'UUw_fight_cross9_C::GroupAmmunition' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross9_C, InvaVary) == 0x000498, "Member 'UUw_fight_cross9_C::InvaVary' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross9_C, Root) == 0x0004A0, "Member 'UUw_fight_cross9_C::Root' has a wrong offset!");
static_assert(offsetof(UUw_fight_cross9_C, Visibity) == 0x0004A8, "Member 'UUw_fight_cross9_C::Visibity' has a wrong offset!");

}

