#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_plm_frame

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_plm_frame.uw_fight_plm_frame_C
// 0x0070 (0x04F0 - 0x0480)
class UUw_fight_plm_frame_C final : public UCrossHair_FightPlmFarme
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0480(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Animation_Rotate;                                  // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Center;                                            // 0x0498(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CrossPanel;                                        // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       GroupAmmunition;                                   // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_bg1;                                         // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_bg2;                                         // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_Hit;                                         // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_Hit_1;                                       // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_Hit_2;                                       // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_Hit_3;                                       // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Root;                                              // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	ESlateVisibility                              Visibity;                                          // 0x04E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void K2_OnReloading(bool bIsReload, EWeaponType Type, bool bInterrupt, float AnimTime);
	void ExecuteUbergraph_uw_fight_plm_frame(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_plm_frame_C">();
	}
	static class UUw_fight_plm_frame_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_plm_frame_C>();
	}
};
static_assert(alignof(UUw_fight_plm_frame_C) == 0x000010, "Wrong alignment on UUw_fight_plm_frame_C");
static_assert(sizeof(UUw_fight_plm_frame_C) == 0x0004F0, "Wrong size on UUw_fight_plm_frame_C");
static_assert(offsetof(UUw_fight_plm_frame_C, UberGraphFrame) == 0x000480, "Member 'UUw_fight_plm_frame_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, NewAnimation) == 0x000488, "Member 'UUw_fight_plm_frame_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, Animation_Rotate) == 0x000490, "Member 'UUw_fight_plm_frame_C::Animation_Rotate' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, Center) == 0x000498, "Member 'UUw_fight_plm_frame_C::Center' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, CrossPanel) == 0x0004A0, "Member 'UUw_fight_plm_frame_C::CrossPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, GroupAmmunition) == 0x0004A8, "Member 'UUw_fight_plm_frame_C::GroupAmmunition' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, Image_bg1) == 0x0004B0, "Member 'UUw_fight_plm_frame_C::Image_bg1' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, Image_bg2) == 0x0004B8, "Member 'UUw_fight_plm_frame_C::Image_bg2' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, Image_Hit) == 0x0004C0, "Member 'UUw_fight_plm_frame_C::Image_Hit' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, Image_Hit_1) == 0x0004C8, "Member 'UUw_fight_plm_frame_C::Image_Hit_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, Image_Hit_2) == 0x0004D0, "Member 'UUw_fight_plm_frame_C::Image_Hit_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, Image_Hit_3) == 0x0004D8, "Member 'UUw_fight_plm_frame_C::Image_Hit_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, Root) == 0x0004E0, "Member 'UUw_fight_plm_frame_C::Root' has a wrong offset!");
static_assert(offsetof(UUw_fight_plm_frame_C, Visibity) == 0x0004E8, "Member 'UUw_fight_plm_frame_C::Visibity' has a wrong offset!");

}

