#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_action

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_action.uw_fight_action_C
// 0x0068 (0x0418 - 0x03B0)
class UUw_fight_action_C final : public ULuaWidget
{
public:
	class UWidgetAnimation*                       AllEnter;                                          // 0x03B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUw_fight_action_item_C*                Action1;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_action_item_C*                Action2;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_action_item_C*                Action3;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUmg_common_bg_detail_C*                BG;                                                // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BottomBg;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnOK;                                             // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Btns;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_14;                                          // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_16;                                          // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_17;                                          // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask;                                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RedirectImage_40;                                  // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_action_C">();
	}
	static class UUw_fight_action_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_action_C>();
	}
};
static_assert(alignof(UUw_fight_action_C) == 0x000008, "Wrong alignment on UUw_fight_action_C");
static_assert(sizeof(UUw_fight_action_C) == 0x000418, "Wrong size on UUw_fight_action_C");
static_assert(offsetof(UUw_fight_action_C, AllEnter) == 0x0003B0, "Member 'UUw_fight_action_C::AllEnter' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, Action1) == 0x0003B8, "Member 'UUw_fight_action_C::Action1' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, Action2) == 0x0003C0, "Member 'UUw_fight_action_C::Action2' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, Action3) == 0x0003C8, "Member 'UUw_fight_action_C::Action3' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, BG) == 0x0003D0, "Member 'UUw_fight_action_C::BG' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, BottomBg) == 0x0003D8, "Member 'UUw_fight_action_C::BottomBg' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, BtnOK) == 0x0003E0, "Member 'UUw_fight_action_C::BtnOK' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, Btns) == 0x0003E8, "Member 'UUw_fight_action_C::Btns' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, Image_14) == 0x0003F0, "Member 'UUw_fight_action_C::Image_14' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, Image_16) == 0x0003F8, "Member 'UUw_fight_action_C::Image_16' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, Image_17) == 0x000400, "Member 'UUw_fight_action_C::Image_17' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, Mask) == 0x000408, "Member 'UUw_fight_action_C::Mask' has a wrong offset!");
static_assert(offsetof(UUw_fight_action_C, RedirectImage_40) == 0x000410, "Member 'UUw_fight_action_C::RedirectImage_40' has a wrong offset!");

}

