#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_skill_aim_girl005aatk

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_skill_aim_girl005aatk.uw_fight_skill_aim_girl005aatk_C.OnVis
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_skill_aim_girl005aatk_C_OnVis final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_skill_aim_girl005aatk_C_OnVis) == 0x000001, "Wrong alignment on Uw_fight_skill_aim_girl005aatk_C_OnVis");
static_assert(sizeof(Uw_fight_skill_aim_girl005aatk_C_OnVis) == 0x000001, "Wrong size on Uw_fight_skill_aim_girl005aatk_C_OnVis");
static_assert(offsetof(Uw_fight_skill_aim_girl005aatk_C_OnVis, InVisibility) == 0x000000, "Member 'Uw_fight_skill_aim_girl005aatk_C_OnVis::InVisibility' has a wrong offset!");

// Function uw_fight_skill_aim_girl005aatk.uw_fight_skill_aim_girl005aatk_C.ExecuteUbergraph_uw_fight_skill_aim_girl005aatk
// 0x0018 (0x0018 - 0x0000)
struct Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk) == 0x000004, "Wrong alignment on Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk");
static_assert(sizeof(Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk) == 0x000018, "Wrong size on Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk");
static_assert(offsetof(Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk, EntryPoint) == 0x000000, "Member 'Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk, K2Node_CustomEvent_InVisibility) == 0x000014, "Member 'Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk, K2Node_SwitchEnum_CmpSuccess) == 0x000015, "Member 'Uw_fight_skill_aim_girl005aatk_C_ExecuteUbergraph_uw_fight_skill_aim_girl005aatk::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

