#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_ammunition_girl023

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_ammunition_girl023.uw_fight_ammunition_girl023_C
// 0x0028 (0x03A0 - 0x0378)
class Uuw_fight_ammunition_girl023_C final : public UCrossAmmunition
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Out;                                               // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Enter;                                             // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         ImgAmmunition;                                     // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtNum;                                            // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_uw_fight_ammunition_girl023(int32 EntryPoint);
	void BP_ChangeType(bool bActive, bool bFromQTE);
	void OnBulletChange(int32 InCurBullet, int32 InMaxBullet, float InPercent);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("uw_fight_ammunition_girl023_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"uw_fight_ammunition_girl023_C")
	}
	static class Uuw_fight_ammunition_girl023_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uuw_fight_ammunition_girl023_C>();
	}
};
DUMPER7_ASSERTS_Uuw_fight_ammunition_girl023_C;

}

