#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_operateswitch_btn

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_operateswitch_btn.uw_fight_operateswitch_btn_C
// 0x0038 (0x03E8 - 0x03B0)
class UUw_fight_operateswitch_btn_C final : public ULuaWidget
{
public:
	class UButton*                                BtnSwitch;                                         // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel;                                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ForbiddenMask;                                     // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_8;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage;                                       // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKey;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_operateswitch_btn_C">();
	}
	static class UUw_fight_operateswitch_btn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_operateswitch_btn_C>();
	}
};
static_assert(alignof(UUw_fight_operateswitch_btn_C) == 0x000008, "Wrong alignment on UUw_fight_operateswitch_btn_C");
static_assert(sizeof(UUw_fight_operateswitch_btn_C) == 0x0003E8, "Wrong size on UUw_fight_operateswitch_btn_C");
static_assert(offsetof(UUw_fight_operateswitch_btn_C, BtnSwitch) == 0x0003B0, "Member 'UUw_fight_operateswitch_btn_C::BtnSwitch' has a wrong offset!");
static_assert(offsetof(UUw_fight_operateswitch_btn_C, CanvasPanel) == 0x0003B8, "Member 'UUw_fight_operateswitch_btn_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_operateswitch_btn_C, ForbiddenMask) == 0x0003C0, "Member 'UUw_fight_operateswitch_btn_C::ForbiddenMask' has a wrong offset!");
static_assert(offsetof(UUw_fight_operateswitch_btn_C, Image_8) == 0x0003C8, "Member 'UUw_fight_operateswitch_btn_C::Image_8' has a wrong offset!");
static_assert(offsetof(UUw_fight_operateswitch_btn_C, KeyBtn) == 0x0003D0, "Member 'UUw_fight_operateswitch_btn_C::KeyBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_operateswitch_btn_C, KeyBtnImage) == 0x0003D8, "Member 'UUw_fight_operateswitch_btn_C::KeyBtnImage' has a wrong offset!");
static_assert(offsetof(UUw_fight_operateswitch_btn_C, PanelKey) == 0x0003E0, "Member 'UUw_fight_operateswitch_btn_C::PanelKey' has a wrong offset!");

}

