#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_skill_button_pc

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.ExecuteUbergraph_uw_fight_skill_button_pc
// 0x001C (0x001C - 0x0000)
struct uw_fight_skill_button_pc_C_ExecuteUbergraph_uw_fight_skill_button_pc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bActive;                              // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bModify;                              // 0x000E(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_2;                             // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay_2;                              // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bFull;                                // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bForbid_1;                            // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bForbid;                              // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay_1;                              // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay;                                // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_1;                             // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAnimPlayingFromAnimation_ReturnValue;   // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart;                               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_ExecuteUbergraph_uw_fight_skill_button_pc;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.K2_OnCustomUmgAnimFinished__Overridden
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_skill_button_pc_C_K2_OnCustomUmgAnimFinished__Overridden final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_K2_OnCustomUmgAnimFinished__Overridden;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.OnUIEffectSkillLongPress
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_OnUIEffectSkillLongPress final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_OnUIEffectSkillLongPress;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.OnSkillKeepInterrupt
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_OnSkillKeepInterrupt final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_OnSkillKeepInterrupt;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.K2_PlaySustainAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_K2_PlaySustainAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_K2_PlaySustainAnim;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.PlayDerivedSkillAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_PlayDerivedSkillAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_PlayDerivedSkillAnim;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.K2_SetButtonAbnormal
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_K2_SetButtonAbnormal final
{
public:
	bool                                          bForbid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_K2_SetButtonAbnormal;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.K2_SetButtonForbid
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_K2_SetButtonForbid final
{
public:
	bool                                          bForbid;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_K2_SetButtonForbid;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.K2_NormalEnergyChange
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_K2_NormalEnergyChange final
{
public:
	bool                                          bFull;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_K2_NormalEnergyChange;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.K2_PlayCDAnim__Overridden
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_K2_PlayCDAnim__Overridden final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_K2_PlayCDAnim__Overridden;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.OnSkillStrengthening__Overridden
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_OnSkillStrengthening__Overridden final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_OnSkillStrengthening__Overridden;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.OnModifyStateChange
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_OnModifyStateChange final
{
public:
	bool                                          bModify;                                           // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_OnModifyStateChange;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.OnQTEStateChange
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_OnQTEStateChange final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_OnQTEStateChange;

// LuaFunction uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.OnChargeTimesChange
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_skill_button_pc_C_OnChargeTimesChange final
{
public:
	int32                                         InCurrentTimes;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMaxTimes;                                        // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_OnChargeTimesChange;

// LuaFunction uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.OnSkillStrengthening
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_OnSkillStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_OnSkillStrengthening;

// LuaFunction uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_skill_button_pc_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_K2_OnCustomUmgAnimFinished;

// LuaFunction uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.K2_PlayCDAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_skill_button_pc_C_K2_PlayCDAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_K2_PlayCDAnim;

// Function uw_fight_skill_button_pc.uw_fight_skill_button_pc_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_skill_button_pc_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_skill_button_pc_C_GetModuleName;

}

