#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_ammunition1

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_ammunition1.uw_fight_ammunition1_C
// 0x0078 (0x03F0 - 0x0378)
class UUw_fight_ammunition1_C final : public UCrossAmmunition
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0378(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       NotEnough;                                         // 0x0380(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x0388(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PowerTime;                                         // 0x0390(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UProgressBar*                           BarStrongNum;                                      // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           BarStrongNumShadow;                                // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Bullet;                                            // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fightstrong_02_p_C*               E_ui_fightstrong_02_p_C;                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fightstrong_02_p_C*               E_ui_fightstrong_02_p_C_102;                       // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_199;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvaVary;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelStrongNum;                                    // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelStrongTime;                                   // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_uw_fight_ammunition1(int32 EntryPoint);
	int32 GetNextLeftCount(class UModifier* InModifier);
	void SetBulletEffect(bool bShow);
	void SetBulletTimeEffect(bool bShow);
	void ClearBulletEffect();
	void SetBulletCountEffect(float StartPercent, float EndPercent, float Start, float End);
	void OnBulletChange(int32 InCurBullet, int32 InMaxBullet, float InPercent);
	void K2_SkillCastBulletFail();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_ammunition1_C">();
	}
	static class UUw_fight_ammunition1_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_ammunition1_C>();
	}
};
static_assert(alignof(UUw_fight_ammunition1_C) == 0x000008, "Wrong alignment on UUw_fight_ammunition1_C");
static_assert(sizeof(UUw_fight_ammunition1_C) == 0x0003F0, "Wrong size on UUw_fight_ammunition1_C");
static_assert(offsetof(UUw_fight_ammunition1_C, UberGraphFrame) == 0x000378, "Member 'UUw_fight_ammunition1_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, NotEnough) == 0x000380, "Member 'UUw_fight_ammunition1_C::NotEnough' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, Reset) == 0x000388, "Member 'UUw_fight_ammunition1_C::Reset' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, PowerTime) == 0x000390, "Member 'UUw_fight_ammunition1_C::PowerTime' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, BarStrongNum) == 0x000398, "Member 'UUw_fight_ammunition1_C::BarStrongNum' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, BarStrongNumShadow) == 0x0003A0, "Member 'UUw_fight_ammunition1_C::BarStrongNumShadow' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, Bullet) == 0x0003A8, "Member 'UUw_fight_ammunition1_C::Bullet' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, E_ui_fightstrong_02_p_C) == 0x0003B0, "Member 'UUw_fight_ammunition1_C::E_ui_fightstrong_02_p_C' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, E_ui_fightstrong_02_p_C_102) == 0x0003B8, "Member 'UUw_fight_ammunition1_C::E_ui_fightstrong_02_p_C_102' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, Image) == 0x0003C0, "Member 'UUw_fight_ammunition1_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, Image_1) == 0x0003C8, "Member 'UUw_fight_ammunition1_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, Image_199) == 0x0003D0, "Member 'UUw_fight_ammunition1_C::Image_199' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, InvaVary) == 0x0003D8, "Member 'UUw_fight_ammunition1_C::InvaVary' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, PanelStrongNum) == 0x0003E0, "Member 'UUw_fight_ammunition1_C::PanelStrongNum' has a wrong offset!");
static_assert(offsetof(UUw_fight_ammunition1_C, PanelStrongTime) == 0x0003E8, "Member 'UUw_fight_ammunition1_C::PanelStrongTime' has a wrong offset!");

}

