#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_power_girl002a_0

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_power_girl002a.uw_fight_power_girl002a_C
// 0x0050 (0x0438 - 0x03E8)
class Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C final : public UFightBarGirl002a
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Small;                                             // 0x03F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Big;                                               // 0x03F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Img1;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img2;                                              // 0x0408(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0410(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustListView*                          ListPower1;                                        // 0x0418(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustListView*                          ListPowerTwoBra;                                   // 0x0420(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelAim;                                          // 0x0428(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       RootPanel;                                         // 0x0430(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayAnim(bool StateType);
	void ExecuteUbergraph_uw_fight_power_girl002a(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WidgetBlueprintGeneratedClass uw_fight_power_girl002a.uw_fight_power_girl002a_C", true, "uw_fight_power_girl002a_C">();
	}
	static class Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C>();
	}
};
static_assert(alignof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C) == 0x000008, "Wrong alignment on Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C");
static_assert(sizeof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C) == 0x000438, "Wrong size on Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C");
static_assert(offsetof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C, UberGraphFrame) == 0x0003E8, "Member 'Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C, Small) == 0x0003F0, "Member 'Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C::Small' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C, Big) == 0x0003F8, "Member 'Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C::Big' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C, Img1) == 0x000400, "Member 'Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C::Img1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C, Img2) == 0x000408, "Member 'Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C::Img2' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C, InvalidationBox_0) == 0x000410, "Member 'Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C, ListPower1) == 0x000418, "Member 'Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C::ListPower1' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C, ListPowerTwoBra) == 0x000420, "Member 'Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C::ListPowerTwoBra' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C, PanelAim) == 0x000428, "Member 'Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C::PanelAim' has a wrong offset!");
static_assert(offsetof(Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C, RootPanel) == 0x000430, "Member 'Uw_fight_power_girl002a_0::UUw_fight_power_girl002a_C::RootPanel' has a wrong offset!");

}

