#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_interactitem

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_interactitem.uw_fight_interactitem_C.DontRequireNormalState
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_interactitem_C_DontRequireNormalState final
{
public:
	bool                                          Ret;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_interactitem_C_DontRequireNormalState) == 0x000001, "Wrong alignment on Uw_fight_interactitem_C_DontRequireNormalState");
static_assert(sizeof(Uw_fight_interactitem_C_DontRequireNormalState) == 0x000001, "Wrong size on Uw_fight_interactitem_C_DontRequireNormalState");
static_assert(offsetof(Uw_fight_interactitem_C_DontRequireNormalState, Ret) == 0x000000, "Member 'Uw_fight_interactitem_C_DontRequireNormalState::Ret' has a wrong offset!");

// Function uw_fight_interactitem.uw_fight_interactitem_C.RemoveFromList
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_interactitem_C_RemoveFromList final
{
public:
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_interactitem_C_RemoveFromList) == 0x000001, "Wrong alignment on Uw_fight_interactitem_C_RemoveFromList");
static_assert(sizeof(Uw_fight_interactitem_C_RemoveFromList) == 0x000001, "Wrong size on Uw_fight_interactitem_C_RemoveFromList");
static_assert(offsetof(Uw_fight_interactitem_C_RemoveFromList, CallFunc_IsVisible_ReturnValue) == 0x000000, "Member 'Uw_fight_interactitem_C_RemoveFromList::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function uw_fight_interactitem.uw_fight_interactitem_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_interactitem_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_interactitem_C_PreConstruct) == 0x000001, "Wrong alignment on Uw_fight_interactitem_C_PreConstruct");
static_assert(sizeof(Uw_fight_interactitem_C_PreConstruct) == 0x000001, "Wrong size on Uw_fight_interactitem_C_PreConstruct");
static_assert(offsetof(Uw_fight_interactitem_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Uw_fight_interactitem_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function uw_fight_interactitem.uw_fight_interactitem_C.VisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_interactitem_C_VisibilityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_interactitem_C_VisibilityChanged) == 0x000001, "Wrong alignment on Uw_fight_interactitem_C_VisibilityChanged");
static_assert(sizeof(Uw_fight_interactitem_C_VisibilityChanged) == 0x000001, "Wrong size on Uw_fight_interactitem_C_VisibilityChanged");
static_assert(offsetof(Uw_fight_interactitem_C_VisibilityChanged, InVisibility) == 0x000000, "Member 'Uw_fight_interactitem_C_VisibilityChanged::InVisibility' has a wrong offset!");

// Function uw_fight_interactitem.uw_fight_interactitem_C.ExecuteUbergraph_uw_fight_interactitem
// 0x00A0 (0x00A0 - 0x0000)
struct Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              ___byte_Variable;                                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ___byte_Variable_1;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2B[0x1];                                       // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMobilePlatform_ReturnValue;             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditorMobile_ReturnValue;               // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_TextToString_ReturnValue;            // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Localization_ReturnValue;                 // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0070(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem) == 0x000008, "Wrong alignment on Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem");
static_assert(sizeof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem) == 0x0000A0, "Wrong size on Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, EntryPoint) == 0x000000, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, ___bool_Variable) == 0x000004, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::___bool_Variable' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, ___byte_Variable) == 0x000005, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::___byte_Variable' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, ___byte_Variable_1) == 0x000006, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, K2Node_Event_IsDesignTime) == 0x000028, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, K2Node_CustomEvent_InVisibility) == 0x000029, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00002A, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, K2Node_CreateDelegate_OutputDelegate_2) == 0x00002C, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00003C, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_BooleanOR_ReturnValue) == 0x00003D, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_IsMobilePlatform_ReturnValue) == 0x00003E, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_IsMobilePlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_IsEditorMobile_ReturnValue) == 0x00003F, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_IsEditorMobile_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_BooleanOR_ReturnValue_1) == 0x000040, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_Conv_TextToString_ReturnValue) == 0x000048, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_Conv_TextToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, K2Node_Select_Default) == 0x000058, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_Localization_ReturnValue) == 0x000060, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_Localization_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_Conv_StringToText_ReturnValue) == 0x000070, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_PlayAnimation_ReturnValue) == 0x000088, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_PlayAnimation_ReturnValue_1) == 0x000090, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem, CallFunc_IsVisible_ReturnValue) == 0x000098, "Member 'Uw_fight_interactitem_C_ExecuteUbergraph_uw_fight_interactitem::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

// Function uw_fight_interactitem.uw_fight_interactitem_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_interactitem_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_interactitem_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_interactitem_C_GetModuleName");
static_assert(sizeof(Uw_fight_interactitem_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_interactitem_C_GetModuleName");
static_assert(offsetof(Uw_fight_interactitem_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_interactitem_C_GetModuleName::ReturnValue' has a wrong offset!");

}

