#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_aimimg_girl010a

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_aimimg_girl010a.uw_fight_aimimg_girl010a_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_aimimg_girl010a_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_aimimg_girl010a_C_PreConstruct) == 0x000001, "Wrong alignment on Uw_fight_aimimg_girl010a_C_PreConstruct");
static_assert(sizeof(Uw_fight_aimimg_girl010a_C_PreConstruct) == 0x000001, "Wrong size on Uw_fight_aimimg_girl010a_C_PreConstruct");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'Uw_fight_aimimg_girl010a_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function uw_fight_aimimg_girl010a.uw_fight_aimimg_girl010a_C.VisibilityChange
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_aimimg_girl010a_C_VisibilityChange final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_aimimg_girl010a_C_VisibilityChange) == 0x000001, "Wrong alignment on Uw_fight_aimimg_girl010a_C_VisibilityChange");
static_assert(sizeof(Uw_fight_aimimg_girl010a_C_VisibilityChange) == 0x000001, "Wrong size on Uw_fight_aimimg_girl010a_C_VisibilityChange");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_VisibilityChange, InVisibility) == 0x000000, "Member 'Uw_fight_aimimg_girl010a_C_VisibilityChange::InVisibility' has a wrong offset!");

// Function uw_fight_aimimg_girl010a.uw_fight_aimimg_girl010a_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_aimimg_girl010a_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_aimimg_girl010a_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_aimimg_girl010a_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_aimimg_girl010a_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_aimimg_girl010a_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_aimimg_girl010a_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// Function uw_fight_aimimg_girl010a.uw_fight_aimimg_girl010a_C.ExecuteUbergraph_uw_fight_aimimg_girl010a
// 0x0024 (0x0024 - 0x0000)
struct Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a) == 0x000004, "Wrong alignment on Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a");
static_assert(sizeof(Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a) == 0x000024, "Wrong size on Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a, EntryPoint) == 0x000000, "Member 'Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a, K2Node_Event_AnimName) == 0x000004, "Member 'Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a::K2Node_Event_AnimName' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a, K2Node_Event_IsDesignTime) == 0x000020, "Member 'Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a, K2Node_CustomEvent_InVisibility) == 0x000021, "Member 'Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a::K2Node_CustomEvent_InVisibility' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a, K2Node_SwitchEnum_CmpSuccess) == 0x000022, "Member 'Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a, CallFunc_IsVisible_ReturnValue) == 0x000023, "Member 'Uw_fight_aimimg_girl010a_C_ExecuteUbergraph_uw_fight_aimimg_girl010a::CallFunc_IsVisible_ReturnValue' has a wrong offset!");

}

