#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_npc_talk

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction uw_fight_npc_talk.uw_fight_npc_talk_C.PlaySoundInLua
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_npc_talk_C_PlaySoundInLua final
{
public:
	int32                                         SoundId;                                           // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_npc_talk_C_PlaySoundInLua) == 0x000004, "Wrong alignment on Uw_fight_npc_talk_C_PlaySoundInLua");
static_assert(sizeof(Uw_fight_npc_talk_C_PlaySoundInLua) == 0x000004, "Wrong size on Uw_fight_npc_talk_C_PlaySoundInLua");
static_assert(offsetof(Uw_fight_npc_talk_C_PlaySoundInLua, SoundId) == 0x000000, "Member 'Uw_fight_npc_talk_C_PlaySoundInLua::SoundId' has a wrong offset!");

// LuaFunction uw_fight_npc_talk.uw_fight_npc_talk_C.SwitchCurrentInfoTo
// 0x0004 (0x0004 - 0x0000)
struct Uw_fight_npc_talk_C_SwitchCurrentInfoTo final
{
public:
	int32                                         InInfoIndex;                                       // 0x0000(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Uw_fight_npc_talk_C_SwitchCurrentInfoTo) == 0x000004, "Wrong alignment on Uw_fight_npc_talk_C_SwitchCurrentInfoTo");
static_assert(sizeof(Uw_fight_npc_talk_C_SwitchCurrentInfoTo) == 0x000004, "Wrong size on Uw_fight_npc_talk_C_SwitchCurrentInfoTo");
static_assert(offsetof(Uw_fight_npc_talk_C_SwitchCurrentInfoTo, InInfoIndex) == 0x000000, "Member 'Uw_fight_npc_talk_C_SwitchCurrentInfoTo::InInfoIndex' has a wrong offset!");

// Function uw_fight_npc_talk.uw_fight_npc_talk_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_npc_talk_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_npc_talk_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_fight_npc_talk_C_GetModuleName");
static_assert(sizeof(Uw_fight_npc_talk_C_GetModuleName) == 0x000010, "Wrong size on Uw_fight_npc_talk_C_GetModuleName");
static_assert(offsetof(Uw_fight_npc_talk_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_fight_npc_talk_C_GetModuleName::ReturnValue' has a wrong offset!");

}

