#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_jump_button_new

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_jump_button_new.uw_fight_jump_button_new_C
// 0x0060 (0x0528 - 0x04C8)
class UUw_fight_jump_button_new_C final : public UNewJumpButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x04C8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Reset;                                             // 0x04D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Oncd;                                              // 0x04D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel;                                       // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         CDImg;                                             // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgIcon;                                           // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage;                                       // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         NormalImg;                                         // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKey;                                          // 0x0510(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         PressImg;                                          // 0x0518(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         SkillIndex_0;                                      // 0x0520(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFireButton;                                       // 0x0524(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAimable;                                          // 0x0525(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void PreConstruct(bool IsDesignTime);
	void ExecuteUbergraph_uw_fight_jump_button_new(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_jump_button_new_C">();
	}
	static class UUw_fight_jump_button_new_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_jump_button_new_C>();
	}
};
static_assert(alignof(UUw_fight_jump_button_new_C) == 0x000008, "Wrong alignment on UUw_fight_jump_button_new_C");
static_assert(sizeof(UUw_fight_jump_button_new_C) == 0x000528, "Wrong size on UUw_fight_jump_button_new_C");
static_assert(offsetof(UUw_fight_jump_button_new_C, UberGraphFrame) == 0x0004C8, "Member 'UUw_fight_jump_button_new_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, Reset) == 0x0004D0, "Member 'UUw_fight_jump_button_new_C::Reset' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, Oncd) == 0x0004D8, "Member 'UUw_fight_jump_button_new_C::Oncd' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, CanvasPanel) == 0x0004E0, "Member 'UUw_fight_jump_button_new_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, CDImg) == 0x0004E8, "Member 'UUw_fight_jump_button_new_C::CDImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, ImgIcon) == 0x0004F0, "Member 'UUw_fight_jump_button_new_C::ImgIcon' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, KeyBtn) == 0x0004F8, "Member 'UUw_fight_jump_button_new_C::KeyBtn' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, KeyBtnImage) == 0x000500, "Member 'UUw_fight_jump_button_new_C::KeyBtnImage' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, NormalImg) == 0x000508, "Member 'UUw_fight_jump_button_new_C::NormalImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, PanelKey) == 0x000510, "Member 'UUw_fight_jump_button_new_C::PanelKey' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, PressImg) == 0x000518, "Member 'UUw_fight_jump_button_new_C::PressImg' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, SkillIndex_0) == 0x000520, "Member 'UUw_fight_jump_button_new_C::SkillIndex_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, bFireButton) == 0x000524, "Member 'UUw_fight_jump_button_new_C::bFireButton' has a wrong offset!");
static_assert(offsetof(UUw_fight_jump_button_new_C, bAimable) == 0x000525, "Member 'UUw_fight_jump_button_new_C::bAimable' has a wrong offset!");

}

