#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_cross10

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_cross10.uw_fight_cross10_C.K2_OnReloading
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_cross10_C_K2_OnReloading final
{
public:
	bool                                          bIsReload;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponType                                   Type;                                              // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bInterrupt;                                        // 0x0002(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AnimTime;                                          // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_cross10_C_K2_OnReloading) == 0x000004, "Wrong alignment on Uw_fight_cross10_C_K2_OnReloading");
static_assert(sizeof(Uw_fight_cross10_C_K2_OnReloading) == 0x000008, "Wrong size on Uw_fight_cross10_C_K2_OnReloading");
static_assert(offsetof(Uw_fight_cross10_C_K2_OnReloading, bIsReload) == 0x000000, "Member 'Uw_fight_cross10_C_K2_OnReloading::bIsReload' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross10_C_K2_OnReloading, Type) == 0x000001, "Member 'Uw_fight_cross10_C_K2_OnReloading::Type' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross10_C_K2_OnReloading, bInterrupt) == 0x000002, "Member 'Uw_fight_cross10_C_K2_OnReloading::bInterrupt' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross10_C_K2_OnReloading, AnimTime) == 0x000004, "Member 'Uw_fight_cross10_C_K2_OnReloading::AnimTime' has a wrong offset!");

// Function uw_fight_cross10.uw_fight_cross10_C.ExecuteUbergraph_uw_fight_cross10
// 0x0010 (0x0010 - 0x0000)
struct Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsReload;                            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeaponType                                   K2Node_Event_Type;                                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bInterrupt;                           // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_AnimTime;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10) == 0x000004, "Wrong alignment on Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10");
static_assert(sizeof(Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10) == 0x000010, "Wrong size on Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10");
static_assert(offsetof(Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10, EntryPoint) == 0x000000, "Member 'Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10, K2Node_Event_bIsReload) == 0x000004, "Member 'Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10::K2Node_Event_bIsReload' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10, K2Node_Event_Type) == 0x000005, "Member 'Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10::K2Node_Event_Type' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10, K2Node_Event_bInterrupt) == 0x000006, "Member 'Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10::K2Node_Event_bInterrupt' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10, K2Node_Event_AnimTime) == 0x000008, "Member 'Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10::K2Node_Event_AnimTime' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00000C, "Member 'Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00000D, "Member 'Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10, CallFunc_BooleanOR_ReturnValue) == 0x00000E, "Member 'Uw_fight_cross10_C_ExecuteUbergraph_uw_fight_cross10::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

