#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_buff

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_buff.uw_fight_level_buff_C
// 0x0030 (0x03E0 - 0x03B0)
class UUw_fight_level_buff_C final : public ULuaWidget
{
public:
	class URedirectImage*                         ImgBG;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Point1;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Point1_1;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Point2;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Point2_1;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHyperTextBlock*                        TxtBuff;                                           // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_buff_C">();
	}
	static class UUw_fight_level_buff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_buff_C>();
	}
};
static_assert(alignof(UUw_fight_level_buff_C) == 0x000008, "Wrong alignment on UUw_fight_level_buff_C");
static_assert(sizeof(UUw_fight_level_buff_C) == 0x0003E0, "Wrong size on UUw_fight_level_buff_C");
static_assert(offsetof(UUw_fight_level_buff_C, ImgBG) == 0x0003B0, "Member 'UUw_fight_level_buff_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_buff_C, Point1) == 0x0003B8, "Member 'UUw_fight_level_buff_C::Point1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_buff_C, Point1_1) == 0x0003C0, "Member 'UUw_fight_level_buff_C::Point1_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_buff_C, Point2) == 0x0003C8, "Member 'UUw_fight_level_buff_C::Point2' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_buff_C, Point2_1) == 0x0003D0, "Member 'UUw_fight_level_buff_C::Point2_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_buff_C, TxtBuff) == 0x0003D8, "Member 'UUw_fight_level_buff_C::TxtBuff' has a wrong offset!");

}

