#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_aimimg2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_aimimg2.uw_fight_aimimg2_C
// 0x00A8 (0x0328 - 0x0280)
class UUw_fight_aimimg2_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Open;                                              // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         BGLD_2;                                            // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGLD_3;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGLD_4;                                            // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGLD_5;                                            // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGLU_2;                                            // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGLU_3;                                            // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGLU_4;                                            // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGLU_5;                                            // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGRD_2;                                            // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGRD_3;                                            // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGRD_4;                                            // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGRD_5;                                            // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGRU_2;                                            // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGRU_3;                                            // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGRU_4;                                            // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BGRU_5;                                            // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHaloMaskImage*                         HaloMaskImage_105;                                 // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_111;                                         // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_aimimg_lowhp_C*               LowHp;                                             // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void VisibilityChange(ESlateVisibility InVisibility);
	void ExecuteUbergraph_uw_fight_aimimg2(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Destruct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_aimimg2_C">();
	}
	static class UUw_fight_aimimg2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_aimimg2_C>();
	}
};
static_assert(alignof(UUw_fight_aimimg2_C) == 0x000008, "Wrong alignment on UUw_fight_aimimg2_C");
static_assert(sizeof(UUw_fight_aimimg2_C) == 0x000328, "Wrong size on UUw_fight_aimimg2_C");
static_assert(offsetof(UUw_fight_aimimg2_C, UberGraphFrame) == 0x000280, "Member 'UUw_fight_aimimg2_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, Open) == 0x000288, "Member 'UUw_fight_aimimg2_C::Open' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGLD_2) == 0x000290, "Member 'UUw_fight_aimimg2_C::BGLD_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGLD_3) == 0x000298, "Member 'UUw_fight_aimimg2_C::BGLD_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGLD_4) == 0x0002A0, "Member 'UUw_fight_aimimg2_C::BGLD_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGLD_5) == 0x0002A8, "Member 'UUw_fight_aimimg2_C::BGLD_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGLU_2) == 0x0002B0, "Member 'UUw_fight_aimimg2_C::BGLU_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGLU_3) == 0x0002B8, "Member 'UUw_fight_aimimg2_C::BGLU_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGLU_4) == 0x0002C0, "Member 'UUw_fight_aimimg2_C::BGLU_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGLU_5) == 0x0002C8, "Member 'UUw_fight_aimimg2_C::BGLU_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGRD_2) == 0x0002D0, "Member 'UUw_fight_aimimg2_C::BGRD_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGRD_3) == 0x0002D8, "Member 'UUw_fight_aimimg2_C::BGRD_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGRD_4) == 0x0002E0, "Member 'UUw_fight_aimimg2_C::BGRD_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGRD_5) == 0x0002E8, "Member 'UUw_fight_aimimg2_C::BGRD_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGRU_2) == 0x0002F0, "Member 'UUw_fight_aimimg2_C::BGRU_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGRU_3) == 0x0002F8, "Member 'UUw_fight_aimimg2_C::BGRU_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGRU_4) == 0x000300, "Member 'UUw_fight_aimimg2_C::BGRU_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, BGRU_5) == 0x000308, "Member 'UUw_fight_aimimg2_C::BGRU_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, HaloMaskImage_105) == 0x000310, "Member 'UUw_fight_aimimg2_C::HaloMaskImage_105' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, Image_111) == 0x000318, "Member 'UUw_fight_aimimg2_C::Image_111' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg2_C, LowHp) == 0x000320, "Member 'UUw_fight_aimimg2_C::LowHp' has a wrong offset!");

}

