#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_monster_armor_hp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_monster_armor_hp.uw_fight_monster_armor_hp_C
// 0x0060 (0x0588 - 0x0528)
class UUw_fight_monster_armor_hp_C final : public UArmorHp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0528(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Monsterhp_white;                                   // 0x0530(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                Effect;                                            // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           HP;                                                // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         HPBG;                                              // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         HPBGBlack;                                         // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Shield_1;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateInvincible;                                   // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateReduceTreat;                                  // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateReplyAdd;                                     // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtNum;                                            // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PlayWhiteAnim();
	void ExecuteUbergraph_uw_fight_monster_armor_hp(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_monster_armor_hp_C">();
	}
	static class UUw_fight_monster_armor_hp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_monster_armor_hp_C>();
	}
};
static_assert(alignof(UUw_fight_monster_armor_hp_C) == 0x000008, "Wrong alignment on UUw_fight_monster_armor_hp_C");
static_assert(sizeof(UUw_fight_monster_armor_hp_C) == 0x000588, "Wrong size on UUw_fight_monster_armor_hp_C");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, UberGraphFrame) == 0x000528, "Member 'UUw_fight_monster_armor_hp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, Monsterhp_white) == 0x000530, "Member 'UUw_fight_monster_armor_hp_C::Monsterhp_white' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, Effect) == 0x000538, "Member 'UUw_fight_monster_armor_hp_C::Effect' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, HP) == 0x000540, "Member 'UUw_fight_monster_armor_hp_C::HP' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, HPBG) == 0x000548, "Member 'UUw_fight_monster_armor_hp_C::HPBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, HPBGBlack) == 0x000550, "Member 'UUw_fight_monster_armor_hp_C::HPBGBlack' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, InvalidationBox_0) == 0x000558, "Member 'UUw_fight_monster_armor_hp_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, Shield_1) == 0x000560, "Member 'UUw_fight_monster_armor_hp_C::Shield_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, StateInvincible) == 0x000568, "Member 'UUw_fight_monster_armor_hp_C::StateInvincible' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, StateReduceTreat) == 0x000570, "Member 'UUw_fight_monster_armor_hp_C::StateReduceTreat' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, StateReplyAdd) == 0x000578, "Member 'UUw_fight_monster_armor_hp_C::StateReplyAdd' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_armor_hp_C, TxtNum) == 0x000580, "Member 'UUw_fight_monster_armor_hp_C::TxtNum' has a wrong offset!");

}

