#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_direction_maptarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_direction_maptarget.uw_fight_direction_maptarget_C
// 0x0050 (0x0850 - 0x0800)
class Uuw_fight_direction_maptarget_C final : public UFightMonsterTipsItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0810(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_19;                                          // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_22;                                          // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_24;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_32;                                          // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgArrow12;                                        // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDown;                                           // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgHeight;                                         // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_uw_fight_direction_maptarget(int32 EntryPoint);
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void PlayTypeAnim();
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void AppearFinish(class UWidgetAnimation* Animation);
	void PlayDieAnim();
	void OnVisibilityChanged_Event_0(ESlateVisibility InVisibility);
	void SetDefendTargetPercent(float Value);
	void StartLoop(const class FName Name_0, bool HasAppear);
	void SequenceEvent__ENTRYPOINTuw_fight_direction_maptarget_0();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("uw_fight_direction_maptarget_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"uw_fight_direction_maptarget_C")
	}
	static class Uuw_fight_direction_maptarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Uuw_fight_direction_maptarget_C>();
	}
};
DUMPER7_ASSERTS_Uuw_fight_direction_maptarget_C;

}

