#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_player_item_skill03_pc

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_player_item_skill03_pc.uw_fight_player_item_skill03_pc_C.K2_PlayEnoughAnim
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_player_item_skill03_pc_C_K2_PlayEnoughAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_player_item_skill03_pc_C_K2_PlayEnoughAnim;

// Function uw_fight_player_item_skill03_pc.uw_fight_player_item_skill03_pc_C.OnSkillStrengthening
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_player_item_skill03_pc_C_OnSkillStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_player_item_skill03_pc_C_OnSkillStrengthening;

// Function uw_fight_player_item_skill03_pc.uw_fight_player_item_skill03_pc_C.OnSkillKeepInterrupt
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_player_item_skill03_pc_C_OnSkillKeepInterrupt final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_player_item_skill03_pc_C_OnSkillKeepInterrupt;

// Function uw_fight_player_item_skill03_pc.uw_fight_player_item_skill03_pc_C.OnUIEffectSkillLongPress
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_player_item_skill03_pc_C_OnUIEffectSkillLongPress final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_player_item_skill03_pc_C_OnUIEffectSkillLongPress;

// Function uw_fight_player_item_skill03_pc.uw_fight_player_item_skill03_pc_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_player_item_skill03_pc_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_player_item_skill03_pc_C_K2_OnCustomUmgAnimFinished;

// Function uw_fight_player_item_skill03_pc.uw_fight_player_item_skill03_pc_C.ExecuteUbergraph_uw_fight_player_item_skill03_pc
// 0x0014 (0x0014 - 0x0000)
struct uw_fight_player_item_skill03_pc_C_ExecuteUbergraph_uw_fight_player_item_skill03_pc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_2;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_1;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_player_item_skill03_pc_C_ExecuteUbergraph_uw_fight_player_item_skill03_pc;

}

