#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_rogue3d_switch

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_rogue3d_switch.uw_fight_rogue3d_switch_C
// 0x0138 (0x03B8 - 0x0280)
class UUw_fight_rogue3d_switch_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Anim_Out;                                          // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Anim_In;                                           // 0x0290(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class USplineWidget*                          One;                                               // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          One0;                                              // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          One1;                                              // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          Two;                                               // 0x02B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          Three;                                             // 0x02B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          Three_1;                                           // 0x02C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          Four;                                              // 0x02C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          Five;                                              // 0x02D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          Six;                                               // 0x02D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          Seven;                                             // 0x02E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          Eight;                                             // 0x02E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USplineWidget*                          Nine;                                              // 0x02F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameMeshWidget*                        GameMeshWidget;                                    // 0x02F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameMeshWidget*                        GameMeshWidget_17;                                 // 0x0300(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Glow;                                              // 0x0308(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0310(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               Lizi;                                              // 0x0318(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameNiagaraSystemWidget*               Lizi_1;                                            // 0x0320(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         White;                                             // 0x0328(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         EffectId;                                          // 0x0330(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_334[0x4];                                      // 0x0334(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftClassPtr<class UClass>                   PostParam;                                         // 0x0338(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   PostParam2;                                        // 0x0360(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   PostParam1;                                        // 0x0388(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         EffectId2;                                         // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTuw_fight_rogue3d_switch_3();
	void SequenceEvent__ENTRYPOINTuw_fight_rogue3d_switch_2();
	void SequenceEvent__ENTRYPOINTuw_fight_rogue3d_switch_1();
	void SequenceEvent__ENTRYPOINTuw_fight_rogue3d_switch_0();
	void EndPlayEffect();
	void SequenceEvent_0();
	void SequenceEvent_1();
	void SequenceEvent_2();
	void SequenceEvent_3();
	void OnInitialized();
	void Destruct();
	void ExecuteUbergraph_uw_fight_rogue3d_switch(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_rogue3d_switch_C">();
	}
	static class UUw_fight_rogue3d_switch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_rogue3d_switch_C>();
	}
};
static_assert(alignof(UUw_fight_rogue3d_switch_C) == 0x000008, "Wrong alignment on UUw_fight_rogue3d_switch_C");
static_assert(sizeof(UUw_fight_rogue3d_switch_C) == 0x0003B8, "Wrong size on UUw_fight_rogue3d_switch_C");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, UberGraphFrame) == 0x000280, "Member 'UUw_fight_rogue3d_switch_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Anim_Out) == 0x000288, "Member 'UUw_fight_rogue3d_switch_C::Anim_Out' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Anim_In) == 0x000290, "Member 'UUw_fight_rogue3d_switch_C::Anim_In' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, One) == 0x000298, "Member 'UUw_fight_rogue3d_switch_C::One' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, One0) == 0x0002A0, "Member 'UUw_fight_rogue3d_switch_C::One0' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, One1) == 0x0002A8, "Member 'UUw_fight_rogue3d_switch_C::One1' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Two) == 0x0002B0, "Member 'UUw_fight_rogue3d_switch_C::Two' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Three) == 0x0002B8, "Member 'UUw_fight_rogue3d_switch_C::Three' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Three_1) == 0x0002C0, "Member 'UUw_fight_rogue3d_switch_C::Three_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Four) == 0x0002C8, "Member 'UUw_fight_rogue3d_switch_C::Four' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Five) == 0x0002D0, "Member 'UUw_fight_rogue3d_switch_C::Five' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Six) == 0x0002D8, "Member 'UUw_fight_rogue3d_switch_C::Six' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Seven) == 0x0002E0, "Member 'UUw_fight_rogue3d_switch_C::Seven' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Eight) == 0x0002E8, "Member 'UUw_fight_rogue3d_switch_C::Eight' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Nine) == 0x0002F0, "Member 'UUw_fight_rogue3d_switch_C::Nine' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, GameMeshWidget) == 0x0002F8, "Member 'UUw_fight_rogue3d_switch_C::GameMeshWidget' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, GameMeshWidget_17) == 0x000300, "Member 'UUw_fight_rogue3d_switch_C::GameMeshWidget_17' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Glow) == 0x000308, "Member 'UUw_fight_rogue3d_switch_C::Glow' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Image) == 0x000310, "Member 'UUw_fight_rogue3d_switch_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Lizi) == 0x000318, "Member 'UUw_fight_rogue3d_switch_C::Lizi' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, Lizi_1) == 0x000320, "Member 'UUw_fight_rogue3d_switch_C::Lizi_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, White) == 0x000328, "Member 'UUw_fight_rogue3d_switch_C::White' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, EffectId) == 0x000330, "Member 'UUw_fight_rogue3d_switch_C::EffectId' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, PostParam) == 0x000338, "Member 'UUw_fight_rogue3d_switch_C::PostParam' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, PostParam2) == 0x000360, "Member 'UUw_fight_rogue3d_switch_C::PostParam2' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, PostParam1) == 0x000388, "Member 'UUw_fight_rogue3d_switch_C::PostParam1' has a wrong offset!");
static_assert(offsetof(UUw_fight_rogue3d_switch_C, EffectId2) == 0x0003B0, "Member 'UUw_fight_rogue3d_switch_C::EffectId2' has a wrong offset!");

}

