#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_direction_maptarget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_direction_maptarget.uw_fight_direction_maptarget_C
// 0x0050 (0x0850 - 0x0800)
class UUw_fight_direction_maptarget_C final : public UFightMonsterTipsItem
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0800(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Loop;                                              // 0x0808(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x0810(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_19;                                          // 0x0818(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_22;                                          // 0x0820(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_24;                                          // 0x0828(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_32;                                          // 0x0830(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgArrow12;                                        // 0x0838(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDown;                                           // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgHeight;                                         // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTuw_fight_direction_maptarget_0();
	void StartLoop(const class FName Name_0, bool HasAppear);
	void SetDefendTargetPercent(float Value);
	void OnVisibilityChanged_Event_0(ESlateVisibility InVisibility);
	void PlayDieAnim();
	void AppearFinish(class UWidgetAnimation* Animation);
	void OnAnimationFinished(const class UWidgetAnimation* Animation);
	void PlayTypeAnim();
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_uw_fight_direction_maptarget(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_direction_maptarget_C">();
	}
	static class UUw_fight_direction_maptarget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_direction_maptarget_C>();
	}
};
static_assert(alignof(UUw_fight_direction_maptarget_C) == 0x000008, "Wrong alignment on UUw_fight_direction_maptarget_C");
static_assert(sizeof(UUw_fight_direction_maptarget_C) == 0x000850, "Wrong size on UUw_fight_direction_maptarget_C");
static_assert(offsetof(UUw_fight_direction_maptarget_C, UberGraphFrame) == 0x000800, "Member 'UUw_fight_direction_maptarget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_maptarget_C, Loop) == 0x000808, "Member 'UUw_fight_direction_maptarget_C::Loop' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_maptarget_C, Appear) == 0x000810, "Member 'UUw_fight_direction_maptarget_C::Appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_maptarget_C, Image_19) == 0x000818, "Member 'UUw_fight_direction_maptarget_C::Image_19' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_maptarget_C, Image_22) == 0x000820, "Member 'UUw_fight_direction_maptarget_C::Image_22' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_maptarget_C, Image_24) == 0x000828, "Member 'UUw_fight_direction_maptarget_C::Image_24' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_maptarget_C, Image_32) == 0x000830, "Member 'UUw_fight_direction_maptarget_C::Image_32' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_maptarget_C, ImgArrow12) == 0x000838, "Member 'UUw_fight_direction_maptarget_C::ImgArrow12' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_maptarget_C, ImgDown) == 0x000840, "Member 'UUw_fight_direction_maptarget_C::ImgDown' has a wrong offset!");
static_assert(offsetof(UUw_fight_direction_maptarget_C, ImgHeight) == 0x000848, "Member 'UUw_fight_direction_maptarget_C::ImgHeight' has a wrong offset!");

}

