#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_crossstrong

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_crossstrong.uw_fight_crossstrong_C
// 0x00B0 (0x0400 - 0x0350)
class UUw_fight_crossstrong_C final : public UCrossHairStrong
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0350(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Cross;                                             // 0x0358(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UE_ui_fightstrong_04_p_C*               E_ui_fightstrong_04_p_C_96;                        // 0x0360(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fightstrong_05_p_C*               E_ui_fightstrong_05_p_C;                           // 0x0368(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UE_ui_fightstrong_06_p_C*               E_ui_fightstrong_06_p_C_181;                       // 0x0370(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0378(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x0380(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_2;                                           // 0x0388(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x0390(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_4;                                           // 0x0398(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_5;                                           // 0x03A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_6;                                           // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_7;                                           // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_8;                                           // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_9;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_10;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_11;                                          // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_55;                                          // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvaVary;                                          // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelCross;                                        // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelPoint;                                        // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          bPlayCross;                                        // 0x03F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void OnFireStrengthening(bool bStart, bool bSmall);
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_uw_fight_crossstrong(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_crossstrong_C">();
	}
	static class UUw_fight_crossstrong_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_crossstrong_C>();
	}
};
static_assert(alignof(UUw_fight_crossstrong_C) == 0x000008, "Wrong alignment on UUw_fight_crossstrong_C");
static_assert(sizeof(UUw_fight_crossstrong_C) == 0x000400, "Wrong size on UUw_fight_crossstrong_C");
static_assert(offsetof(UUw_fight_crossstrong_C, UberGraphFrame) == 0x000350, "Member 'UUw_fight_crossstrong_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Cross) == 0x000358, "Member 'UUw_fight_crossstrong_C::Cross' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, E_ui_fightstrong_04_p_C_96) == 0x000360, "Member 'UUw_fight_crossstrong_C::E_ui_fightstrong_04_p_C_96' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, E_ui_fightstrong_05_p_C) == 0x000368, "Member 'UUw_fight_crossstrong_C::E_ui_fightstrong_05_p_C' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, E_ui_fightstrong_06_p_C_181) == 0x000370, "Member 'UUw_fight_crossstrong_C::E_ui_fightstrong_06_p_C_181' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image) == 0x000378, "Member 'UUw_fight_crossstrong_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_1) == 0x000380, "Member 'UUw_fight_crossstrong_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_2) == 0x000388, "Member 'UUw_fight_crossstrong_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_3) == 0x000390, "Member 'UUw_fight_crossstrong_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_4) == 0x000398, "Member 'UUw_fight_crossstrong_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_5) == 0x0003A0, "Member 'UUw_fight_crossstrong_C::Image_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_6) == 0x0003A8, "Member 'UUw_fight_crossstrong_C::Image_6' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_7) == 0x0003B0, "Member 'UUw_fight_crossstrong_C::Image_7' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_8) == 0x0003B8, "Member 'UUw_fight_crossstrong_C::Image_8' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_9) == 0x0003C0, "Member 'UUw_fight_crossstrong_C::Image_9' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_10) == 0x0003C8, "Member 'UUw_fight_crossstrong_C::Image_10' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_11) == 0x0003D0, "Member 'UUw_fight_crossstrong_C::Image_11' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, Image_55) == 0x0003D8, "Member 'UUw_fight_crossstrong_C::Image_55' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, InvaVary) == 0x0003E0, "Member 'UUw_fight_crossstrong_C::InvaVary' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, PanelCross) == 0x0003E8, "Member 'UUw_fight_crossstrong_C::PanelCross' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, PanelPoint) == 0x0003F0, "Member 'UUw_fight_crossstrong_C::PanelPoint' has a wrong offset!");
static_assert(offsetof(UUw_fight_crossstrong_C, bPlayCross) == 0x0003F8, "Member 'UUw_fight_crossstrong_C::bPlayCross' has a wrong offset!");

}

