#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_fire_button_aim_new

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_fire_button_aim_new.uw_fight_fire_button_aim_new_C.Clear Player Action
// 0x0038 (0x0038 - 0x0000)
struct Uw_fight_fire_button_aim_new_C_Clear_Player_Action final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGamePlayerController*                  K2Node_DynamicCast_AsGame_Player_Controller;       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetCurrentChar_ReturnValue;               // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterStateMachineComponent*        K2Node_DynamicCast_AsCharacter_State_Machine_Component; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_fire_button_aim_new_C_Clear_Player_Action) == 0x000008, "Wrong alignment on Uw_fight_fire_button_aim_new_C_Clear_Player_Action");
static_assert(sizeof(Uw_fight_fire_button_aim_new_C_Clear_Player_Action) == 0x000038, "Wrong size on Uw_fight_fire_button_aim_new_C_Clear_Player_Action");
static_assert(offsetof(Uw_fight_fire_button_aim_new_C_Clear_Player_Action, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'Uw_fight_fire_button_aim_new_C_Clear_Player_Action::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_fire_button_aim_new_C_Clear_Player_Action, K2Node_DynamicCast_AsGame_Player_Controller) == 0x000008, "Member 'Uw_fight_fire_button_aim_new_C_Clear_Player_Action::K2Node_DynamicCast_AsGame_Player_Controller' has a wrong offset!");
static_assert(offsetof(Uw_fight_fire_button_aim_new_C_Clear_Player_Action, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'Uw_fight_fire_button_aim_new_C_Clear_Player_Action::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Uw_fight_fire_button_aim_new_C_Clear_Player_Action, CallFunc_GetCurrentChar_ReturnValue) == 0x000018, "Member 'Uw_fight_fire_button_aim_new_C_Clear_Player_Action::CallFunc_GetCurrentChar_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_fire_button_aim_new_C_Clear_Player_Action, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'Uw_fight_fire_button_aim_new_C_Clear_Player_Action::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_fire_button_aim_new_C_Clear_Player_Action, K2Node_DynamicCast_AsCharacter_State_Machine_Component) == 0x000028, "Member 'Uw_fight_fire_button_aim_new_C_Clear_Player_Action::K2Node_DynamicCast_AsCharacter_State_Machine_Component' has a wrong offset!");
static_assert(offsetof(Uw_fight_fire_button_aim_new_C_Clear_Player_Action, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'Uw_fight_fire_button_aim_new_C_Clear_Player_Action::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

