#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_operatebird_btn

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_operatebird_btn.uw_fight_operatebird_btn_C.SetHighLight
// 0x0058 (0x0058 - 0x0000)
struct Uw_fight_operatebird_btn_C_SetHighLight final
{
public:
	bool                                          IsHighLight;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 String;                                            // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_operatebird_btn_C_SetHighLight) == 0x000008, "Wrong alignment on Uw_fight_operatebird_btn_C_SetHighLight");
static_assert(sizeof(Uw_fight_operatebird_btn_C_SetHighLight) == 0x000058, "Wrong size on Uw_fight_operatebird_btn_C_SetHighLight");
static_assert(offsetof(Uw_fight_operatebird_btn_C_SetHighLight, IsHighLight) == 0x000000, "Member 'Uw_fight_operatebird_btn_C_SetHighLight::IsHighLight' has a wrong offset!");
static_assert(offsetof(Uw_fight_operatebird_btn_C_SetHighLight, String) == 0x000008, "Member 'Uw_fight_operatebird_btn_C_SetHighLight::String' has a wrong offset!");
static_assert(offsetof(Uw_fight_operatebird_btn_C_SetHighLight, CallFunc_Concat_StrStr_ReturnValue) == 0x000018, "Member 'Uw_fight_operatebird_btn_C_SetHighLight::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_operatebird_btn_C_SetHighLight, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000028, "Member 'Uw_fight_operatebird_btn_C_SetHighLight::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_operatebird_btn_C_SetHighLight, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000038, "Member 'Uw_fight_operatebird_btn_C_SetHighLight::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_operatebird_btn_C_SetHighLight, CallFunc_Concat_StrStr_ReturnValue_3) == 0x000048, "Member 'Uw_fight_operatebird_btn_C_SetHighLight::CallFunc_Concat_StrStr_ReturnValue_3' has a wrong offset!");

}

