#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_aimimg_girl010a

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_aimimg_girl010a.uw_fight_aimimg_girl010a_C
// 0x00A0 (0x0510 - 0x0470)
class UUw_fight_aimimg_girl010a_C final : public UCrossHair_FightCrossRoleAim010a
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0470(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Reset;                                             // 0x0478(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Always;                                            // 0x0480(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Shoot;                                             // 0x0488(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Charge;                                            // 0x0490(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Aimimg;                                            // 0x0498(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UHaloMaskImage*                         HaloMaskImage_105;                                 // 0x04A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img301;                                            // 0x04A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img302;                                            // 0x04B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img303;                                            // 0x04B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img304;                                            // 0x04C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img305;                                            // 0x04C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img306;                                            // 0x04D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img307;                                            // 0x04D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img308;                                            // 0x04E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img309;                                            // 0x04E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img310;                                            // 0x04F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img311;                                            // 0x04F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img312;                                            // 0x0500(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_aimimg_lowhp_C*               LowHp;                                             // 0x0508(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void VisibilityChange(ESlateVisibility InVisibility);
	void Destruct();
	void B2_OnClientShoot();
	void B2_OnClientPreheat();
	void K2_OnCustomUmgAnimFinished(const class FName& AnimName);
	void ExecuteUbergraph_uw_fight_aimimg_girl010a(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_aimimg_girl010a_C">();
	}
	static class UUw_fight_aimimg_girl010a_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_aimimg_girl010a_C>();
	}
};
static_assert(alignof(UUw_fight_aimimg_girl010a_C) == 0x000010, "Wrong alignment on UUw_fight_aimimg_girl010a_C");
static_assert(sizeof(UUw_fight_aimimg_girl010a_C) == 0x000510, "Wrong size on UUw_fight_aimimg_girl010a_C");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, UberGraphFrame) == 0x000470, "Member 'UUw_fight_aimimg_girl010a_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Reset) == 0x000478, "Member 'UUw_fight_aimimg_girl010a_C::Reset' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Always) == 0x000480, "Member 'UUw_fight_aimimg_girl010a_C::Always' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Shoot) == 0x000488, "Member 'UUw_fight_aimimg_girl010a_C::Shoot' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Charge) == 0x000490, "Member 'UUw_fight_aimimg_girl010a_C::Charge' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Aimimg) == 0x000498, "Member 'UUw_fight_aimimg_girl010a_C::Aimimg' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, HaloMaskImage_105) == 0x0004A0, "Member 'UUw_fight_aimimg_girl010a_C::HaloMaskImage_105' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img301) == 0x0004A8, "Member 'UUw_fight_aimimg_girl010a_C::Img301' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img302) == 0x0004B0, "Member 'UUw_fight_aimimg_girl010a_C::Img302' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img303) == 0x0004B8, "Member 'UUw_fight_aimimg_girl010a_C::Img303' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img304) == 0x0004C0, "Member 'UUw_fight_aimimg_girl010a_C::Img304' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img305) == 0x0004C8, "Member 'UUw_fight_aimimg_girl010a_C::Img305' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img306) == 0x0004D0, "Member 'UUw_fight_aimimg_girl010a_C::Img306' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img307) == 0x0004D8, "Member 'UUw_fight_aimimg_girl010a_C::Img307' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img308) == 0x0004E0, "Member 'UUw_fight_aimimg_girl010a_C::Img308' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img309) == 0x0004E8, "Member 'UUw_fight_aimimg_girl010a_C::Img309' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img310) == 0x0004F0, "Member 'UUw_fight_aimimg_girl010a_C::Img310' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img311) == 0x0004F8, "Member 'UUw_fight_aimimg_girl010a_C::Img311' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, Img312) == 0x000500, "Member 'UUw_fight_aimimg_girl010a_C::Img312' has a wrong offset!");
static_assert(offsetof(UUw_fight_aimimg_girl010a_C, LowHp) == 0x000508, "Member 'UUw_fight_aimimg_girl010a_C::LowHp' has a wrong offset!");

}

