#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_scene_switch

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_scene_switch.uw_fight_scene_switch_C
// 0x0020 (0x02A0 - 0x0280)
class UUw_fight_scene_switch_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Loop;                                              // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_29;                                          // 0x0288(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtCustom;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtDes;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_scene_switch_C">();
	}
	static class UUw_fight_scene_switch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_scene_switch_C>();
	}
};
static_assert(alignof(UUw_fight_scene_switch_C) == 0x000008, "Wrong alignment on UUw_fight_scene_switch_C");
static_assert(sizeof(UUw_fight_scene_switch_C) == 0x0002A0, "Wrong size on UUw_fight_scene_switch_C");
static_assert(offsetof(UUw_fight_scene_switch_C, Loop) == 0x000280, "Member 'UUw_fight_scene_switch_C::Loop' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_switch_C, Image_29) == 0x000288, "Member 'UUw_fight_scene_switch_C::Image_29' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_switch_C, TxtCustom) == 0x000290, "Member 'UUw_fight_scene_switch_C::TxtCustom' has a wrong offset!");
static_assert(offsetof(UUw_fight_scene_switch_C, TxtDes) == 0x000298, "Member 'UUw_fight_scene_switch_C::TxtDes' has a wrong offset!");

}

