#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_level_task_btn_pc

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_level_task_btn_pc.uw_fight_level_task_btn_pc_C
// 0x0028 (0x03D8 - 0x03B0)
class UUw_fight_level_task_btn_pc_C final : public ULuaWidget
{
public:
	class URedirectImage*                         BtnBG;                                             // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BtnBG1;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         BtnBG1_1;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnCollapse;                                       // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomButton*                          BtnUnfold;                                         // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_level_task_btn_pc_C">();
	}
	static class UUw_fight_level_task_btn_pc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_level_task_btn_pc_C>();
	}
};
static_assert(alignof(UUw_fight_level_task_btn_pc_C) == 0x000008, "Wrong alignment on UUw_fight_level_task_btn_pc_C");
static_assert(sizeof(UUw_fight_level_task_btn_pc_C) == 0x0003D8, "Wrong size on UUw_fight_level_task_btn_pc_C");
static_assert(offsetof(UUw_fight_level_task_btn_pc_C, BtnBG) == 0x0003B0, "Member 'UUw_fight_level_task_btn_pc_C::BtnBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_btn_pc_C, BtnBG1) == 0x0003B8, "Member 'UUw_fight_level_task_btn_pc_C::BtnBG1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_btn_pc_C, BtnBG1_1) == 0x0003C0, "Member 'UUw_fight_level_task_btn_pc_C::BtnBG1_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_btn_pc_C, BtnCollapse) == 0x0003C8, "Member 'UUw_fight_level_task_btn_pc_C::BtnCollapse' has a wrong offset!");
static_assert(offsetof(UUw_fight_level_task_btn_pc_C, BtnUnfold) == 0x0003D0, "Member 'UUw_fight_level_task_btn_pc_C::BtnUnfold' has a wrong offset!");

}

