#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_monster_hp_ordinary

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_monster_hp_ordinary.uw_fight_monster_hp_ordinary_C.ExecuteUbergraph_uw_fight_monster_hp_ordinary
// 0x0008 (0x0008 - 0x0000)
struct uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFightMonsterTipsType                         K2Node_Event_InTipsType;                           // 0x0004(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_monster_hp_ordinary_C_ExecuteUbergraph_uw_fight_monster_hp_ordinary;

// Function uw_fight_monster_hp_ordinary.uw_fight_monster_hp_ordinary_C.UpdateImage
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_monster_hp_ordinary_C_UpdateImage final
{
public:
	EFightMonsterTipsType                         InTipsType;                                        // 0x0000(0x0001)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_monster_hp_ordinary_C_UpdateImage;

// LuaFunction uw_fight_monster_hp_ordinary.uw_fight_monster_hp_ordinary_C.K2_OnAppliedModifierChange
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange final
{
public:
	int32                                         ModifierID;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsApply;                                           // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         InLauncherCharacterHashIndex;                      // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_uw_fight_monster_hp_ordinary_C_K2_OnAppliedModifierChange;

// Function uw_fight_monster_hp_ordinary.uw_fight_monster_hp_ordinary_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_fight_monster_hp_ordinary_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_monster_hp_ordinary_C_GetModuleName;

}

