#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_fight_player_power_pc

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function uw_fight_player_power_pc.uw_fight_player_power_pc_C.VisibilityChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_player_power_pc_C_VisibilityChanged final
{
public:
	ESlateVisibility                              InVisibility;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_player_power_pc_C_VisibilityChanged;

// Function uw_fight_player_power_pc.uw_fight_player_power_pc_C.ExecuteUbergraph_uw_fight_player_power_pc
// 0x0018 (0x0018 - 0x0000)
struct uw_fight_player_power_pc_C_ExecuteUbergraph_uw_fight_player_power_pc final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ESlateVisibility InVisibility)> K2Node_CreateDelegate_OutputDelegate;             // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_CustomEvent_InVisibility;                   // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_fight_player_power_pc_C_ExecuteUbergraph_uw_fight_player_power_pc;

// Function uw_fight_player_power_pc.uw_fight_player_power_pc_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct uw_fight_player_power_pc_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_fight_player_power_pc_C_PreConstruct;

}

