#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_monster_hp

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_fight_monster_hp.uw_fight_monster_hp_C
// 0x01C0 (0x0750 - 0x0590)
class UUw_fight_monster_hp_C final : public UMonsterHp
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0590(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       HateActivation;                                    // 0x0598(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Reset;                                             // 0x05A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Silent;                                            // 0x05A8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Appear;                                            // 0x05B0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Interrupt;                                         // 0x05B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Monsterhp_appear;                                  // 0x05C0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Monsterhp_disappear;                               // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Monsterhp_white;                                   // 0x05D0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         boss;                                              // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanel_Monster_Buff_C*                  Buff_1;                                            // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanel_Monster_Buff_C*                  Buff_2;                                            // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanel_Monster_Buff_C*                  Buff_3;                                            // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanel_Monster_Buff_C*                  Buff_4;                                            // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPanel_Monster_Buff_C*                  Buff_5;                                            // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Buffs;                                             // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_114;                                   // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_361;                                   // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomText*                            CustomText_361;                                    // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                           Damage;                                            // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                                Effect;                                            // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Elite;                                             // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         HPBG;                                              // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image;                                             // 0x0648(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_1;                                           // 0x0650(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_2;                                           // 0x0658(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_3;                                           // 0x0660(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_4;                                           // 0x0668(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_5;                                           // 0x0670(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_6;                                           // 0x0678(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_35;                                          // 0x0680(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image_89;                                          // 0x0688(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img_Line;                                          // 0x0690(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Img_Line_1;                                        // 0x0698(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBeheaded;                                       // 0x06A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgStackHp;                                        // 0x06A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgStackShield;                                    // 0x06B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgTarget;                                         // 0x06B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgTarget_1;                                       // 0x06C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInvalidationBox*                       InvalidationBox_0;                                 // 0x06C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Mask_2;                                            // 0x06D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Monster;                                           // 0x06D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelBounce;                                       // 0x06E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         PanelCrossbow;                                     // 0x06E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelThreat;                                       // 0x06F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Progress;                                          // 0x06F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           ProgressRed;                                       // 0x0700(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         RED1;                                              // 0x0708(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           Shield;                                            // 0x0710(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateInvincible;                                   // 0x0718(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateReduceTreat;                                  // 0x0720(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateReplyAdd;                                     // 0x0728(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateShootDamageAdd;                               // 0x0730(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         StateSkillDamageAdd;                               // 0x0738(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       TargetMonster;                                     // 0x0740(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector2D                              SkillPos;                                          // 0x0748(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlayVisibiltyAnim();
	void PlayDisappearAnim();
	void Construct();
	void PlayWhiteAnim();
	void DissappearFinish();
	void UpdateImage(const EFightMonsterTipsType InTipsType);
	void OnSetLocationAndVisibleOfHPBar(bool bVisible);
	void ExecuteUbergraph_uw_fight_monster_hp(int32 EntryPoint);
	void K2_OnReset();
	void K2_OnAppliedModifierChange(int32 ModifierID, bool IsApply, int64 InLauncherCharacterHashIndex);
	void K2_OnFree();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_fight_monster_hp_C">();
	}
	static class UUw_fight_monster_hp_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_fight_monster_hp_C>();
	}
};
static_assert(alignof(UUw_fight_monster_hp_C) == 0x000008, "Wrong alignment on UUw_fight_monster_hp_C");
static_assert(sizeof(UUw_fight_monster_hp_C) == 0x000750, "Wrong size on UUw_fight_monster_hp_C");
static_assert(offsetof(UUw_fight_monster_hp_C, UberGraphFrame) == 0x000590, "Member 'UUw_fight_monster_hp_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, HateActivation) == 0x000598, "Member 'UUw_fight_monster_hp_C::HateActivation' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Reset) == 0x0005A0, "Member 'UUw_fight_monster_hp_C::Reset' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Silent) == 0x0005A8, "Member 'UUw_fight_monster_hp_C::Silent' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Appear) == 0x0005B0, "Member 'UUw_fight_monster_hp_C::Appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Interrupt) == 0x0005B8, "Member 'UUw_fight_monster_hp_C::Interrupt' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Monsterhp_appear) == 0x0005C0, "Member 'UUw_fight_monster_hp_C::Monsterhp_appear' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Monsterhp_disappear) == 0x0005C8, "Member 'UUw_fight_monster_hp_C::Monsterhp_disappear' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Monsterhp_white) == 0x0005D0, "Member 'UUw_fight_monster_hp_C::Monsterhp_white' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, boss) == 0x0005D8, "Member 'UUw_fight_monster_hp_C::boss' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Buff_1) == 0x0005E0, "Member 'UUw_fight_monster_hp_C::Buff_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Buff_2) == 0x0005E8, "Member 'UUw_fight_monster_hp_C::Buff_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Buff_3) == 0x0005F0, "Member 'UUw_fight_monster_hp_C::Buff_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Buff_4) == 0x0005F8, "Member 'UUw_fight_monster_hp_C::Buff_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Buff_5) == 0x000600, "Member 'UUw_fight_monster_hp_C::Buff_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Buffs) == 0x000608, "Member 'UUw_fight_monster_hp_C::Buffs' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, CanvasPanel_114) == 0x000610, "Member 'UUw_fight_monster_hp_C::CanvasPanel_114' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, CanvasPanel_361) == 0x000618, "Member 'UUw_fight_monster_hp_C::CanvasPanel_361' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, CustomText_361) == 0x000620, "Member 'UUw_fight_monster_hp_C::CustomText_361' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Damage) == 0x000628, "Member 'UUw_fight_monster_hp_C::Damage' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Effect) == 0x000630, "Member 'UUw_fight_monster_hp_C::Effect' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Elite) == 0x000638, "Member 'UUw_fight_monster_hp_C::Elite' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, HPBG) == 0x000640, "Member 'UUw_fight_monster_hp_C::HPBG' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Image) == 0x000648, "Member 'UUw_fight_monster_hp_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Image_1) == 0x000650, "Member 'UUw_fight_monster_hp_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Image_2) == 0x000658, "Member 'UUw_fight_monster_hp_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Image_3) == 0x000660, "Member 'UUw_fight_monster_hp_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Image_4) == 0x000668, "Member 'UUw_fight_monster_hp_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Image_5) == 0x000670, "Member 'UUw_fight_monster_hp_C::Image_5' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Image_6) == 0x000678, "Member 'UUw_fight_monster_hp_C::Image_6' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Image_35) == 0x000680, "Member 'UUw_fight_monster_hp_C::Image_35' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Image_89) == 0x000688, "Member 'UUw_fight_monster_hp_C::Image_89' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Img_Line) == 0x000690, "Member 'UUw_fight_monster_hp_C::Img_Line' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Img_Line_1) == 0x000698, "Member 'UUw_fight_monster_hp_C::Img_Line_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, ImgBeheaded) == 0x0006A0, "Member 'UUw_fight_monster_hp_C::ImgBeheaded' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, ImgStackHp) == 0x0006A8, "Member 'UUw_fight_monster_hp_C::ImgStackHp' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, ImgStackShield) == 0x0006B0, "Member 'UUw_fight_monster_hp_C::ImgStackShield' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, ImgTarget) == 0x0006B8, "Member 'UUw_fight_monster_hp_C::ImgTarget' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, ImgTarget_1) == 0x0006C0, "Member 'UUw_fight_monster_hp_C::ImgTarget_1' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, InvalidationBox_0) == 0x0006C8, "Member 'UUw_fight_monster_hp_C::InvalidationBox_0' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Mask_2) == 0x0006D0, "Member 'UUw_fight_monster_hp_C::Mask_2' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Monster) == 0x0006D8, "Member 'UUw_fight_monster_hp_C::Monster' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, PanelBounce) == 0x0006E0, "Member 'UUw_fight_monster_hp_C::PanelBounce' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, PanelCrossbow) == 0x0006E8, "Member 'UUw_fight_monster_hp_C::PanelCrossbow' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, PanelThreat) == 0x0006F0, "Member 'UUw_fight_monster_hp_C::PanelThreat' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Progress) == 0x0006F8, "Member 'UUw_fight_monster_hp_C::Progress' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, ProgressRed) == 0x000700, "Member 'UUw_fight_monster_hp_C::ProgressRed' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, RED1) == 0x000708, "Member 'UUw_fight_monster_hp_C::RED1' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, Shield) == 0x000710, "Member 'UUw_fight_monster_hp_C::Shield' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, StateInvincible) == 0x000718, "Member 'UUw_fight_monster_hp_C::StateInvincible' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, StateReduceTreat) == 0x000720, "Member 'UUw_fight_monster_hp_C::StateReduceTreat' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, StateReplyAdd) == 0x000728, "Member 'UUw_fight_monster_hp_C::StateReplyAdd' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, StateShootDamageAdd) == 0x000730, "Member 'UUw_fight_monster_hp_C::StateShootDamageAdd' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, StateSkillDamageAdd) == 0x000738, "Member 'UUw_fight_monster_hp_C::StateSkillDamageAdd' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, TargetMonster) == 0x000740, "Member 'UUw_fight_monster_hp_C::TargetMonster' has a wrong offset!");
static_assert(offsetof(UUw_fight_monster_hp_C, SkillPos) == 0x000748, "Member 'UUw_fight_monster_hp_C::SkillPos' has a wrong offset!");

}

