#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_fight_player_item_skill03

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_fight_player_item_skill03.uw_fight_player_item_skill03_C.K2_PlayEnoughAnim
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_skill03_C_K2_PlayEnoughAnim final
{
public:
	bool                                          bPlay;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_skill03_C_K2_PlayEnoughAnim) == 0x000001, "Wrong alignment on Uw_fight_player_item_skill03_C_K2_PlayEnoughAnim");
static_assert(sizeof(Uw_fight_player_item_skill03_C_K2_PlayEnoughAnim) == 0x000001, "Wrong size on Uw_fight_player_item_skill03_C_K2_PlayEnoughAnim");
static_assert(offsetof(Uw_fight_player_item_skill03_C_K2_PlayEnoughAnim, bPlay) == 0x000000, "Member 'Uw_fight_player_item_skill03_C_K2_PlayEnoughAnim::bPlay' has a wrong offset!");

// Function uw_fight_player_item_skill03.uw_fight_player_item_skill03_C.OnSkillStrengthening
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_skill03_C_OnSkillStrengthening final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_skill03_C_OnSkillStrengthening) == 0x000001, "Wrong alignment on Uw_fight_player_item_skill03_C_OnSkillStrengthening");
static_assert(sizeof(Uw_fight_player_item_skill03_C_OnSkillStrengthening) == 0x000001, "Wrong size on Uw_fight_player_item_skill03_C_OnSkillStrengthening");
static_assert(offsetof(Uw_fight_player_item_skill03_C_OnSkillStrengthening, bStart) == 0x000000, "Member 'Uw_fight_player_item_skill03_C_OnSkillStrengthening::bStart' has a wrong offset!");

// Function uw_fight_player_item_skill03.uw_fight_player_item_skill03_C.OnSkillKeepInterrupt
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_skill03_C_OnSkillKeepInterrupt final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_skill03_C_OnSkillKeepInterrupt) == 0x000001, "Wrong alignment on Uw_fight_player_item_skill03_C_OnSkillKeepInterrupt");
static_assert(sizeof(Uw_fight_player_item_skill03_C_OnSkillKeepInterrupt) == 0x000001, "Wrong size on Uw_fight_player_item_skill03_C_OnSkillKeepInterrupt");
static_assert(offsetof(Uw_fight_player_item_skill03_C_OnSkillKeepInterrupt, bStart) == 0x000000, "Member 'Uw_fight_player_item_skill03_C_OnSkillKeepInterrupt::bStart' has a wrong offset!");

// Function uw_fight_player_item_skill03.uw_fight_player_item_skill03_C.OnUIEffectSkillLongPress
// 0x0001 (0x0001 - 0x0000)
struct Uw_fight_player_item_skill03_C_OnUIEffectSkillLongPress final
{
public:
	bool                                          bStart;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_skill03_C_OnUIEffectSkillLongPress) == 0x000001, "Wrong alignment on Uw_fight_player_item_skill03_C_OnUIEffectSkillLongPress");
static_assert(sizeof(Uw_fight_player_item_skill03_C_OnUIEffectSkillLongPress) == 0x000001, "Wrong size on Uw_fight_player_item_skill03_C_OnUIEffectSkillLongPress");
static_assert(offsetof(Uw_fight_player_item_skill03_C_OnUIEffectSkillLongPress, bStart) == 0x000000, "Member 'Uw_fight_player_item_skill03_C_OnUIEffectSkillLongPress::bStart' has a wrong offset!");

// Function uw_fight_player_item_skill03.uw_fight_player_item_skill03_C.K2_OnCustomUmgAnimFinished
// 0x0008 (0x0008 - 0x0000)
struct Uw_fight_player_item_skill03_C_K2_OnCustomUmgAnimFinished final
{
public:
	class FName                                   AnimName;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_fight_player_item_skill03_C_K2_OnCustomUmgAnimFinished) == 0x000004, "Wrong alignment on Uw_fight_player_item_skill03_C_K2_OnCustomUmgAnimFinished");
static_assert(sizeof(Uw_fight_player_item_skill03_C_K2_OnCustomUmgAnimFinished) == 0x000008, "Wrong size on Uw_fight_player_item_skill03_C_K2_OnCustomUmgAnimFinished");
static_assert(offsetof(Uw_fight_player_item_skill03_C_K2_OnCustomUmgAnimFinished, AnimName) == 0x000000, "Member 'Uw_fight_player_item_skill03_C_K2_OnCustomUmgAnimFinished::AnimName' has a wrong offset!");

// Function uw_fight_player_item_skill03.uw_fight_player_item_skill03_C.ExecuteUbergraph_uw_fight_player_item_skill03
// 0x0014 (0x0014 - 0x0000)
struct Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_AnimName;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bPlay;                                // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_2;                             // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart_1;                             // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bStart;                               // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03) == 0x000004, "Wrong alignment on Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03");
static_assert(sizeof(Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03) == 0x000014, "Wrong size on Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03");
static_assert(offsetof(Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03, EntryPoint) == 0x000000, "Member 'Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03, K2Node_Event_AnimName) == 0x000004, "Member 'Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03::K2Node_Event_AnimName' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00000C, "Member 'Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03, K2Node_Event_bPlay) == 0x00000D, "Member 'Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03::K2Node_Event_bPlay' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03, K2Node_Event_bStart_2) == 0x00000E, "Member 'Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03::K2Node_Event_bStart_2' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03, K2Node_Event_bStart_1) == 0x00000F, "Member 'Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03::K2Node_Event_bStart_1' has a wrong offset!");
static_assert(offsetof(Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03, K2Node_Event_bStart) == 0x000010, "Member 'Uw_fight_player_item_skill03_C_ExecuteUbergraph_uw_fight_player_item_skill03::K2Node_Event_bStart' has a wrong offset!");

}

