#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_guide_keybtn

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_guide_keybtn.uw_guide_keybtn_C
// 0x0020 (0x03D0 - 0x03B0)
class UUw_guide_keybtn_C final : public ULuaWidget
{
public:
	class UGameCanvasPanel*                       CanvasPanel;                                       // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUw_fight_skill_keybtn_C*               KeyBtn;                                            // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         KeyBtnImage;                                       // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelKey;                                          // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_guide_keybtn_C">();
	}
	static class UUw_guide_keybtn_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_guide_keybtn_C>();
	}
};
static_assert(alignof(UUw_guide_keybtn_C) == 0x000008, "Wrong alignment on UUw_guide_keybtn_C");
static_assert(sizeof(UUw_guide_keybtn_C) == 0x0003D0, "Wrong size on UUw_guide_keybtn_C");
static_assert(offsetof(UUw_guide_keybtn_C, CanvasPanel) == 0x0003B0, "Member 'UUw_guide_keybtn_C::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UUw_guide_keybtn_C, KeyBtn) == 0x0003B8, "Member 'UUw_guide_keybtn_C::KeyBtn' has a wrong offset!");
static_assert(offsetof(UUw_guide_keybtn_C, KeyBtnImage) == 0x0003C0, "Member 'UUw_guide_keybtn_C::KeyBtnImage' has a wrong offset!");
static_assert(offsetof(UUw_guide_keybtn_C, PanelKey) == 0x0003C8, "Member 'UUw_guide_keybtn_C::PanelKey' has a wrong offset!");

}

