#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_healthroom_minidiff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_healthroom_minidiff.uw_healthroom_minidiff_C
// 0x0018 (0x03C8 - 0x03B0)
class UUw_healthroom_minidiff_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URedirectImage*                         BG;                                                // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtName;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Destruct();
	void OnConstruct();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void Construct();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet__Overridden(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_healthroom_minidiff(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_healthroom_minidiff_C">();
	}
	static class UUw_healthroom_minidiff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_healthroom_minidiff_C>();
	}
};
static_assert(alignof(UUw_healthroom_minidiff_C) == 0x000008, "Wrong alignment on UUw_healthroom_minidiff_C");
static_assert(sizeof(UUw_healthroom_minidiff_C) == 0x0003C8, "Wrong size on UUw_healthroom_minidiff_C");
static_assert(offsetof(UUw_healthroom_minidiff_C, UberGraphFrame) == 0x0003B0, "Member 'UUw_healthroom_minidiff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_healthroom_minidiff_C, BG) == 0x0003B8, "Member 'UUw_healthroom_minidiff_C::BG' has a wrong offset!");
static_assert(offsetof(UUw_healthroom_minidiff_C, TxtName) == 0x0003C0, "Member 'UUw_healthroom_minidiff_C::TxtName' has a wrong offset!");

}

