#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_open_world_task_list_item

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_open_world_task_list_item.uw_open_world_task_list_item_C
// 0x0058 (0x0408 - 0x03B0)
class UUw_open_world_task_list_item_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Enter;                                             // 0x03B8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                                BottomBg;                                          // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         Des;                                               // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Disable;                                           // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Fail;                                              // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Flag;                                              // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Progress;                                          // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Root;                                              // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Split;                                             // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Succ;                                              // 0x0400(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SetState(uint8 InState);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet__Overridden(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_open_world_task_list_item(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_open_world_task_list_item_C">();
	}
	static class UUw_open_world_task_list_item_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_open_world_task_list_item_C>();
	}
};
static_assert(alignof(UUw_open_world_task_list_item_C) == 0x000008, "Wrong alignment on UUw_open_world_task_list_item_C");
static_assert(sizeof(UUw_open_world_task_list_item_C) == 0x000408, "Wrong size on UUw_open_world_task_list_item_C");
static_assert(offsetof(UUw_open_world_task_list_item_C, UberGraphFrame) == 0x0003B0, "Member 'UUw_open_world_task_list_item_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_open_world_task_list_item_C, Enter) == 0x0003B8, "Member 'UUw_open_world_task_list_item_C::Enter' has a wrong offset!");
static_assert(offsetof(UUw_open_world_task_list_item_C, BottomBg) == 0x0003C0, "Member 'UUw_open_world_task_list_item_C::BottomBg' has a wrong offset!");
static_assert(offsetof(UUw_open_world_task_list_item_C, Des) == 0x0003C8, "Member 'UUw_open_world_task_list_item_C::Des' has a wrong offset!");
static_assert(offsetof(UUw_open_world_task_list_item_C, Disable) == 0x0003D0, "Member 'UUw_open_world_task_list_item_C::Disable' has a wrong offset!");
static_assert(offsetof(UUw_open_world_task_list_item_C, Fail) == 0x0003D8, "Member 'UUw_open_world_task_list_item_C::Fail' has a wrong offset!");
static_assert(offsetof(UUw_open_world_task_list_item_C, Flag) == 0x0003E0, "Member 'UUw_open_world_task_list_item_C::Flag' has a wrong offset!");
static_assert(offsetof(UUw_open_world_task_list_item_C, Progress) == 0x0003E8, "Member 'UUw_open_world_task_list_item_C::Progress' has a wrong offset!");
static_assert(offsetof(UUw_open_world_task_list_item_C, Root) == 0x0003F0, "Member 'UUw_open_world_task_list_item_C::Root' has a wrong offset!");
static_assert(offsetof(UUw_open_world_task_list_item_C, Split) == 0x0003F8, "Member 'UUw_open_world_task_list_item_C::Split' has a wrong offset!");
static_assert(offsetof(UUw_open_world_task_list_item_C, Succ) == 0x000400, "Member 'UUw_open_world_task_list_item_C::Succ' has a wrong offset!");

}

