#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_online_rolelist

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_online_rolelist.uw_online_rolelist_C
// 0x0030 (0x02B0 - 0x0280)
class UUw_online_rolelist_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0280(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Select;                                            // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Image_461;                                         // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Leader;                                            // 0x0298(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TextBlock_88;                                      // 0x02A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TextLvNum;                                         // 0x02A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_uw_online_rolelist(int32 EntryPoint);
	void Construct__Overridden();
	void OnListItemObjectSet(class UObject* ListItemObject);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnEntryReleased();
	void Construct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_online_rolelist_C">();
	}
	static class UUw_online_rolelist_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_online_rolelist_C>();
	}
};
static_assert(alignof(UUw_online_rolelist_C) == 0x000008, "Wrong alignment on UUw_online_rolelist_C");
static_assert(sizeof(UUw_online_rolelist_C) == 0x0002B0, "Wrong size on UUw_online_rolelist_C");
static_assert(offsetof(UUw_online_rolelist_C, UberGraphFrame) == 0x000280, "Member 'UUw_online_rolelist_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_online_rolelist_C, Select) == 0x000288, "Member 'UUw_online_rolelist_C::Select' has a wrong offset!");
static_assert(offsetof(UUw_online_rolelist_C, Image_461) == 0x000290, "Member 'UUw_online_rolelist_C::Image_461' has a wrong offset!");
static_assert(offsetof(UUw_online_rolelist_C, Leader) == 0x000298, "Member 'UUw_online_rolelist_C::Leader' has a wrong offset!");
static_assert(offsetof(UUw_online_rolelist_C, TextBlock_88) == 0x0002A0, "Member 'UUw_online_rolelist_C::TextBlock_88' has a wrong offset!");
static_assert(offsetof(UUw_online_rolelist_C, TextLvNum) == 0x0002A8, "Member 'UUw_online_rolelist_C::TextLvNum' has a wrong offset!");

}

