#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_sevendays_stars

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_sevendays_stars.uw_sevendays_stars_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_sevendays_stars_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_sevendays_stars_C_BP_OnItemExpansionChanged;

// Function uw_sevendays_stars.uw_sevendays_stars_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_sevendays_stars_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_sevendays_stars_C_BP_OnItemSelectionChanged;

// Function uw_sevendays_stars.uw_sevendays_stars_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct uw_sevendays_stars_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_sevendays_stars_C_OnListItemObjectSet;

// Function uw_sevendays_stars.uw_sevendays_stars_C.ExecuteUbergraph_uw_sevendays_stars
// 0x0018 (0x0018 - 0x0000)
struct uw_sevendays_stars_C_ExecuteUbergraph_uw_sevendays_stars final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_sevendays_stars_C_ExecuteUbergraph_uw_sevendays_stars;

// Function uw_sevendays_stars.uw_sevendays_stars_C.GetModuleName
// 0x0038 (0x0038 - 0x0000)
struct uw_sevendays_stars_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
	TSoftObjectPtr<class UVtaSlateTexture>        NewLocalVar_0;                                     // 0x0010(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_sevendays_stars_C_GetModuleName;

}

