#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_task_interaction_progress

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_task_interaction_progress.uw_task_interaction_progress_C.StopProgress
// 0x0004 (0x0004 - 0x0000)
struct Uw_task_interaction_progress_C_StopProgress final
{
public:
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_task_interaction_progress_C_StopProgress) == 0x000004, "Wrong alignment on Uw_task_interaction_progress_C_StopProgress");
static_assert(sizeof(Uw_task_interaction_progress_C_StopProgress) == 0x000004, "Wrong size on Uw_task_interaction_progress_C_StopProgress");
static_assert(offsetof(Uw_task_interaction_progress_C_StopProgress, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000000, "Member 'Uw_task_interaction_progress_C_StopProgress::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function uw_task_interaction_progress.uw_task_interaction_progress_C.StartProgress
// 0x0008 (0x0008 - 0x0000)
struct Uw_task_interaction_progress_C_StartProgress final
{
public:
	float                                         PerformTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_task_interaction_progress_C_StartProgress) == 0x000004, "Wrong alignment on Uw_task_interaction_progress_C_StartProgress");
static_assert(sizeof(Uw_task_interaction_progress_C_StartProgress) == 0x000008, "Wrong size on Uw_task_interaction_progress_C_StartProgress");
static_assert(offsetof(Uw_task_interaction_progress_C_StartProgress, PerformTime) == 0x000000, "Member 'Uw_task_interaction_progress_C_StartProgress::PerformTime' has a wrong offset!");
static_assert(offsetof(Uw_task_interaction_progress_C_StartProgress, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000004, "Member 'Uw_task_interaction_progress_C_StartProgress::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");

// Function uw_task_interaction_progress.uw_task_interaction_progress_C.Tick
// 0x003C (0x003C - 0x0000)
struct Uw_task_interaction_progress_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_task_interaction_progress_C_Tick) == 0x000004, "Wrong alignment on Uw_task_interaction_progress_C_Tick");
static_assert(sizeof(Uw_task_interaction_progress_C_Tick) == 0x00003C, "Wrong size on Uw_task_interaction_progress_C_Tick");
static_assert(offsetof(Uw_task_interaction_progress_C_Tick, MyGeometry) == 0x000000, "Member 'Uw_task_interaction_progress_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_task_interaction_progress_C_Tick, InDeltaTime) == 0x000038, "Member 'Uw_task_interaction_progress_C_Tick::InDeltaTime' has a wrong offset!");

// Function uw_task_interaction_progress.uw_task_interaction_progress_C.ExecuteUbergraph_uw_task_interaction_progress
// 0x004C (0x004C - 0x0000)
struct Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress) == 0x000004, "Wrong alignment on Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress");
static_assert(sizeof(Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress) == 0x00004C, "Wrong size on Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress");
static_assert(offsetof(Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress, EntryPoint) == 0x000000, "Member 'Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress, K2Node_Event_MyGeometry) == 0x000004, "Member 'Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress, K2Node_Event_InDeltaTime) == 0x00003C, "Member 'Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000040, "Member 'Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress, CallFunc_Add_FloatFloat_ReturnValue) == 0x000044, "Member 'Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000048, "Member 'Uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function uw_task_interaction_progress.uw_task_interaction_progress_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_task_interaction_progress_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_task_interaction_progress_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_task_interaction_progress_C_GetModuleName");
static_assert(sizeof(Uw_task_interaction_progress_C_GetModuleName) == 0x000010, "Wrong size on Uw_task_interaction_progress_C_GetModuleName");
static_assert(offsetof(Uw_task_interaction_progress_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_task_interaction_progress_C_GetModuleName::ReturnValue' has a wrong offset!");

}

