#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_task_target_progress

#include "Basic.hpp"


namespace SDK::Params
{

// Function uw_task_target_progress.uw_task_target_progress_C.Init__Overridden
// 0x0008 (0x0008 - 0x0000)
struct Uw_task_target_progress_C_Init__Overridden final
{
public:
	class UObject*                                InOuter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_task_target_progress_C_Init__Overridden) == 0x000008, "Wrong alignment on Uw_task_target_progress_C_Init__Overridden");
static_assert(sizeof(Uw_task_target_progress_C_Init__Overridden) == 0x000008, "Wrong size on Uw_task_target_progress_C_Init__Overridden");
static_assert(offsetof(Uw_task_target_progress_C_Init__Overridden, InOuter) == 0x000000, "Member 'Uw_task_target_progress_C_Init__Overridden::InOuter' has a wrong offset!");

// LuaFunction uw_task_target_progress.uw_task_target_progress_C.Init
// 0x0008 (0x0008 - 0x0000)
struct Uw_task_target_progress_C_Init final
{
public:
	class UObject*                                InOuter;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_task_target_progress_C_Init) == 0x000008, "Wrong alignment on Uw_task_target_progress_C_Init");
static_assert(sizeof(Uw_task_target_progress_C_Init) == 0x000008, "Wrong size on Uw_task_target_progress_C_Init");
static_assert(offsetof(Uw_task_target_progress_C_Init, InOuter) == 0x000000, "Member 'Uw_task_target_progress_C_Init::InOuter' has a wrong offset!");

// Function uw_task_target_progress.uw_task_target_progress_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_task_target_progress_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_task_target_progress_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_task_target_progress_C_GetModuleName");
static_assert(sizeof(Uw_task_target_progress_C_GetModuleName) == 0x000010, "Wrong size on Uw_task_target_progress_C_GetModuleName");
static_assert(offsetof(Uw_task_target_progress_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_task_target_progress_C_GetModuleName::ReturnValue' has a wrong offset!");

}

