#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_test_boss203_break_progress

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_test_boss203_break_progress.uw_test_boss203_break_progress_C
// 0x0018 (0x03C8 - 0x03B0)
class UUw_test_boss203_break_progress_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UProgressBar*                           Progress;                                          // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         AddSpeed;                                          // 0x03C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bPerform;                                          // 0x03C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_uw_test_boss203_break_progress(int32 EntryPoint);
	void Destruct();
	void OnConstruct();
	void StopProgress();
	void StartProgress(float PerformTime);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_test_boss203_break_progress_C">();
	}
	static class UUw_test_boss203_break_progress_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_test_boss203_break_progress_C>();
	}
};
static_assert(alignof(UUw_test_boss203_break_progress_C) == 0x000008, "Wrong alignment on UUw_test_boss203_break_progress_C");
static_assert(sizeof(UUw_test_boss203_break_progress_C) == 0x0003C8, "Wrong size on UUw_test_boss203_break_progress_C");
static_assert(offsetof(UUw_test_boss203_break_progress_C, UberGraphFrame) == 0x0003B0, "Member 'UUw_test_boss203_break_progress_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_test_boss203_break_progress_C, Progress) == 0x0003B8, "Member 'UUw_test_boss203_break_progress_C::Progress' has a wrong offset!");
static_assert(offsetof(UUw_test_boss203_break_progress_C, AddSpeed) == 0x0003C0, "Member 'UUw_test_boss203_break_progress_C::AddSpeed' has a wrong offset!");
static_assert(offsetof(UUw_test_boss203_break_progress_C, bPerform) == 0x0003C4, "Member 'UUw_test_boss203_break_progress_C::bPerform' has a wrong offset!");

}

