#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_task_interaction_progress

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function uw_task_interaction_progress.uw_task_interaction_progress_C.StopProgress
// 0x0004 (0x0004 - 0x0000)
struct uw_task_interaction_progress_C_StopProgress final
{
public:
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_task_interaction_progress_C_StopProgress;

// Function uw_task_interaction_progress.uw_task_interaction_progress_C.StartProgress
// 0x0008 (0x0008 - 0x0000)
struct uw_task_interaction_progress_C_StartProgress final
{
public:
	float                                         PerformTime;                                       // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_task_interaction_progress_C_StartProgress;

// Function uw_task_interaction_progress.uw_task_interaction_progress_C.Tick
// 0x003C (0x003C - 0x0000)
struct uw_task_interaction_progress_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_task_interaction_progress_C_Tick;

// Function uw_task_interaction_progress.uw_task_interaction_progress_C.ExecuteUbergraph_uw_task_interaction_progress
// 0x004C (0x004C - 0x0000)
struct uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0004(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_task_interaction_progress_C_ExecuteUbergraph_uw_task_interaction_progress;

// Function uw_task_interaction_progress.uw_task_interaction_progress_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_task_interaction_progress_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_task_interaction_progress_C_GetModuleName;

}

