#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_vehicle_switch

#include "Basic.hpp"

#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_vehicle_switch.uw_vehicle_switch_C
// 0x0018 (0x0298 - 0x0280)
class UUw_vehicle_switch_C final : public UUserWidget
{
public:
	class UWidgetAnimation*                       Exit;                                              // 0x0280(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Entry;                                             // 0x0288(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class URedirectImage*                         Black;                                             // 0x0290(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_vehicle_switch_C">();
	}
	static class UUw_vehicle_switch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_vehicle_switch_C>();
	}
};
static_assert(alignof(UUw_vehicle_switch_C) == 0x000008, "Wrong alignment on UUw_vehicle_switch_C");
static_assert(sizeof(UUw_vehicle_switch_C) == 0x000298, "Wrong size on UUw_vehicle_switch_C");
static_assert(offsetof(UUw_vehicle_switch_C, Exit) == 0x000280, "Member 'UUw_vehicle_switch_C::Exit' has a wrong offset!");
static_assert(offsetof(UUw_vehicle_switch_C, Entry) == 0x000288, "Member 'UUw_vehicle_switch_C::Entry' has a wrong offset!");
static_assert(offsetof(UUw_vehicle_switch_C, Black) == 0x000290, "Member 'UUw_vehicle_switch_C::Black' has a wrong offset!");

}

