#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_waterpark_joystick

#include "Basic.hpp"

#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_waterpark_joystick.uw_waterpark_joystick_C
// 0x0058 (0x0BE8 - 0x0B90)
class UUw_waterpark_joystick_C final : public UWaterParkJoyStick
{
public:
	class URedirectImage*                         ImgAni1;                                           // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgAni2;                                           // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgAni3;                                           // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgBG;                                             // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgContinued;                                      // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgContinued_1;                                    // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgContinued_2;                                    // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgContinued_3;                                    // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDirection22;                                    // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         ImgDirection22_1;                                  // 0x0BD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Run;                                               // 0x0BE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_waterpark_joystick_C">();
	}
	static class UUw_waterpark_joystick_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_waterpark_joystick_C>();
	}
};
static_assert(alignof(UUw_waterpark_joystick_C) == 0x000008, "Wrong alignment on UUw_waterpark_joystick_C");
static_assert(sizeof(UUw_waterpark_joystick_C) == 0x000BE8, "Wrong size on UUw_waterpark_joystick_C");
static_assert(offsetof(UUw_waterpark_joystick_C, ImgAni1) == 0x000B90, "Member 'UUw_waterpark_joystick_C::ImgAni1' has a wrong offset!");
static_assert(offsetof(UUw_waterpark_joystick_C, ImgAni2) == 0x000B98, "Member 'UUw_waterpark_joystick_C::ImgAni2' has a wrong offset!");
static_assert(offsetof(UUw_waterpark_joystick_C, ImgAni3) == 0x000BA0, "Member 'UUw_waterpark_joystick_C::ImgAni3' has a wrong offset!");
static_assert(offsetof(UUw_waterpark_joystick_C, ImgBG) == 0x000BA8, "Member 'UUw_waterpark_joystick_C::ImgBG' has a wrong offset!");
static_assert(offsetof(UUw_waterpark_joystick_C, ImgContinued) == 0x000BB0, "Member 'UUw_waterpark_joystick_C::ImgContinued' has a wrong offset!");
static_assert(offsetof(UUw_waterpark_joystick_C, ImgContinued_1) == 0x000BB8, "Member 'UUw_waterpark_joystick_C::ImgContinued_1' has a wrong offset!");
static_assert(offsetof(UUw_waterpark_joystick_C, ImgContinued_2) == 0x000BC0, "Member 'UUw_waterpark_joystick_C::ImgContinued_2' has a wrong offset!");
static_assert(offsetof(UUw_waterpark_joystick_C, ImgContinued_3) == 0x000BC8, "Member 'UUw_waterpark_joystick_C::ImgContinued_3' has a wrong offset!");
static_assert(offsetof(UUw_waterpark_joystick_C, ImgDirection22) == 0x000BD0, "Member 'UUw_waterpark_joystick_C::ImgDirection22' has a wrong offset!");
static_assert(offsetof(UUw_waterpark_joystick_C, ImgDirection22_1) == 0x000BD8, "Member 'UUw_waterpark_joystick_C::ImgDirection22_1' has a wrong offset!");
static_assert(offsetof(UUw_waterpark_joystick_C, Run) == 0x000BE0, "Member 'UUw_waterpark_joystick_C::Run' has a wrong offset!");

}

