#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_widgets_item_list

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction uw_widgets_item_list.uw_widgets_item_list_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct Uw_widgets_item_list_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_widgets_item_list_C_OnListItemObjectSet) == 0x000008, "Wrong alignment on Uw_widgets_item_list_C_OnListItemObjectSet");
static_assert(sizeof(Uw_widgets_item_list_C_OnListItemObjectSet) == 0x000008, "Wrong size on Uw_widgets_item_list_C_OnListItemObjectSet");
static_assert(offsetof(Uw_widgets_item_list_C_OnListItemObjectSet, ListItemObject) == 0x000000, "Member 'Uw_widgets_item_list_C_OnListItemObjectSet::ListItemObject' has a wrong offset!");

// Function uw_widgets_item_list.uw_widgets_item_list_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct Uw_widgets_item_list_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_widgets_item_list_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong alignment on Uw_widgets_item_list_C_BP_OnItemExpansionChanged");
static_assert(sizeof(Uw_widgets_item_list_C_BP_OnItemExpansionChanged) == 0x000001, "Wrong size on Uw_widgets_item_list_C_BP_OnItemExpansionChanged");
static_assert(offsetof(Uw_widgets_item_list_C_BP_OnItemExpansionChanged, bIsExpanded) == 0x000000, "Member 'Uw_widgets_item_list_C_BP_OnItemExpansionChanged::bIsExpanded' has a wrong offset!");

// Function uw_widgets_item_list.uw_widgets_item_list_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct Uw_widgets_item_list_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Uw_widgets_item_list_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong alignment on Uw_widgets_item_list_C_BP_OnItemSelectionChanged");
static_assert(sizeof(Uw_widgets_item_list_C_BP_OnItemSelectionChanged) == 0x000001, "Wrong size on Uw_widgets_item_list_C_BP_OnItemSelectionChanged");
static_assert(offsetof(Uw_widgets_item_list_C_BP_OnItemSelectionChanged, bIsSelected) == 0x000000, "Member 'Uw_widgets_item_list_C_BP_OnItemSelectionChanged::bIsSelected' has a wrong offset!");

// Function uw_widgets_item_list.uw_widgets_item_list_C.OnListItemObjectSet__Overridden
// 0x0008 (0x0008 - 0x0000)
struct Uw_widgets_item_list_C_OnListItemObjectSet__Overridden final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_widgets_item_list_C_OnListItemObjectSet__Overridden) == 0x000008, "Wrong alignment on Uw_widgets_item_list_C_OnListItemObjectSet__Overridden");
static_assert(sizeof(Uw_widgets_item_list_C_OnListItemObjectSet__Overridden) == 0x000008, "Wrong size on Uw_widgets_item_list_C_OnListItemObjectSet__Overridden");
static_assert(offsetof(Uw_widgets_item_list_C_OnListItemObjectSet__Overridden, ListItemObject) == 0x000000, "Member 'Uw_widgets_item_list_C_OnListItemObjectSet__Overridden::ListItemObject' has a wrong offset!");

// Function uw_widgets_item_list.uw_widgets_item_list_C.ExecuteUbergraph_uw_widgets_item_list
// 0x0030 (0x0030 - 0x0000)
struct Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEvent2DInSequence_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEvent2DInSequence_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEvent2DInSequence_ReturnValue_2;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list) == 0x000008, "Wrong alignment on Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list");
static_assert(sizeof(Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list) == 0x000030, "Wrong size on Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list");
static_assert(offsetof(Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list, EntryPoint) == 0x000000, "Member 'Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list::EntryPoint' has a wrong offset!");
static_assert(offsetof(Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list, CallFunc_PostEvent2DInSequence_ReturnValue) == 0x000008, "Member 'Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list::CallFunc_PostEvent2DInSequence_ReturnValue' has a wrong offset!");
static_assert(offsetof(Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list, K2Node_Event_bIsExpanded) == 0x000010, "Member 'Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list::K2Node_Event_bIsExpanded' has a wrong offset!");
static_assert(offsetof(Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list, K2Node_Event_bIsSelected) == 0x000011, "Member 'Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list::K2Node_Event_bIsSelected' has a wrong offset!");
static_assert(offsetof(Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list, K2Node_Event_ListItemObject) == 0x000018, "Member 'Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list::K2Node_Event_ListItemObject' has a wrong offset!");
static_assert(offsetof(Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list, CallFunc_PostEvent2DInSequence_ReturnValue_1) == 0x000020, "Member 'Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list::CallFunc_PostEvent2DInSequence_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list, CallFunc_PostEvent2DInSequence_ReturnValue_2) == 0x000028, "Member 'Uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list::CallFunc_PostEvent2DInSequence_ReturnValue_2' has a wrong offset!");

// Function uw_widgets_item_list.uw_widgets_item_list_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct Uw_widgets_item_list_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(Uw_widgets_item_list_C_GetModuleName) == 0x000008, "Wrong alignment on Uw_widgets_item_list_C_GetModuleName");
static_assert(sizeof(Uw_widgets_item_list_C_GetModuleName) == 0x000010, "Wrong size on Uw_widgets_item_list_C_GetModuleName");
static_assert(offsetof(Uw_widgets_item_list_C_GetModuleName, ReturnValue) == 0x000000, "Member 'Uw_widgets_item_list_C_GetModuleName::ReturnValue' has a wrong offset!");

}

