#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_widgets_award_star

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_widgets_award_star.uw_widgets_award_star_C
// 0x0068 (0x0400 - 0x0398)
class UUw_widgets_award_star_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0398(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       EnterAnim;                                         // 0x03A0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UGameCanvasPanel*                       CanvasPanel_0;                                     // 0x03A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Common_panel;                                      // 0x03B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                         Completed;                                         // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     Des;                                               // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image1;                                            // 0x03C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectImage*                         Image2;                                            // 0x03D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Img;                                               // 0x03D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       PanelFail;                                         // 0x03E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGameCanvasPanel*                       Succ;                                              // 0x03E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCustomTextBlock*                       TxtCompleted;                                      // 0x03F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtTarget;                                         // 0x03F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Destruct();
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_widgets_award_star(int32 EntryPoint);

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_widgets_award_star_C">();
	}
	static class UUw_widgets_award_star_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_widgets_award_star_C>();
	}
};
static_assert(alignof(UUw_widgets_award_star_C) == 0x000008, "Wrong alignment on UUw_widgets_award_star_C");
static_assert(sizeof(UUw_widgets_award_star_C) == 0x000400, "Wrong size on UUw_widgets_award_star_C");
static_assert(offsetof(UUw_widgets_award_star_C, UberGraphFrame) == 0x000398, "Member 'UUw_widgets_award_star_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, EnterAnim) == 0x0003A0, "Member 'UUw_widgets_award_star_C::EnterAnim' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, CanvasPanel_0) == 0x0003A8, "Member 'UUw_widgets_award_star_C::CanvasPanel_0' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, Common_panel) == 0x0003B0, "Member 'UUw_widgets_award_star_C::Common_panel' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, Completed) == 0x0003B8, "Member 'UUw_widgets_award_star_C::Completed' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, Des) == 0x0003C0, "Member 'UUw_widgets_award_star_C::Des' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, Image1) == 0x0003C8, "Member 'UUw_widgets_award_star_C::Image1' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, Image2) == 0x0003D0, "Member 'UUw_widgets_award_star_C::Image2' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, Img) == 0x0003D8, "Member 'UUw_widgets_award_star_C::Img' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, PanelFail) == 0x0003E0, "Member 'UUw_widgets_award_star_C::PanelFail' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, Succ) == 0x0003E8, "Member 'UUw_widgets_award_star_C::Succ' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, TxtCompleted) == 0x0003F0, "Member 'UUw_widgets_award_star_C::TxtCompleted' has a wrong offset!");
static_assert(offsetof(UUw_widgets_award_star_C, TxtTarget) == 0x0003F8, "Member 'UUw_widgets_award_star_C::TxtTarget' has a wrong offset!");

}

