#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Uw_widgets_skilltag

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass uw_widgets_skilltag.uw_widgets_skilltag_C
// 0x0018 (0x03C8 - 0x03B0)
class UUw_widgets_skilltag_C final : public ULuaWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class URedirectImage*                         Image;                                             // 0x03B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URedirectTextBlock*                     TxtType;                                           // 0x03C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void OnListItemObjectSet__Overridden(class UObject* ListItemObject);
	void ExecuteUbergraph_uw_widgets_skilltag(int32 EntryPoint);
	void OnListItemObjectSet(class UObject* ListItemObject);
	void OnConstruct();
	void Destruct();

	class FString GetModuleName() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"uw_widgets_skilltag_C">();
	}
	static class UUw_widgets_skilltag_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUw_widgets_skilltag_C>();
	}
};
static_assert(alignof(UUw_widgets_skilltag_C) == 0x000008, "Wrong alignment on UUw_widgets_skilltag_C");
static_assert(sizeof(UUw_widgets_skilltag_C) == 0x0003C8, "Wrong size on UUw_widgets_skilltag_C");
static_assert(offsetof(UUw_widgets_skilltag_C, UberGraphFrame) == 0x0003B0, "Member 'UUw_widgets_skilltag_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUw_widgets_skilltag_C, Image) == 0x0003B8, "Member 'UUw_widgets_skilltag_C::Image' has a wrong offset!");
static_assert(offsetof(UUw_widgets_skilltag_C, TxtType) == 0x0003C0, "Member 'UUw_widgets_skilltag_C::TxtType' has a wrong offset!");

}

