#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: uw_widgets_item_list

#include "Basic.hpp"


namespace SDK::Params
{

// LuaFunction uw_widgets_item_list.uw_widgets_item_list_C.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct uw_widgets_item_list_C_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_widgets_item_list_C_OnListItemObjectSet;

// Function uw_widgets_item_list.uw_widgets_item_list_C.BP_OnItemExpansionChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_widgets_item_list_C_BP_OnItemExpansionChanged final
{
public:
	bool                                          bIsExpanded;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_widgets_item_list_C_BP_OnItemExpansionChanged;

// Function uw_widgets_item_list.uw_widgets_item_list_C.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct uw_widgets_item_list_C_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_uw_widgets_item_list_C_BP_OnItemSelectionChanged;

// Function uw_widgets_item_list.uw_widgets_item_list_C.OnListItemObjectSet__Overridden
// 0x0008 (0x0008 - 0x0000)
struct uw_widgets_item_list_C_OnListItemObjectSet__Overridden final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_widgets_item_list_C_OnListItemObjectSet__Overridden;

// Function uw_widgets_item_list.uw_widgets_item_list_C.ExecuteUbergraph_uw_widgets_item_list
// 0x0030 (0x0030 - 0x0000)
struct uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        CallFunc_PostEvent2DInSequence_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bIsExpanded;                          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bIsSelected;                          // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_Event_ListItemObject;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEvent2DInSequence_ReturnValue_1;      // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseComponent*                        CallFunc_PostEvent2DInSequence_ReturnValue_2;      // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_widgets_item_list_C_ExecuteUbergraph_uw_widgets_item_list;

// Function uw_widgets_item_list.uw_widgets_item_list_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct uw_widgets_item_list_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_uw_widgets_item_list_C_GetModuleName;

}

