#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VehicleMgr

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// LuaFunction VehicleMgr.VehicleMgr_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct VehicleMgr_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VehicleMgr_C_ReceiveTick) == 0x000004, "Wrong alignment on VehicleMgr_C_ReceiveTick");
static_assert(sizeof(VehicleMgr_C_ReceiveTick) == 0x000004, "Wrong size on VehicleMgr_C_ReceiveTick");
static_assert(offsetof(VehicleMgr_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'VehicleMgr_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// LuaFunction VehicleMgr.VehicleMgr_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct VehicleMgr_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(VehicleMgr_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on VehicleMgr_C_ReceiveEndPlay");
static_assert(sizeof(VehicleMgr_C_ReceiveEndPlay) == 0x000001, "Wrong size on VehicleMgr_C_ReceiveEndPlay");
static_assert(offsetof(VehicleMgr_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'VehicleMgr_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function VehicleMgr.VehicleMgr_C.GetModuleName
// 0x0010 (0x0010 - 0x0000)
struct VehicleMgr_C_GetModuleName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash)
};
static_assert(alignof(VehicleMgr_C_GetModuleName) == 0x000008, "Wrong alignment on VehicleMgr_C_GetModuleName");
static_assert(sizeof(VehicleMgr_C_GetModuleName) == 0x000010, "Wrong size on VehicleMgr_C_GetModuleName");
static_assert(offsetof(VehicleMgr_C_GetModuleName, ReturnValue) == 0x000000, "Member 'VehicleMgr_C_GetModuleName::ReturnValue' has a wrong offset!");

}

