#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VRule_Yiqieer_EmptySlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function VRule_Yiqieer_EmptySlot.VRule_Yiqieer_EmptySlot_C.K2_GetCurrentValue
// 0x0018 (0x0018 - 0x0000)
struct VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue final
{
public:
	const class UGameAbilityComponent*            GameAbility;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttributeValue_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttributeValue_ReturnValue_1;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue) == 0x000008, "Wrong alignment on VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue");
static_assert(sizeof(VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue) == 0x000018, "Wrong size on VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue");
static_assert(offsetof(VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue, GameAbility) == 0x000000, "Member 'VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue::GameAbility' has a wrong offset!");
static_assert(offsetof(VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue, ReturnValue) == 0x000008, "Member 'VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue::ReturnValue' has a wrong offset!");
static_assert(offsetof(VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue, CallFunc_GetAttributeValue_ReturnValue) == 0x00000C, "Member 'VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue::CallFunc_GetAttributeValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue, CallFunc_GetAttributeValue_ReturnValue_1) == 0x000010, "Member 'VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue::CallFunc_GetAttributeValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000014, "Member 'VRule_Yiqieer_EmptySlot_C_K2_GetCurrentValue::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

}

