#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VRule_Yiqieer_CurHealSlot_float

#include "Basic.hpp"


namespace SDK::Params
{

// Function VRule_Yiqieer_CurHealSlot_float.VRule_Yiqieer_CurHealSlot_Float_C.K2_GetCurrentValue
// 0x0018 (0x0018 - 0x0000)
struct VRule_Yiqieer_CurHealSlot_Float_C_K2_GetCurrentValue final
{
public:
	const class UGameAbilityComponent*            GameAbility;                                       // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttributeValue_ReturnValue;            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetAttributeValue_ReturnValue_1;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_VRule_Yiqieer_CurHealSlot_Float_C_K2_GetCurrentValue;

}

