#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WarningTipActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WarningTipActor.WarningTipActor_C
// 0x0090 (0x02B0 - 0x0220)
class AWarningTipActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0220(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   StaticMesh1;                                       // 0x0228(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh2;                                       // 0x0230(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0238(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_2_EndColor_AA3FD67F4ACCDAE4D407F99EE815306D; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_2__Direction_AA3FD67F4ACCDAE4D407F99EE815306D; // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_2;                                        // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_StartColor_E6BFC4594D062E1A0F141D9AE5C22859; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_E6BFC4594D062E1A0F141D9AE5C22859; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           Color;                                             // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bHide;                                             // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_279[0x3];                                      // 0x0279(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           BaseColor01;                                       // 0x027C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           BaseColor02;                                       // 0x028C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29C[0x4];                                      // 0x029C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               Mat1;                                              // 0x02A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               Mat2;                                              // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_2__FinishedFunc();
	void Timeline_2__UpdateFunc();
	void OnHide();
	void OnSpawn();
	void ReceiveTick(float DeltaSeconds);
	void OnShow();
	void OnRecycle();
	void ExecuteUbergraph_WarningTipActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WarningTipActor_C">();
	}
	static class AWarningTipActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWarningTipActor_C>();
	}
};
static_assert(alignof(AWarningTipActor_C) == 0x000008, "Wrong alignment on AWarningTipActor_C");
static_assert(sizeof(AWarningTipActor_C) == 0x0002B0, "Wrong size on AWarningTipActor_C");
static_assert(offsetof(AWarningTipActor_C, UberGraphFrame) == 0x000220, "Member 'AWarningTipActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, StaticMesh1) == 0x000228, "Member 'AWarningTipActor_C::StaticMesh1' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, StaticMesh2) == 0x000230, "Member 'AWarningTipActor_C::StaticMesh2' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, StaticMesh) == 0x000238, "Member 'AWarningTipActor_C::StaticMesh' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, DefaultSceneRoot) == 0x000240, "Member 'AWarningTipActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, Timeline_2_EndColor_AA3FD67F4ACCDAE4D407F99EE815306D) == 0x000248, "Member 'AWarningTipActor_C::Timeline_2_EndColor_AA3FD67F4ACCDAE4D407F99EE815306D' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, Timeline_2__Direction_AA3FD67F4ACCDAE4D407F99EE815306D) == 0x00024C, "Member 'AWarningTipActor_C::Timeline_2__Direction_AA3FD67F4ACCDAE4D407F99EE815306D' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, Timeline_2) == 0x000250, "Member 'AWarningTipActor_C::Timeline_2' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, Timeline_1_StartColor_E6BFC4594D062E1A0F141D9AE5C22859) == 0x000258, "Member 'AWarningTipActor_C::Timeline_1_StartColor_E6BFC4594D062E1A0F141D9AE5C22859' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, Timeline_1__Direction_E6BFC4594D062E1A0F141D9AE5C22859) == 0x00025C, "Member 'AWarningTipActor_C::Timeline_1__Direction_E6BFC4594D062E1A0F141D9AE5C22859' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, Timeline_1) == 0x000260, "Member 'AWarningTipActor_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, Color) == 0x000268, "Member 'AWarningTipActor_C::Color' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, bHide) == 0x000278, "Member 'AWarningTipActor_C::bHide' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, BaseColor01) == 0x00027C, "Member 'AWarningTipActor_C::BaseColor01' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, BaseColor02) == 0x00028C, "Member 'AWarningTipActor_C::BaseColor02' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, Mat1) == 0x0002A0, "Member 'AWarningTipActor_C::Mat1' has a wrong offset!");
static_assert(offsetof(AWarningTipActor_C, Mat2) == 0x0002A8, "Member 'AWarningTipActor_C::Mat2' has a wrong offset!");

}

