#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WarningTipActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WarningTipActor.WarningTipActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct WarningTipActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WarningTipActor_C_ReceiveTick) == 0x000004, "Wrong alignment on WarningTipActor_C_ReceiveTick");
static_assert(sizeof(WarningTipActor_C_ReceiveTick) == 0x000004, "Wrong size on WarningTipActor_C_ReceiveTick");
static_assert(offsetof(WarningTipActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'WarningTipActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function WarningTipActor.WarningTipActor_C.ExecuteUbergraph_WarningTipActor
// 0x0108 (0x0108 - 0x0000)
struct WarningTipActor_C_ExecuteUbergraph_WarningTipActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue_1;                // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue;    // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue_1;  // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue_2;  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Multiply_LinearColorFloat_ReturnValue_3;  // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_7A[0x2];                                       // 0x007A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_AddLocalRotation_SweepHitResult;       // 0x007C(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor) == 0x000008, "Wrong alignment on WarningTipActor_C_ExecuteUbergraph_WarningTipActor");
static_assert(sizeof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor) == 0x000108, "Wrong size on WarningTipActor_C_ExecuteUbergraph_WarningTipActor");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, EntryPoint) == 0x000000, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_GetMaterial_ReturnValue) == 0x000008, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000018, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_GetMaterial_ReturnValue_1) == 0x000020, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_GetMaterial_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000030, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_Multiply_LinearColorFloat_ReturnValue) == 0x000038, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_Multiply_LinearColorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_Multiply_LinearColorFloat_ReturnValue_1) == 0x000048, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_Multiply_LinearColorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_Multiply_LinearColorFloat_ReturnValue_2) == 0x000058, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_Multiply_LinearColorFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_Multiply_LinearColorFloat_ReturnValue_3) == 0x000068, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_Multiply_LinearColorFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_IsValid_ReturnValue_2) == 0x000078, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_IsValid_ReturnValue_3) == 0x000079, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WarningTipActor_C_ExecuteUbergraph_WarningTipActor, CallFunc_K2_AddLocalRotation_SweepHitResult) == 0x00007C, "Member 'WarningTipActor_C_ExecuteUbergraph_WarningTipActor::CallFunc_K2_AddLocalRotation_SweepHitResult' has a wrong offset!");

}

