#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponBase_Bow

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponBase_Bow.WeaponBase_Bow_C
// 0x0100 (0x1C80 - 0x1B80)
class AWeaponBase_Bow_C : public APlayerWeapon_Bow
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 String;                                            // 0x1B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x1B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_timeline2______0_B9FB6C4543529E7C09D3878293298681; // 0x1B98(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Offset_timeline2__Direction_B9FB6C4543529E7C09D3878293298681; // 0x1B9C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B9D[0x3];                                     // 0x1B9D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Offset_timeline2;                                  // 0x1BA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ColorSwitch_timeline1______0_FAE2DE944D19B8E6E55642A12480B730; // 0x1BA8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            ColorSwitch_timeline1__Direction_FAE2DE944D19B8E6E55642A12480B730; // 0x1BAC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BAD[0x3];                                     // 0x1BAD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     ColorSwitch_timeline1;                             // 0x1BB0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Offset_timeline1______0_FC11488A405931097114339ACDCCD45C; // 0x1BB8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Offset_timeline1__Direction_FC11488A405931097114339ACDCCD45C; // 0x1BBC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BBD[0x3];                                     // 0x1BBD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Offset_timeline1;                                  // 0x1BC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Over_Alpha_Time______0_51CDE3EE47416C1CE5507BA4D8B0A639; // 0x1BC8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Over_Alpha_Time__Direction_51CDE3EE47416C1CE5507BA4D8B0A639; // 0x1BCC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BCD[0x3];                                     // 0x1BCD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Over_Alpha_Time;                                   // 0x1BD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         String_timeline1______0_41FF9FC147FBCC59E9E4EBAD2091D694; // 0x1BD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            String_timeline1__Direction_41FF9FC147FBCC59E9E4EBAD2091D694; // 0x1BDC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BDD[0x3];                                     // 0x1BDD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     String_timeline1;                                  // 0x1BE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Arrow1;                                            // 0x1BE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterRenderComponent*              Character_Render_Component;                        // 0x1BF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RenderID;                                          // 0x1BF8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1BFC[0x4];                                     // 0x1BFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftObjectPath                        NoModifierPrefire;                                 // 0x1C00(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         State_ID;                                          // 0x1C18(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C1C[0x4];                                     // 0x1C1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Secondary_Material;                                // 0x1C20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        InTemplatePath;                                    // 0x1C28(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class AGameCharacter*                         AsBase_Character;                                  // 0x1C40(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSoftObjectPath                        InTemplatePath_Character;                          // 0x1C48(0x0018)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UWwiseComponent*                        Prefire_sound;                                     // 0x1C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SetColorValue;                                     // 0x1C68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C6C[0x4];                                     // 0x1C6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFXSystemComponent*                     Prefire_max;                                       // 0x1C70(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         PreheatCounter;                                    // 0x1C78(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         NeedEndFireCount;                                  // 0x1C7C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ChangeColor_CharacterSkin2();
	TArray<struct FSoftObjectPath> OnGetAssetPath(TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs);
	void ChangeColor_CharacterSkin();
	void ChangeColor();
	bool ReceiveShootBullet();
	void String_timeline1__FinishedFunc();
	void String_timeline1__UpdateFunc();
	void Over_Alpha_Time__FinishedFunc();
	void Over_Alpha_Time__UpdateFunc();
	void Offset_timeline1__FinishedFunc();
	void Offset_timeline1__UpdateFunc();
	void ColorSwitch_timeline1__FinishedFunc();
	void ColorSwitch_timeline1__UpdateFunc();
	void Offset_timeline2__FinishedFunc();
	void Offset_timeline2__UpdateFunc();
	void ReceiveTick(float DeltaSeconds);
	void InitArrow();
	void ReceiveBeginPlay();
	void ShowPrefire(int32 Phase);
	void Stop(const class APlayerWeapon* InCurWeapon);
	void ServerEndFire(class APlayerWeapon* Weapon);
	void Shoot(const class APlayerWeapon* InCurWeapon);
	void MulticastEndFire(class APlayerWeapon* Weapon);
	void OnEquipWeapon(class AGameCharacter* Character);
	void ExecuteUbergraph_WeaponBase_Bow(int32 EntryPoint);

	class FString GetModuleName() const;
	class USkeletalMeshComponent* GetBowSkeletalMeshComponent() const;
	bool ReceiveStopFire() const;
	bool ReceiveBreakFire() const;
	bool ReceiveStartReload() const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponBase_Bow_C">();
	}
	static class AWeaponBase_Bow_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeaponBase_Bow_C>();
	}
};
static_assert(alignof(AWeaponBase_Bow_C) == 0x000010, "Wrong alignment on AWeaponBase_Bow_C");
static_assert(sizeof(AWeaponBase_Bow_C) == 0x001C80, "Wrong size on AWeaponBase_Bow_C");
static_assert(offsetof(AWeaponBase_Bow_C, UberGraphFrame) == 0x001B80, "Member 'AWeaponBase_Bow_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, String) == 0x001B88, "Member 'AWeaponBase_Bow_C::String' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, SkeletalMesh) == 0x001B90, "Member 'AWeaponBase_Bow_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Offset_timeline2______0_B9FB6C4543529E7C09D3878293298681) == 0x001B98, "Member 'AWeaponBase_Bow_C::Offset_timeline2______0_B9FB6C4543529E7C09D3878293298681' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Offset_timeline2__Direction_B9FB6C4543529E7C09D3878293298681) == 0x001B9C, "Member 'AWeaponBase_Bow_C::Offset_timeline2__Direction_B9FB6C4543529E7C09D3878293298681' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Offset_timeline2) == 0x001BA0, "Member 'AWeaponBase_Bow_C::Offset_timeline2' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, ColorSwitch_timeline1______0_FAE2DE944D19B8E6E55642A12480B730) == 0x001BA8, "Member 'AWeaponBase_Bow_C::ColorSwitch_timeline1______0_FAE2DE944D19B8E6E55642A12480B730' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, ColorSwitch_timeline1__Direction_FAE2DE944D19B8E6E55642A12480B730) == 0x001BAC, "Member 'AWeaponBase_Bow_C::ColorSwitch_timeline1__Direction_FAE2DE944D19B8E6E55642A12480B730' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, ColorSwitch_timeline1) == 0x001BB0, "Member 'AWeaponBase_Bow_C::ColorSwitch_timeline1' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Offset_timeline1______0_FC11488A405931097114339ACDCCD45C) == 0x001BB8, "Member 'AWeaponBase_Bow_C::Offset_timeline1______0_FC11488A405931097114339ACDCCD45C' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Offset_timeline1__Direction_FC11488A405931097114339ACDCCD45C) == 0x001BBC, "Member 'AWeaponBase_Bow_C::Offset_timeline1__Direction_FC11488A405931097114339ACDCCD45C' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Offset_timeline1) == 0x001BC0, "Member 'AWeaponBase_Bow_C::Offset_timeline1' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Over_Alpha_Time______0_51CDE3EE47416C1CE5507BA4D8B0A639) == 0x001BC8, "Member 'AWeaponBase_Bow_C::Over_Alpha_Time______0_51CDE3EE47416C1CE5507BA4D8B0A639' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Over_Alpha_Time__Direction_51CDE3EE47416C1CE5507BA4D8B0A639) == 0x001BCC, "Member 'AWeaponBase_Bow_C::Over_Alpha_Time__Direction_51CDE3EE47416C1CE5507BA4D8B0A639' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Over_Alpha_Time) == 0x001BD0, "Member 'AWeaponBase_Bow_C::Over_Alpha_Time' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, String_timeline1______0_41FF9FC147FBCC59E9E4EBAD2091D694) == 0x001BD8, "Member 'AWeaponBase_Bow_C::String_timeline1______0_41FF9FC147FBCC59E9E4EBAD2091D694' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, String_timeline1__Direction_41FF9FC147FBCC59E9E4EBAD2091D694) == 0x001BDC, "Member 'AWeaponBase_Bow_C::String_timeline1__Direction_41FF9FC147FBCC59E9E4EBAD2091D694' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, String_timeline1) == 0x001BE0, "Member 'AWeaponBase_Bow_C::String_timeline1' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Arrow1) == 0x001BE8, "Member 'AWeaponBase_Bow_C::Arrow1' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Character_Render_Component) == 0x001BF0, "Member 'AWeaponBase_Bow_C::Character_Render_Component' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, RenderID) == 0x001BF8, "Member 'AWeaponBase_Bow_C::RenderID' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, NoModifierPrefire) == 0x001C00, "Member 'AWeaponBase_Bow_C::NoModifierPrefire' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, State_ID) == 0x001C18, "Member 'AWeaponBase_Bow_C::State_ID' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Secondary_Material) == 0x001C20, "Member 'AWeaponBase_Bow_C::Secondary_Material' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, InTemplatePath) == 0x001C28, "Member 'AWeaponBase_Bow_C::InTemplatePath' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, AsBase_Character) == 0x001C40, "Member 'AWeaponBase_Bow_C::AsBase_Character' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, InTemplatePath_Character) == 0x001C48, "Member 'AWeaponBase_Bow_C::InTemplatePath_Character' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Prefire_sound) == 0x001C60, "Member 'AWeaponBase_Bow_C::Prefire_sound' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, SetColorValue) == 0x001C68, "Member 'AWeaponBase_Bow_C::SetColorValue' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, Prefire_max) == 0x001C70, "Member 'AWeaponBase_Bow_C::Prefire_max' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, PreheatCounter) == 0x001C78, "Member 'AWeaponBase_Bow_C::PreheatCounter' has a wrong offset!");
static_assert(offsetof(AWeaponBase_Bow_C, NeedEndFireCount) == 0x001C7C, "Member 'AWeaponBase_Bow_C::NeedEndFireCount' has a wrong offset!");

}

