#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponFireBullet2MeModifier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponFireBullet2MeModifier.WeaponFireBullet2MeModifier_C
// 0x0010 (0x00E8 - 0x00D8)
class UWeaponFireBullet2MeModifier_C final : public UModifierSpecialEffectObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ModifierID;                                        // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EModifierExecEmitterType                      LauncherType;                                      // 0x00E4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info);
	void ReceiveOnWeaponFire(uint8 ForceShootCount);
	void ExecuteUbergraph_WeaponFireBullet2MeModifier(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponFireBullet2MeModifier_C">();
	}
	static class UWeaponFireBullet2MeModifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponFireBullet2MeModifier_C>();
	}
};
static_assert(alignof(UWeaponFireBullet2MeModifier_C) == 0x000008, "Wrong alignment on UWeaponFireBullet2MeModifier_C");
static_assert(sizeof(UWeaponFireBullet2MeModifier_C) == 0x0000E8, "Wrong size on UWeaponFireBullet2MeModifier_C");
static_assert(offsetof(UWeaponFireBullet2MeModifier_C, UberGraphFrame) == 0x0000D8, "Member 'UWeaponFireBullet2MeModifier_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponFireBullet2MeModifier_C, ModifierID) == 0x0000E0, "Member 'UWeaponFireBullet2MeModifier_C::ModifierID' has a wrong offset!");
static_assert(offsetof(UWeaponFireBullet2MeModifier_C, LauncherType) == 0x0000E4, "Member 'UWeaponFireBullet2MeModifier_C::LauncherType' has a wrong offset!");

}

