#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponBulletHoming

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponBulletHoming.WeaponBulletHoming_C
// 0x0020 (0x00F8 - 0x00D8)
class UWeaponBulletHoming_C final : public UModifierSpecialEffectObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UClass*                                 Buffer;                                            // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameAbilityBuffer*                     NoBulletBuffer;                                    // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EmitterID;                                         // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsTryHitOnlyTarget;                                // 0x00F4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsStartHitFromCamera;                              // 0x00F5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void SetEmitterID(bool bRemove);
	void AddBuffer(bool bAdd);
	void IsActive(bool* bActive);
	void K2_ReceiveActive();
	void K2_ReceiveDeActive();
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info);
	void ReceiveOnWeaponFire(uint8 ForceShootCount);
	void K2_OnNotifyActiveChanged(bool bNewActive);
	void ExecuteUbergraph_WeaponBulletHoming(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponBulletHoming_C">();
	}
	static class UWeaponBulletHoming_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponBulletHoming_C>();
	}
};
static_assert(alignof(UWeaponBulletHoming_C) == 0x000008, "Wrong alignment on UWeaponBulletHoming_C");
static_assert(sizeof(UWeaponBulletHoming_C) == 0x0000F8, "Wrong size on UWeaponBulletHoming_C");
static_assert(offsetof(UWeaponBulletHoming_C, UberGraphFrame) == 0x0000D8, "Member 'UWeaponBulletHoming_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponBulletHoming_C, Buffer) == 0x0000E0, "Member 'UWeaponBulletHoming_C::Buffer' has a wrong offset!");
static_assert(offsetof(UWeaponBulletHoming_C, NoBulletBuffer) == 0x0000E8, "Member 'UWeaponBulletHoming_C::NoBulletBuffer' has a wrong offset!");
static_assert(offsetof(UWeaponBulletHoming_C, EmitterID) == 0x0000F0, "Member 'UWeaponBulletHoming_C::EmitterID' has a wrong offset!");
static_assert(offsetof(UWeaponBulletHoming_C, IsTryHitOnlyTarget) == 0x0000F4, "Member 'UWeaponBulletHoming_C::IsTryHitOnlyTarget' has a wrong offset!");
static_assert(offsetof(UWeaponBulletHoming_C, IsStartHitFromCamera) == 0x0000F5, "Member 'UWeaponBulletHoming_C::IsStartHitFromCamera' has a wrong offset!");

}

