#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function WeaponBase.WeaponBase_C.ReceiveShootBullet
// 0x0030 (0x0030 - 0x0000)
struct WeaponBase_C_ReceiveShootBullet final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInSkill_ReturnValue;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReceiveShootBullet_ReturnValue;           // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimInstance*                          CallFunc_GetGameAnimInstance_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGameCharacterAnimInstance*             K2Node_DynamicCast_AsGame_Character_Anim_Instance; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameNPCAnimInstance*                   K2Node_DynamicCast_AsGame_NPCAnim_Instance;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBase_C_ReceiveShootBullet) == 0x000008, "Wrong alignment on WeaponBase_C_ReceiveShootBullet");
static_assert(sizeof(WeaponBase_C_ReceiveShootBullet) == 0x000030, "Wrong size on WeaponBase_C_ReceiveShootBullet");
static_assert(offsetof(WeaponBase_C_ReceiveShootBullet, ReturnValue) == 0x000000, "Member 'WeaponBase_C_ReceiveShootBullet::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveShootBullet, CallFunc_IsInSkill_ReturnValue) == 0x000001, "Member 'WeaponBase_C_ReceiveShootBullet::CallFunc_IsInSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveShootBullet, CallFunc_ReceiveShootBullet_ReturnValue) == 0x000002, "Member 'WeaponBase_C_ReceiveShootBullet::CallFunc_ReceiveShootBullet_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveShootBullet, CallFunc_GetGameAnimInstance_ReturnValue) == 0x000008, "Member 'WeaponBase_C_ReceiveShootBullet::CallFunc_GetGameAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveShootBullet, K2Node_DynamicCast_AsGame_Character_Anim_Instance) == 0x000010, "Member 'WeaponBase_C_ReceiveShootBullet::K2Node_DynamicCast_AsGame_Character_Anim_Instance' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveShootBullet, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WeaponBase_C_ReceiveShootBullet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveShootBullet, K2Node_DynamicCast_AsGame_NPCAnim_Instance) == 0x000020, "Member 'WeaponBase_C_ReceiveShootBullet::K2Node_DynamicCast_AsGame_NPCAnim_Instance' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveShootBullet, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WeaponBase_C_ReceiveShootBullet::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WeaponBase.WeaponBase_C.ReceiveStopFire
// 0x0001 (0x0001 - 0x0000)
struct WeaponBase_C_ReceiveStopFire final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBase_C_ReceiveStopFire) == 0x000001, "Wrong alignment on WeaponBase_C_ReceiveStopFire");
static_assert(sizeof(WeaponBase_C_ReceiveStopFire) == 0x000001, "Wrong size on WeaponBase_C_ReceiveStopFire");
static_assert(offsetof(WeaponBase_C_ReceiveStopFire, ReturnValue) == 0x000000, "Member 'WeaponBase_C_ReceiveStopFire::ReturnValue' has a wrong offset!");

// Function WeaponBase.WeaponBase_C.ReceiveBreakFire
// 0x0004 (0x0004 - 0x0000)
struct WeaponBase_C_ReceiveBreakFire final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         CallFunc_MakeLiteralByte_ReturnValue;              // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         CallFunc_GetCurrentStateId_ReturnValue;            // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBase_C_ReceiveBreakFire) == 0x000001, "Wrong alignment on WeaponBase_C_ReceiveBreakFire");
static_assert(sizeof(WeaponBase_C_ReceiveBreakFire) == 0x000004, "Wrong size on WeaponBase_C_ReceiveBreakFire");
static_assert(offsetof(WeaponBase_C_ReceiveBreakFire, ReturnValue) == 0x000000, "Member 'WeaponBase_C_ReceiveBreakFire::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveBreakFire, CallFunc_MakeLiteralByte_ReturnValue) == 0x000001, "Member 'WeaponBase_C_ReceiveBreakFire::CallFunc_MakeLiteralByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveBreakFire, CallFunc_GetCurrentStateId_ReturnValue) == 0x000002, "Member 'WeaponBase_C_ReceiveBreakFire::CallFunc_GetCurrentStateId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveBreakFire, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000003, "Member 'WeaponBase_C_ReceiveBreakFire::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WeaponBase.WeaponBase_C.ReceiveStartReload
// 0x0002 (0x0002 - 0x0000)
struct WeaponBase_C_ReceiveStartReload final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CallOwnerSMReceiveStartReload_ReturnValue; // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBase_C_ReceiveStartReload) == 0x000001, "Wrong alignment on WeaponBase_C_ReceiveStartReload");
static_assert(sizeof(WeaponBase_C_ReceiveStartReload) == 0x000002, "Wrong size on WeaponBase_C_ReceiveStartReload");
static_assert(offsetof(WeaponBase_C_ReceiveStartReload, ReturnValue) == 0x000000, "Member 'WeaponBase_C_ReceiveStartReload::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBase_C_ReceiveStartReload, CallFunc_CallOwnerSMReceiveStartReload_ReturnValue) == 0x000001, "Member 'WeaponBase_C_ReceiveStartReload::CallFunc_CallOwnerSMReceiveStartReload_ReturnValue' has a wrong offset!");

}

