#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponBulletHit2MeModifier

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponBulletHit2MeModifier.WeaponBulletHit2MeModifier_C
// 0x0068 (0x0140 - 0x00D8)
class UWeaponBulletHit2MeModifier_C final : public UModifierSpecialEffectObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         ModifierIdBeforeDamage;                            // 0x00E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ModifierIdAfterDamage;                             // 0x00E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EModifierExecEmitterType                      LauncherType;                                      // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OneShootAddOne;                                    // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x6];                                       // 0x00EA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UAbilityComponentBase*, int32>     CacheTarget;                                       // 0x00F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)

public:
	void CheckFireTime(class UAbilityComponentBase* Target, int32 FireID, bool* bAdd);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info);
	void K2_BulletHitTarger(class UAbilityComponentBase* InTarget, const struct FVector& ApplyLocation, const struct FQueryResult& Result, bool bBeforeDamage, int32 FireTimeId);
	void K2_ReceiveDeActive();
	void ExecuteUbergraph_WeaponBulletHit2MeModifier(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponBulletHit2MeModifier_C">();
	}
	static class UWeaponBulletHit2MeModifier_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponBulletHit2MeModifier_C>();
	}
};
static_assert(alignof(UWeaponBulletHit2MeModifier_C) == 0x000008, "Wrong alignment on UWeaponBulletHit2MeModifier_C");
static_assert(sizeof(UWeaponBulletHit2MeModifier_C) == 0x000140, "Wrong size on UWeaponBulletHit2MeModifier_C");
static_assert(offsetof(UWeaponBulletHit2MeModifier_C, UberGraphFrame) == 0x0000D8, "Member 'UWeaponBulletHit2MeModifier_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponBulletHit2MeModifier_C, ModifierIdBeforeDamage) == 0x0000E0, "Member 'UWeaponBulletHit2MeModifier_C::ModifierIdBeforeDamage' has a wrong offset!");
static_assert(offsetof(UWeaponBulletHit2MeModifier_C, ModifierIdAfterDamage) == 0x0000E4, "Member 'UWeaponBulletHit2MeModifier_C::ModifierIdAfterDamage' has a wrong offset!");
static_assert(offsetof(UWeaponBulletHit2MeModifier_C, LauncherType) == 0x0000E8, "Member 'UWeaponBulletHit2MeModifier_C::LauncherType' has a wrong offset!");
static_assert(offsetof(UWeaponBulletHit2MeModifier_C, OneShootAddOne) == 0x0000E9, "Member 'UWeaponBulletHit2MeModifier_C::OneShootAddOne' has a wrong offset!");
static_assert(offsetof(UWeaponBulletHit2MeModifier_C, CacheTarget) == 0x0000F0, "Member 'UWeaponBulletHit2MeModifier_C::CacheTarget' has a wrong offset!");

}

