#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponBulletEnchanting

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WeaponBulletEnchanting.WeaponBulletEnchanting_C.OnGetAssetPath
// 0x0088 (0x0088 - 0x0000)
struct WeaponBulletEnchanting_C_OnGetAssetPath final
{
public:
	TArray<struct FParamInfo>                     InParams;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CharacterIDs;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FSoftObjectPath>                OutPaths;                                          // 0x0060(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParamintValue_ReturnValue_1;           // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FSoftObjectPath>                CallFunc_GetBulletEnchantIDAssetPath_Paths;        // 0x0078(0x0010)(ReferenceParm)
};
static_assert(alignof(WeaponBulletEnchanting_C_OnGetAssetPath) == 0x000008, "Wrong alignment on WeaponBulletEnchanting_C_OnGetAssetPath");
static_assert(sizeof(WeaponBulletEnchanting_C_OnGetAssetPath) == 0x000088, "Wrong size on WeaponBulletEnchanting_C_OnGetAssetPath");
static_assert(offsetof(WeaponBulletEnchanting_C_OnGetAssetPath, InParams) == 0x000000, "Member 'WeaponBulletEnchanting_C_OnGetAssetPath::InParams' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_OnGetAssetPath, CharacterIDs) == 0x000010, "Member 'WeaponBulletEnchanting_C_OnGetAssetPath::CharacterIDs' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_OnGetAssetPath, SkillIDs) == 0x000020, "Member 'WeaponBulletEnchanting_C_OnGetAssetPath::SkillIDs' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_OnGetAssetPath, ModifierIDs) == 0x000030, "Member 'WeaponBulletEnchanting_C_OnGetAssetPath::ModifierIDs' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_OnGetAssetPath, EmitterIDs) == 0x000040, "Member 'WeaponBulletEnchanting_C_OnGetAssetPath::EmitterIDs' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_OnGetAssetPath, ReturnValue) == 0x000050, "Member 'WeaponBulletEnchanting_C_OnGetAssetPath::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_OnGetAssetPath, OutPaths) == 0x000060, "Member 'WeaponBulletEnchanting_C_OnGetAssetPath::OutPaths' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_OnGetAssetPath, CallFunc_GetParamintValue_ReturnValue) == 0x000070, "Member 'WeaponBulletEnchanting_C_OnGetAssetPath::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_OnGetAssetPath, CallFunc_GetParamintValue_ReturnValue_1) == 0x000074, "Member 'WeaponBulletEnchanting_C_OnGetAssetPath::CallFunc_GetParamintValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_OnGetAssetPath, CallFunc_GetBulletEnchantIDAssetPath_Paths) == 0x000078, "Member 'WeaponBulletEnchanting_C_OnGetAssetPath::CallFunc_GetBulletEnchantIDAssetPath_Paths' has a wrong offset!");

// Function WeaponBulletEnchanting.WeaponBulletEnchanting_C.IsActive
// 0x0003 (0x0003 - 0x0000)
struct WeaponBulletEnchanting_C_IsActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveEffect_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBulletEnchanting_C_IsActive) == 0x000001, "Wrong alignment on WeaponBulletEnchanting_C_IsActive");
static_assert(sizeof(WeaponBulletEnchanting_C_IsActive) == 0x000003, "Wrong size on WeaponBulletEnchanting_C_IsActive");
static_assert(offsetof(WeaponBulletEnchanting_C_IsActive, bActive) == 0x000000, "Member 'WeaponBulletEnchanting_C_IsActive::bActive' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_IsActive, CallFunc_IsActiveEffect_ReturnValue) == 0x000001, "Member 'WeaponBulletEnchanting_C_IsActive::CallFunc_IsActiveEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_IsActive, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'WeaponBulletEnchanting_C_IsActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WeaponBulletEnchanting.WeaponBulletEnchanting_C.Change Weapon Temp Bullet
// 0x0030 (0x0030 - 0x0000)
struct WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet final
{
public:
	bool                                          bAdd;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABaseCharacter_C*                       K2Node_DynamicCast_AsBase_Character_1;             // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet) == 0x000008, "Wrong alignment on WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet");
static_assert(sizeof(WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet) == 0x000030, "Wrong size on WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet");
static_assert(offsetof(WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet, bAdd) == 0x000000, "Member 'WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet::bAdd' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000001, "Member 'WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet, CallFunc_GetOriginCharacter_ReturnValue) == 0x000008, "Member 'WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet::CallFunc_GetOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet, K2Node_DynamicCast_AsBase_Character) == 0x000010, "Member 'WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet::K2Node_DynamicCast_AsBase_Character' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet, K2Node_DynamicCast_AsBase_Character_1) == 0x000020, "Member 'WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet::K2Node_DynamicCast_AsBase_Character_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'WeaponBulletEnchanting_C_Change_Weapon_Temp_Bullet::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WeaponBulletEnchanting.WeaponBulletEnchanting_C.K2_ReceiveInitialize
// 0x0010 (0x0010 - 0x0000)
struct WeaponBulletEnchanting_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WeaponBulletEnchanting_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on WeaponBulletEnchanting_C_K2_ReceiveInitialize");
static_assert(sizeof(WeaponBulletEnchanting_C_K2_ReceiveInitialize) == 0x000010, "Wrong size on WeaponBulletEnchanting_C_K2_ReceiveInitialize");
static_assert(offsetof(WeaponBulletEnchanting_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'WeaponBulletEnchanting_C_K2_ReceiveInitialize::Info' has a wrong offset!");

// Function WeaponBulletEnchanting.WeaponBulletEnchanting_C.K2_OnNotifyActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct WeaponBulletEnchanting_C_K2_OnNotifyActiveChanged final
{
public:
	bool                                          bNewActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBulletEnchanting_C_K2_OnNotifyActiveChanged) == 0x000001, "Wrong alignment on WeaponBulletEnchanting_C_K2_OnNotifyActiveChanged");
static_assert(sizeof(WeaponBulletEnchanting_C_K2_OnNotifyActiveChanged) == 0x000001, "Wrong size on WeaponBulletEnchanting_C_K2_OnNotifyActiveChanged");
static_assert(offsetof(WeaponBulletEnchanting_C_K2_OnNotifyActiveChanged, bNewActive) == 0x000000, "Member 'WeaponBulletEnchanting_C_K2_OnNotifyActiveChanged::bNewActive' has a wrong offset!");

// Function WeaponBulletEnchanting.WeaponBulletEnchanting_C.ReceiveOnPreWeaponFire
// 0x0001 (0x0001 - 0x0000)
struct WeaponBulletEnchanting_C_ReceiveOnPreWeaponFire final
{
public:
	EAttributeType                                BulletType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponBulletEnchanting_C_ReceiveOnPreWeaponFire) == 0x000001, "Wrong alignment on WeaponBulletEnchanting_C_ReceiveOnPreWeaponFire");
static_assert(sizeof(WeaponBulletEnchanting_C_ReceiveOnPreWeaponFire) == 0x000001, "Wrong size on WeaponBulletEnchanting_C_ReceiveOnPreWeaponFire");
static_assert(offsetof(WeaponBulletEnchanting_C_ReceiveOnPreWeaponFire, BulletType) == 0x000000, "Member 'WeaponBulletEnchanting_C_ReceiveOnPreWeaponFire::BulletType' has a wrong offset!");

// Function WeaponBulletEnchanting.WeaponBulletEnchanting_C.ExecuteUbergraph_WeaponBulletEnchanting
// 0x0030 (0x0030 - 0x0000)
struct WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EAttributeType                                K2Node_Event_BulletType;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParamintValue_ReturnValue_1;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_bActive;                         // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_bActive_1;                       // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewActive;                           // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting) == 0x000008, "Wrong alignment on WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting");
static_assert(sizeof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting) == 0x000030, "Wrong size on WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, EntryPoint) == 0x000000, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, K2Node_Event_BulletType) == 0x000004, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::K2Node_Event_BulletType' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, K2Node_Event_Info) == 0x000008, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, CallFunc_GetParamboolValue_ReturnValue) == 0x00001C, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, CallFunc_GetParamintValue_ReturnValue) == 0x000020, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, CallFunc_GetParamintValue_ReturnValue_1) == 0x000024, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::CallFunc_GetParamintValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, CallFunc_IsActive_bActive) == 0x000028, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::CallFunc_IsActive_bActive' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, CallFunc_IsActive_bActive_1) == 0x000029, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::CallFunc_IsActive_bActive_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting, K2Node_Event_bNewActive) == 0x00002A, "Member 'WeaponBulletEnchanting_C_ExecuteUbergraph_WeaponBulletEnchanting::K2Node_Event_bNewActive' has a wrong offset!");

// Function WeaponBulletEnchanting.WeaponBulletEnchanting_C.CheckCondition
// 0x0018 (0x0018 - 0x0000)
struct WeaponBulletEnchanting_C_CheckCondition final
{
public:
	class UAbilityComponentBase*                  WeaponAbility;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRolePropertieValue_ReturnValue;        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBulletEnchanting_C_CheckCondition) == 0x000008, "Wrong alignment on WeaponBulletEnchanting_C_CheckCondition");
static_assert(sizeof(WeaponBulletEnchanting_C_CheckCondition) == 0x000018, "Wrong size on WeaponBulletEnchanting_C_CheckCondition");
static_assert(offsetof(WeaponBulletEnchanting_C_CheckCondition, WeaponAbility) == 0x000000, "Member 'WeaponBulletEnchanting_C_CheckCondition::WeaponAbility' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_CheckCondition, ReturnValue) == 0x000008, "Member 'WeaponBulletEnchanting_C_CheckCondition::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_CheckCondition, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WeaponBulletEnchanting_C_CheckCondition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_CheckCondition, CallFunc_GetRolePropertieValue_ReturnValue) == 0x00000C, "Member 'WeaponBulletEnchanting_C_CheckCondition::CallFunc_GetRolePropertieValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletEnchanting_C_CheckCondition, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000010, "Member 'WeaponBulletEnchanting_C_CheckCondition::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

