#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponBulletHoming

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function WeaponBulletHoming.WeaponBulletHoming_C.SetEmitterID
// 0x0020 (0x0020 - 0x0000)
struct WeaponBulletHoming_C_SetEmitterID final
{
public:
	bool                                          bRemove;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetWeapon_ReturnValue;                    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponBulletHoming_C_SetEmitterID) == 0x000008, "Wrong alignment on WeaponBulletHoming_C_SetEmitterID");
static_assert(sizeof(WeaponBulletHoming_C_SetEmitterID) == 0x000020, "Wrong size on WeaponBulletHoming_C_SetEmitterID");
static_assert(offsetof(WeaponBulletHoming_C_SetEmitterID, bRemove) == 0x000000, "Member 'WeaponBulletHoming_C_SetEmitterID::bRemove' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_SetEmitterID, CallFunc_GetOriginCharacter_ReturnValue) == 0x000008, "Member 'WeaponBulletHoming_C_SetEmitterID::CallFunc_GetOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_SetEmitterID, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WeaponBulletHoming_C_SetEmitterID::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_SetEmitterID, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WeaponBulletHoming_C_SetEmitterID::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_SetEmitterID, CallFunc_GetWeapon_ReturnValue) == 0x000018, "Member 'WeaponBulletHoming_C_SetEmitterID::CallFunc_GetWeapon_ReturnValue' has a wrong offset!");

// Function WeaponBulletHoming.WeaponBulletHoming_C.AddBuffer
// 0x0030 (0x0030 - 0x0000)
struct WeaponBulletHoming_C_AddBuffer final
{
public:
	bool                                          bAdd;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     ParamInfos;                                        // 0x0008(0x0010)(Edit, BlueprintVisible)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameAbilityBuffer*                     CallFunc_ActiveAbilityBuffer_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBulletHoming_C_AddBuffer) == 0x000008, "Wrong alignment on WeaponBulletHoming_C_AddBuffer");
static_assert(sizeof(WeaponBulletHoming_C_AddBuffer) == 0x000030, "Wrong size on WeaponBulletHoming_C_AddBuffer");
static_assert(offsetof(WeaponBulletHoming_C_AddBuffer, bAdd) == 0x000000, "Member 'WeaponBulletHoming_C_AddBuffer::bAdd' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_AddBuffer, ParamInfos) == 0x000008, "Member 'WeaponBulletHoming_C_AddBuffer::ParamInfos' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_AddBuffer, CallFunc_IsValid_ReturnValue) == 0x000018, "Member 'WeaponBulletHoming_C_AddBuffer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_AddBuffer, CallFunc_IsValid_ReturnValue_1) == 0x000019, "Member 'WeaponBulletHoming_C_AddBuffer::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_AddBuffer, CallFunc_ActiveAbilityBuffer_ReturnValue) == 0x000020, "Member 'WeaponBulletHoming_C_AddBuffer::CallFunc_ActiveAbilityBuffer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_AddBuffer, CallFunc_IsValid_ReturnValue_2) == 0x000028, "Member 'WeaponBulletHoming_C_AddBuffer::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WeaponBulletHoming.WeaponBulletHoming_C.IsActive
// 0x0003 (0x0003 - 0x0000)
struct WeaponBulletHoming_C_IsActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveEffect_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBulletHoming_C_IsActive) == 0x000001, "Wrong alignment on WeaponBulletHoming_C_IsActive");
static_assert(sizeof(WeaponBulletHoming_C_IsActive) == 0x000003, "Wrong size on WeaponBulletHoming_C_IsActive");
static_assert(offsetof(WeaponBulletHoming_C_IsActive, bActive) == 0x000000, "Member 'WeaponBulletHoming_C_IsActive::bActive' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_IsActive, CallFunc_IsActiveEffect_ReturnValue) == 0x000001, "Member 'WeaponBulletHoming_C_IsActive::CallFunc_IsActiveEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_IsActive, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'WeaponBulletHoming_C_IsActive::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WeaponBulletHoming.WeaponBulletHoming_C.K2_ReceiveInitialize
// 0x0010 (0x0010 - 0x0000)
struct WeaponBulletHoming_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WeaponBulletHoming_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on WeaponBulletHoming_C_K2_ReceiveInitialize");
static_assert(sizeof(WeaponBulletHoming_C_K2_ReceiveInitialize) == 0x000010, "Wrong size on WeaponBulletHoming_C_K2_ReceiveInitialize");
static_assert(offsetof(WeaponBulletHoming_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'WeaponBulletHoming_C_K2_ReceiveInitialize::Info' has a wrong offset!");

// Function WeaponBulletHoming.WeaponBulletHoming_C.ReceiveOnWeaponFire
// 0x0001 (0x0001 - 0x0000)
struct WeaponBulletHoming_C_ReceiveOnWeaponFire final
{
public:
	uint8                                         ForceShootCount;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponBulletHoming_C_ReceiveOnWeaponFire) == 0x000001, "Wrong alignment on WeaponBulletHoming_C_ReceiveOnWeaponFire");
static_assert(sizeof(WeaponBulletHoming_C_ReceiveOnWeaponFire) == 0x000001, "Wrong size on WeaponBulletHoming_C_ReceiveOnWeaponFire");
static_assert(offsetof(WeaponBulletHoming_C_ReceiveOnWeaponFire, ForceShootCount) == 0x000000, "Member 'WeaponBulletHoming_C_ReceiveOnWeaponFire::ForceShootCount' has a wrong offset!");

// Function WeaponBulletHoming.WeaponBulletHoming_C.K2_OnNotifyActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct WeaponBulletHoming_C_K2_OnNotifyActiveChanged final
{
public:
	bool                                          bNewActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBulletHoming_C_K2_OnNotifyActiveChanged) == 0x000001, "Wrong alignment on WeaponBulletHoming_C_K2_OnNotifyActiveChanged");
static_assert(sizeof(WeaponBulletHoming_C_K2_OnNotifyActiveChanged) == 0x000001, "Wrong size on WeaponBulletHoming_C_K2_OnNotifyActiveChanged");
static_assert(offsetof(WeaponBulletHoming_C_K2_OnNotifyActiveChanged, bNewActive) == 0x000000, "Member 'WeaponBulletHoming_C_K2_OnNotifyActiveChanged::bNewActive' has a wrong offset!");

// Function WeaponBulletHoming.WeaponBulletHoming_C.ExecuteUbergraph_WeaponBulletHoming
// 0x0038 (0x0038 - 0x0000)
struct WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue_1;          // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_26[0x2];                                       // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_bActive;                         // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActive_bActive_1;                       // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         K2Node_Event_ForceShootCount;                      // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bNewActive;                           // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming) == 0x000008, "Wrong alignment on WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming");
static_assert(sizeof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming) == 0x000038, "Wrong size on WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, EntryPoint) == 0x000000, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, K2Node_Event_Info) == 0x000008, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, CallFunc_GetParamboolValue_ReturnValue) == 0x00001C, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, CallFunc_GetParamboolValue_ReturnValue_1) == 0x000024, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::CallFunc_GetParamboolValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000025, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, CallFunc_GetParamintValue_ReturnValue) == 0x000028, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, CallFunc_IsActive_bActive) == 0x00002C, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::CallFunc_IsActive_bActive' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, CallFunc_IsActive_bActive_1) == 0x00002D, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::CallFunc_IsActive_bActive_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, K2Node_Event_ForceShootCount) == 0x00002E, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::K2Node_Event_ForceShootCount' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, K2Node_Event_bNewActive) == 0x00002F, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::K2Node_Event_bNewActive' has a wrong offset!");
static_assert(offsetof(WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming, CallFunc_Not_PreBool_ReturnValue) == 0x000030, "Member 'WeaponBulletHoming_C_ExecuteUbergraph_WeaponBulletHoming::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

