#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponFireApplyEmitter

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WeaponFireApplyEmitter.WeaponFireApplyEmitter_C.OnGetAssetPath
// 0x0088 (0x0088 - 0x0000)
struct WeaponFireApplyEmitter_C_OnGetAssetPath final
{
public:
	TArray<struct FParamInfo>                     InParams;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CharacterIDs;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm)
	TArray<int32>                                 TrapIDs;                                           // 0x0060(0x0010)(Edit, BlueprintVisible)
	TArray<struct FSoftObjectPath>                OutAssetpath;                                      // 0x0070(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeaponFireApplyEmitter_C_OnGetAssetPath;

// Function WeaponFireApplyEmitter.WeaponFireApplyEmitter_C.K2_ReceiveInitialize
// 0x0010 (0x0010 - 0x0000)
struct WeaponFireApplyEmitter_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
DUMPER7_ASSERTS_WeaponFireApplyEmitter_C_K2_ReceiveInitialize;

// Function WeaponFireApplyEmitter.WeaponFireApplyEmitter_C.ReceiveOnWeaponFire
// 0x0001 (0x0001 - 0x0000)
struct WeaponFireApplyEmitter_C_ReceiveOnWeaponFire final
{
public:
	uint8                                         ForceShootCount;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WeaponFireApplyEmitter_C_ReceiveOnWeaponFire;

// Function WeaponFireApplyEmitter.WeaponFireApplyEmitter_C.ExecuteUbergraph_WeaponFireApplyEmitter
// 0x0020 (0x0020 - 0x0000)
struct WeaponFireApplyEmitter_C_ExecuteUbergraph_WeaponFireApplyEmitter final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_ForceShootCount;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActive_bActive;                         // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WeaponFireApplyEmitter_C_ExecuteUbergraph_WeaponFireApplyEmitter;

// Function WeaponFireApplyEmitter.WeaponFireApplyEmitter_C.IsActive
// 0x0003 (0x0003 - 0x0000)
struct WeaponFireApplyEmitter_C_IsActive final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveEffect_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WeaponFireApplyEmitter_C_IsActive;

}

