#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponSpawnHomingBullet

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WeaponSpawnHomingBullet.WeaponSpawnHomingBullet_C.OnGetAssetPath
// 0x0098 (0x0098 - 0x0000)
struct WeaponSpawnHomingBullet_C_OnGetAssetPath final
{
public:
	TArray<struct FParamInfo>                     InParams;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 CharacterIDs;                                      // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 SkillIDs;                                          // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 ModifierIDs;                                       // 0x0030(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<int32>                                 EmitterIDs;                                        // 0x0040(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	TArray<struct FSoftObjectPath>                ReturnValue;                                       // 0x0050(0x0010)(Parm, OutParm, ReturnParm)
	TArray<struct FSoftObjectPath>                OutPath;                                           // 0x0060(0x0010)(Edit, BlueprintVisible)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSoftClassPath                         CallFunc_MakeSoftClassPath_ReturnValue;            // 0x0078(0x0018)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponSpawnHomingBullet_C_OnGetAssetPath) == 0x000008, "Wrong alignment on WeaponSpawnHomingBullet_C_OnGetAssetPath");
static_assert(sizeof(WeaponSpawnHomingBullet_C_OnGetAssetPath) == 0x000098, "Wrong size on WeaponSpawnHomingBullet_C_OnGetAssetPath");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, InParams) == 0x000000, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::InParams' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, CharacterIDs) == 0x000010, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::CharacterIDs' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, SkillIDs) == 0x000020, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::SkillIDs' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, ModifierIDs) == 0x000030, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::ModifierIDs' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, EmitterIDs) == 0x000040, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::EmitterIDs' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, ReturnValue) == 0x000050, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, OutPath) == 0x000060, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::OutPath' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, CallFunc_Greater_IntInt_ReturnValue) == 0x000074, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, CallFunc_MakeSoftClassPath_ReturnValue) == 0x000078, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::CallFunc_MakeSoftClassPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_OnGetAssetPath, CallFunc_Array_Add_ReturnValue) == 0x000090, "Member 'WeaponSpawnHomingBullet_C_OnGetAssetPath::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WeaponSpawnHomingBullet.WeaponSpawnHomingBullet_C.K2_ReceiveInitialize
// 0x0010 (0x0010 - 0x0000)
struct WeaponSpawnHomingBullet_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WeaponSpawnHomingBullet_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on WeaponSpawnHomingBullet_C_K2_ReceiveInitialize");
static_assert(sizeof(WeaponSpawnHomingBullet_C_K2_ReceiveInitialize) == 0x000010, "Wrong size on WeaponSpawnHomingBullet_C_K2_ReceiveInitialize");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'WeaponSpawnHomingBullet_C_K2_ReceiveInitialize::Info' has a wrong offset!");

// Function WeaponSpawnHomingBullet.WeaponSpawnHomingBullet_C.ExecuteUbergraph_WeaponSpawnHomingBullet
// 0x0040 (0x0040 - 0x0000)
struct WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetParamfloatValue_ReturnValue;           // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet) == 0x000008, "Wrong alignment on WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet");
static_assert(sizeof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet) == 0x000040, "Wrong size on WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, EntryPoint) == 0x000000, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, K2Node_Event_Info) == 0x000008, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_GetParamintValue_ReturnValue) == 0x000018, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_Greater_IntInt_ReturnValue) == 0x000020, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_GetParamfloatValue_ReturnValue) == 0x000024, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_GetParamfloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_Array_Length_ReturnValue_1) == 0x000028, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00002C, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_GetParamboolValue_ReturnValue) == 0x00002D, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_Array_Length_ReturnValue_2) == 0x000030, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_Array_Length_ReturnValue_3) == 0x000034, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000038, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet, CallFunc_Greater_IntInt_ReturnValue_3) == 0x000039, "Member 'WeaponSpawnHomingBullet_C_ExecuteUbergraph_WeaponSpawnHomingBullet::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");

// Function WeaponSpawnHomingBullet.WeaponSpawnHomingBullet_C.K2_WeaponSpawnSpecialBullet
// 0x0058 (0x0058 - 0x0000)
struct WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet final
{
public:
	class AActor*                                 LpOwner;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWeaponAbiliityComponent*               AccessoryAbility;                                  // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NStartPosition;                                    // 0x0010(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NShootDirection;                                   // 0x001C(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         BulletID;                                          // 0x0028(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AFireBullet*                            ReturnValue;                                       // 0x0030(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFireBullet*                            CallFunc_FireSpawnDeferred_ReturnValue;            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeawponSpecialHomingBulletBase_C*      K2Node_DynamicCast_AsWeawpon_Special_Homing_Bullet_Base; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet) == 0x000008, "Wrong alignment on WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet");
static_assert(sizeof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet) == 0x000058, "Wrong size on WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet, LpOwner) == 0x000000, "Member 'WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet::LpOwner' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet, AccessoryAbility) == 0x000008, "Member 'WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet::AccessoryAbility' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet, NStartPosition) == 0x000010, "Member 'WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet::NStartPosition' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet, NShootDirection) == 0x00001C, "Member 'WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet::NShootDirection' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet, BulletID) == 0x000028, "Member 'WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet::BulletID' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet, ReturnValue) == 0x000030, "Member 'WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet::ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet, CallFunc_FireSpawnDeferred_ReturnValue) == 0x000038, "Member 'WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet::CallFunc_FireSpawnDeferred_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet, K2Node_DynamicCast_AsWeawpon_Special_Homing_Bullet_Base) == 0x000048, "Member 'WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet::K2Node_DynamicCast_AsWeawpon_Special_Homing_Bullet_Base' has a wrong offset!");
static_assert(offsetof(WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'WeaponSpawnHomingBullet_C_K2_WeaponSpawnSpecialBullet::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

