#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponBulletHit2MeModifier

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WeaponBulletHit2MeModifier.WeaponBulletHit2MeModifier_C.CheckFireTime
// 0x0018 (0x0018 - 0x0000)
struct WeaponBulletHit2MeModifier_C_CheckFireTime final
{
public:
	class UAbilityComponentBase*                  Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         FireID;                                            // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAdd;                                              // 0x000C(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Find_Value;                           // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBulletHit2MeModifier_C_CheckFireTime) == 0x000008, "Wrong alignment on WeaponBulletHit2MeModifier_C_CheckFireTime");
static_assert(sizeof(WeaponBulletHit2MeModifier_C_CheckFireTime) == 0x000018, "Wrong size on WeaponBulletHit2MeModifier_C_CheckFireTime");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_CheckFireTime, Target) == 0x000000, "Member 'WeaponBulletHit2MeModifier_C_CheckFireTime::Target' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_CheckFireTime, FireID) == 0x000008, "Member 'WeaponBulletHit2MeModifier_C_CheckFireTime::FireID' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_CheckFireTime, bAdd) == 0x00000C, "Member 'WeaponBulletHit2MeModifier_C_CheckFireTime::bAdd' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_CheckFireTime, CallFunc_Map_Find_Value) == 0x000010, "Member 'WeaponBulletHit2MeModifier_C_CheckFireTime::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_CheckFireTime, CallFunc_Map_Find_ReturnValue) == 0x000014, "Member 'WeaponBulletHit2MeModifier_C_CheckFireTime::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_CheckFireTime, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000015, "Member 'WeaponBulletHit2MeModifier_C_CheckFireTime::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WeaponBulletHit2MeModifier.WeaponBulletHit2MeModifier_C.K2_ReceiveInitialize
// 0x0010 (0x0010 - 0x0000)
struct WeaponBulletHit2MeModifier_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WeaponBulletHit2MeModifier_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on WeaponBulletHit2MeModifier_C_K2_ReceiveInitialize");
static_assert(sizeof(WeaponBulletHit2MeModifier_C_K2_ReceiveInitialize) == 0x000010, "Wrong size on WeaponBulletHit2MeModifier_C_K2_ReceiveInitialize");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'WeaponBulletHit2MeModifier_C_K2_ReceiveInitialize::Info' has a wrong offset!");

// Function WeaponBulletHit2MeModifier.WeaponBulletHit2MeModifier_C.K2_BulletHitTarger
// 0x00B0 (0x00B0 - 0x0000)
struct WeaponBulletHit2MeModifier_C_K2_BulletHitTarger final
{
public:
	class UAbilityComponentBase*                  InTarget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ApplyLocation;                                     // 0x0008(0x000C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQueryResult                           Result;                                            // 0x0018(0x0090)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, ContainsInstancedReference)
	bool                                          bBeforeDamage;                                     // 0x00A8(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         FireTimeId;                                        // 0x00AC(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponBulletHit2MeModifier_C_K2_BulletHitTarger) == 0x000008, "Wrong alignment on WeaponBulletHit2MeModifier_C_K2_BulletHitTarger");
static_assert(sizeof(WeaponBulletHit2MeModifier_C_K2_BulletHitTarger) == 0x0000B0, "Wrong size on WeaponBulletHit2MeModifier_C_K2_BulletHitTarger");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_K2_BulletHitTarger, InTarget) == 0x000000, "Member 'WeaponBulletHit2MeModifier_C_K2_BulletHitTarger::InTarget' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_K2_BulletHitTarger, ApplyLocation) == 0x000008, "Member 'WeaponBulletHit2MeModifier_C_K2_BulletHitTarger::ApplyLocation' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_K2_BulletHitTarger, Result) == 0x000018, "Member 'WeaponBulletHit2MeModifier_C_K2_BulletHitTarger::Result' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_K2_BulletHitTarger, bBeforeDamage) == 0x0000A8, "Member 'WeaponBulletHit2MeModifier_C_K2_BulletHitTarger::bBeforeDamage' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_K2_BulletHitTarger, FireTimeId) == 0x0000AC, "Member 'WeaponBulletHit2MeModifier_C_K2_BulletHitTarger::FireTimeId' has a wrong offset!");

// Function WeaponBulletHit2MeModifier.WeaponBulletHit2MeModifier_C.ExecuteUbergraph_WeaponBulletHit2MeModifier
// 0x0110 (0x0110 - 0x0000)
struct WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2E[0x2];                                       // 0x002E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetParamintValue_ReturnValue;             // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetParamintValue_ReturnValue_1;           // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_3;             // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UAbilityComponentBase*                  K2Node_Event_InTarget;                             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_ApplyLocation;                        // 0x0048(0x000C)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQueryResult                           K2Node_Event_Result;                               // 0x0058(0x0090)(ConstParm, ContainsInstancedReference)
	bool                                          K2Node_Event_bBeforeDamage;                        // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E9[0x3];                                       // 0x00E9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_Event_FireTimeId;                           // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckFireTime_bAdd;                       // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SelectInt_ReturnValue;                    // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetLuancher_ReturnValue;                  // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_MakeModifier_ReturnValue;                 // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier) == 0x000008, "Wrong alignment on WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier");
static_assert(sizeof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier) == 0x000110, "Wrong size on WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, EntryPoint) == 0x000000, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, K2Node_Event_Info) == 0x000008, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000020, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_GetParamboolValue_ReturnValue) == 0x00002C, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, K2Node_SwitchString_CmpSuccess) == 0x00002D, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_GetParamintValue_ReturnValue) == 0x000030, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_GetParamintValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_GetParamintValue_ReturnValue_1) == 0x000034, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_GetParamintValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_Greater_IntInt_ReturnValue) == 0x00003C, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_Greater_IntInt_ReturnValue_1) == 0x00003D, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_Greater_IntInt_ReturnValue_2) == 0x00003E, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_Greater_IntInt_ReturnValue_3) == 0x00003F, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_Greater_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, K2Node_Event_InTarget) == 0x000040, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::K2Node_Event_InTarget' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, K2Node_Event_ApplyLocation) == 0x000048, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::K2Node_Event_ApplyLocation' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, K2Node_Event_Result) == 0x000058, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::K2Node_Event_Result' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, K2Node_Event_bBeforeDamage) == 0x0000E8, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::K2Node_Event_bBeforeDamage' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, K2Node_Event_FireTimeId) == 0x0000EC, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::K2Node_Event_FireTimeId' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_CheckFireTime_bAdd) == 0x0000F0, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_CheckFireTime_bAdd' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_SelectInt_ReturnValue) == 0x0000F4, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_SelectInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_GetLuancher_ReturnValue) == 0x000100, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_GetLuancher_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier, CallFunc_MakeModifier_ReturnValue) == 0x000108, "Member 'WeaponBulletHit2MeModifier_C_ExecuteUbergraph_WeaponBulletHit2MeModifier::CallFunc_MakeModifier_ReturnValue' has a wrong offset!");

}

