#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponLuancherBulletCount

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponLuancherBulletCount.WeaponLuancherBulletCount_C
// 0x0020 (0x00F8 - 0x00D8)
class UWeaponLuancherBulletCount_C final : public UModifierSpecialEffectObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector2D                              LuanchCount;                                       // 0x00E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddLuacherCount;                                  // 0x00E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          bNotLauncherBullet;                                // 0x00E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_EA[0x2];                                       // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TotalChangeBullet;                                 // 0x00EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerWeapon*                          Weapon;                                            // 0x00F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Is_Active(bool* bActive);
	void Change_Weapon_Luanch_Count(bool bAdd);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info);
	void K2_ReceiveActive();
	void K2_ReceiveDeActive();
	void ReceiveOnWeaponFire(uint8 ForceShootCount);
	void K2_OnNotifyActiveChanged(bool bNewActive);
	void ExecuteUbergraph_WeaponLuancherBulletCount(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponLuancherBulletCount_C">();
	}
	static class UWeaponLuancherBulletCount_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponLuancherBulletCount_C>();
	}
};
static_assert(alignof(UWeaponLuancherBulletCount_C) == 0x000008, "Wrong alignment on UWeaponLuancherBulletCount_C");
static_assert(sizeof(UWeaponLuancherBulletCount_C) == 0x0000F8, "Wrong size on UWeaponLuancherBulletCount_C");
static_assert(offsetof(UWeaponLuancherBulletCount_C, UberGraphFrame) == 0x0000D8, "Member 'UWeaponLuancherBulletCount_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponLuancherBulletCount_C, LuanchCount) == 0x0000E0, "Member 'UWeaponLuancherBulletCount_C::LuanchCount' has a wrong offset!");
static_assert(offsetof(UWeaponLuancherBulletCount_C, bAddLuacherCount) == 0x0000E8, "Member 'UWeaponLuancherBulletCount_C::bAddLuacherCount' has a wrong offset!");
static_assert(offsetof(UWeaponLuancherBulletCount_C, bNotLauncherBullet) == 0x0000E9, "Member 'UWeaponLuancherBulletCount_C::bNotLauncherBullet' has a wrong offset!");
static_assert(offsetof(UWeaponLuancherBulletCount_C, TotalChangeBullet) == 0x0000EC, "Member 'UWeaponLuancherBulletCount_C::TotalChangeBullet' has a wrong offset!");
static_assert(offsetof(UWeaponLuancherBulletCount_C, Weapon) == 0x0000F0, "Member 'UWeaponLuancherBulletCount_C::Weapon' has a wrong offset!");

}

