#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponBulletEnchanting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponBulletEnchanting.WeaponBulletEnchanting_C
// 0x0030 (0x0108 - 0x00D8)
class UWeaponBulletEnchanting_C final : public UModifierSpecialEffectObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          bSet;                                              // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 DamageTypeName;                                    // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         SpecificTargetEnchantId;                           // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EmitterID;                                         // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bUseSource;                                        // 0x0100(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	TArray<struct FSoftObjectPath> OnGetAssetPath(const TArray<struct FParamInfo>& InParams, TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs, TArray<int32>& ModifierIDs, TArray<int32>& EmitterIDs);
	void IsActive(bool* bActive);
	void Change_Weapon_Temp_Bullet(bool bAdd);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info);
	void K2_ReceiveActive();
	void K2_ReceiveDeActive();
	void K2_OnNotifyActiveChanged(bool bNewActive);
	void ReceiveOnPreWeaponFire(EAttributeType BulletType);
	void ExecuteUbergraph_WeaponBulletEnchanting(int32 EntryPoint);

	bool CheckCondition(class UAbilityComponentBase* WeaponAbility) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponBulletEnchanting_C">();
	}
	static class UWeaponBulletEnchanting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponBulletEnchanting_C>();
	}
};
static_assert(alignof(UWeaponBulletEnchanting_C) == 0x000008, "Wrong alignment on UWeaponBulletEnchanting_C");
static_assert(sizeof(UWeaponBulletEnchanting_C) == 0x000108, "Wrong size on UWeaponBulletEnchanting_C");
static_assert(offsetof(UWeaponBulletEnchanting_C, UberGraphFrame) == 0x0000D8, "Member 'UWeaponBulletEnchanting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponBulletEnchanting_C, bSet) == 0x0000E0, "Member 'UWeaponBulletEnchanting_C::bSet' has a wrong offset!");
static_assert(offsetof(UWeaponBulletEnchanting_C, DamageTypeName) == 0x0000E8, "Member 'UWeaponBulletEnchanting_C::DamageTypeName' has a wrong offset!");
static_assert(offsetof(UWeaponBulletEnchanting_C, SpecificTargetEnchantId) == 0x0000F8, "Member 'UWeaponBulletEnchanting_C::SpecificTargetEnchantId' has a wrong offset!");
static_assert(offsetof(UWeaponBulletEnchanting_C, EmitterID) == 0x0000FC, "Member 'UWeaponBulletEnchanting_C::EmitterID' has a wrong offset!");
static_assert(offsetof(UWeaponBulletEnchanting_C, bUseSource) == 0x000100, "Member 'UWeaponBulletEnchanting_C::bUseSource' has a wrong offset!");

}

