#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponSpawnHomingBullet

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponSpawnHomingBullet.WeaponSpawnHomingBullet_C
// 0x0028 (0x0100 - 0x00D8)
class UWeaponSpawnHomingBullet_C final : public UModifierSpecialEffectObject
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FString                                 BulletPath;                                        // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          bLookTarget;                                       // 0x00F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotSpeed;                                          // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SearchEmitterID;                                   // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	TArray<struct FSoftObjectPath> OnGetAssetPath(const TArray<struct FParamInfo>& InParams, TArray<int32>& CharacterIDs, TArray<int32>& SkillIDs, TArray<int32>& ModifierIDs, TArray<int32>& EmitterIDs);
	void K2_ReceiveInitialize(const TArray<struct FParamInfo>& Info);
	void ExecuteUbergraph_WeaponSpawnHomingBullet(int32 EntryPoint);

	class AFireBullet* K2_WeaponSpawnSpecialBullet(class AActor* LpOwner, class UWeaponAbiliityComponent* AccessoryAbility, const struct FVector& NStartPosition, const struct FVector& NShootDirection, int32 BulletID) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponSpawnHomingBullet_C">();
	}
	static class UWeaponSpawnHomingBullet_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeaponSpawnHomingBullet_C>();
	}
};
static_assert(alignof(UWeaponSpawnHomingBullet_C) == 0x000008, "Wrong alignment on UWeaponSpawnHomingBullet_C");
static_assert(sizeof(UWeaponSpawnHomingBullet_C) == 0x000100, "Wrong size on UWeaponSpawnHomingBullet_C");
static_assert(offsetof(UWeaponSpawnHomingBullet_C, UberGraphFrame) == 0x0000D8, "Member 'UWeaponSpawnHomingBullet_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWeaponSpawnHomingBullet_C, BulletPath) == 0x0000E0, "Member 'UWeaponSpawnHomingBullet_C::BulletPath' has a wrong offset!");
static_assert(offsetof(UWeaponSpawnHomingBullet_C, bLookTarget) == 0x0000F0, "Member 'UWeaponSpawnHomingBullet_C::bLookTarget' has a wrong offset!");
static_assert(offsetof(UWeaponSpawnHomingBullet_C, RotSpeed) == 0x0000F4, "Member 'UWeaponSpawnHomingBullet_C::RotSpeed' has a wrong offset!");
static_assert(offsetof(UWeaponSpawnHomingBullet_C, SearchEmitterID) == 0x0000F8, "Member 'UWeaponSpawnHomingBullet_C::SearchEmitterID' has a wrong offset!");

}

