#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponLuancherBulletCount

#include "Basic.hpp"

#include "Game_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WeaponLuancherBulletCount.WeaponLuancherBulletCount_C.Is Active
// 0x0003 (0x0003 - 0x0000)
struct WeaponLuancherBulletCount_C_Is_Active final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActiveEffect_ReturnValue;               // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponLuancherBulletCount_C_Is_Active) == 0x000001, "Wrong alignment on WeaponLuancherBulletCount_C_Is_Active");
static_assert(sizeof(WeaponLuancherBulletCount_C_Is_Active) == 0x000003, "Wrong size on WeaponLuancherBulletCount_C_Is_Active");
static_assert(offsetof(WeaponLuancherBulletCount_C_Is_Active, bActive) == 0x000000, "Member 'WeaponLuancherBulletCount_C_Is_Active::bActive' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_Is_Active, CallFunc_IsActiveEffect_ReturnValue) == 0x000001, "Member 'WeaponLuancherBulletCount_C_Is_Active::CallFunc_IsActiveEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_Is_Active, CallFunc_IsValid_ReturnValue) == 0x000002, "Member 'WeaponLuancherBulletCount_C_Is_Active::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WeaponLuancherBulletCount.WeaponLuancherBulletCount_C.Change Weapon Luanch Count
// 0x0048 (0x0048 - 0x0000)
struct WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count final
{
public:
	bool                                          bAdd;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurBulletCount;                                    // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttributeChangeValue                  K2Node_MakeStruct_AttributeChangeValue;            // 0x0010(0x0020)(NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_ApplyAttributeChange_ReturnValue;         // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_42[0x2];                                       // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Select_Default;                             // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count) == 0x000008, "Wrong alignment on WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count");
static_assert(sizeof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count) == 0x000048, "Wrong size on WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count");
static_assert(offsetof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count, bAdd) == 0x000000, "Member 'WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count::bAdd' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count, CurBulletCount) == 0x000004, "Member 'WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count::CurBulletCount' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count, K2Node_MakeStruct_AttributeChangeValue) == 0x000010, "Member 'WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count::K2Node_MakeStruct_AttributeChangeValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count, CallFunc_ApplyAttributeChange_ReturnValue) == 0x000038, "Member 'WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count::CallFunc_ApplyAttributeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count, ___bool_Variable) == 0x000040, "Member 'WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count::___bool_Variable' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x000041, "Member 'WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count, K2Node_Select_Default) == 0x000044, "Member 'WeaponLuancherBulletCount_C_Change_Weapon_Luanch_Count::K2Node_Select_Default' has a wrong offset!");

// Function WeaponLuancherBulletCount.WeaponLuancherBulletCount_C.K2_ReceiveInitialize
// 0x0010 (0x0010 - 0x0000)
struct WeaponLuancherBulletCount_C_K2_ReceiveInitialize final
{
public:
	TArray<struct FParamInfo>                     Info;                                              // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WeaponLuancherBulletCount_C_K2_ReceiveInitialize) == 0x000008, "Wrong alignment on WeaponLuancherBulletCount_C_K2_ReceiveInitialize");
static_assert(sizeof(WeaponLuancherBulletCount_C_K2_ReceiveInitialize) == 0x000010, "Wrong size on WeaponLuancherBulletCount_C_K2_ReceiveInitialize");
static_assert(offsetof(WeaponLuancherBulletCount_C_K2_ReceiveInitialize, Info) == 0x000000, "Member 'WeaponLuancherBulletCount_C_K2_ReceiveInitialize::Info' has a wrong offset!");

// Function WeaponLuancherBulletCount.WeaponLuancherBulletCount_C.ReceiveOnWeaponFire
// 0x0001 (0x0001 - 0x0000)
struct WeaponLuancherBulletCount_C_ReceiveOnWeaponFire final
{
public:
	uint8                                         ForceShootCount;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponLuancherBulletCount_C_ReceiveOnWeaponFire) == 0x000001, "Wrong alignment on WeaponLuancherBulletCount_C_ReceiveOnWeaponFire");
static_assert(sizeof(WeaponLuancherBulletCount_C_ReceiveOnWeaponFire) == 0x000001, "Wrong size on WeaponLuancherBulletCount_C_ReceiveOnWeaponFire");
static_assert(offsetof(WeaponLuancherBulletCount_C_ReceiveOnWeaponFire, ForceShootCount) == 0x000000, "Member 'WeaponLuancherBulletCount_C_ReceiveOnWeaponFire::ForceShootCount' has a wrong offset!");

// Function WeaponLuancherBulletCount.WeaponLuancherBulletCount_C.K2_OnNotifyActiveChanged
// 0x0001 (0x0001 - 0x0000)
struct WeaponLuancherBulletCount_C_K2_OnNotifyActiveChanged final
{
public:
	bool                                          bNewActive;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponLuancherBulletCount_C_K2_OnNotifyActiveChanged) == 0x000001, "Wrong alignment on WeaponLuancherBulletCount_C_K2_OnNotifyActiveChanged");
static_assert(sizeof(WeaponLuancherBulletCount_C_K2_OnNotifyActiveChanged) == 0x000001, "Wrong size on WeaponLuancherBulletCount_C_K2_OnNotifyActiveChanged");
static_assert(offsetof(WeaponLuancherBulletCount_C_K2_OnNotifyActiveChanged, bNewActive) == 0x000000, "Member 'WeaponLuancherBulletCount_C_K2_OnNotifyActiveChanged::bNewActive' has a wrong offset!");

// Function WeaponLuancherBulletCount.WeaponLuancherBulletCount_C.ExecuteUbergraph_WeaponLuancherBulletCount
// 0x0078 (0x0078 - 0x0000)
struct WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FParamInfo>                     K2Node_Event_Info;                                 // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetParamboolValue_ReturnValue;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1E[0x2];                                       // 0x001E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_2;             // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValueStringForLevel_ReturnValue;  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValueStringForLevel_ReturnValue_1; // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Active_bActive;                        // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X;                          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         K2Node_Event_ForceShootCount;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Active_bActive_1;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bNewActive;                           // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_53[0x5];                                       // 0x0053(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerWeapon*                          CallFunc_GetPlayerWeapon_ReturnValue;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_IntFloat_ReturnValue;            // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount) == 0x000008, "Wrong alignment on WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount");
static_assert(sizeof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount) == 0x000078, "Wrong size on WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, EntryPoint) == 0x000000, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, K2Node_Event_Info) == 0x000008, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::K2Node_Event_Info' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Array_Length_ReturnValue) == 0x000018, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_GetParamboolValue_ReturnValue) == 0x00001C, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_GetParamboolValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Greater_IntInt_ReturnValue) == 0x00001D, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Array_Length_ReturnValue_1) == 0x000020, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Array_Length_ReturnValue_2) == 0x000024, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000028, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Greater_IntInt_ReturnValue_2) == 0x000029, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Greater_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_GetFloatValueStringForLevel_ReturnValue) == 0x00002C, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_GetFloatValueStringForLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_MakeVector2D_ReturnValue) == 0x000030, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_GetFloatValueStringForLevel_ReturnValue_1) == 0x000038, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_GetFloatValueStringForLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Is_Active_bActive) == 0x00003C, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Is_Active_bActive' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_BreakVector2D_X) == 0x000040, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_BreakVector2D_Y) == 0x000044, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_MakeVector2D_ReturnValue_1) == 0x000048, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, K2Node_Event_ForceShootCount) == 0x000050, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::K2Node_Event_ForceShootCount' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Is_Active_bActive_1) == 0x000051, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Is_Active_bActive_1' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, K2Node_Event_bNewActive) == 0x000052, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::K2Node_Event_bNewActive' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_GetPlayerWeapon_ReturnValue) == 0x000058, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_GetPlayerWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_BreakVector2D_X_1) == 0x000064, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_BreakVector2D_Y_1) == 0x000068, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00006C, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Multiply_IntFloat_ReturnValue) == 0x000070, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Multiply_IntFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount, CallFunc_Add_FloatFloat_ReturnValue) == 0x000074, "Member 'WeaponLuancherBulletCount_C_ExecuteUbergraph_WeaponLuancherBulletCount::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

}

