#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weather

#include "Basic.hpp"

#include "Weather_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Class Weather.RainConfig
// 0x0188 (0x01B8 - 0x0030)
class URainConfig final : public UPrimaryDataAsset
{
public:
	struct FRainParameter                         Parameter;                                         // 0x0030(0x00D8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FSkyParameter                          SkyParameter;                                      // 0x0108(0x009C)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A4[0x4];                                      // 0x01A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            BlendInCurve;                                      // 0x01A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveVector*                           LightingCurve;                                     // 0x01B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RainConfig">();
	}
	static class URainConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<URainConfig>();
	}
};
static_assert(alignof(URainConfig) == 0x000008, "Wrong alignment on URainConfig");
static_assert(sizeof(URainConfig) == 0x0001B8, "Wrong size on URainConfig");
static_assert(offsetof(URainConfig, Parameter) == 0x000030, "Member 'URainConfig::Parameter' has a wrong offset!");
static_assert(offsetof(URainConfig, SkyParameter) == 0x000108, "Member 'URainConfig::SkyParameter' has a wrong offset!");
static_assert(offsetof(URainConfig, BlendInCurve) == 0x0001A8, "Member 'URainConfig::BlendInCurve' has a wrong offset!");
static_assert(offsetof(URainConfig, LightingCurve) == 0x0001B0, "Member 'URainConfig::LightingCurve' has a wrong offset!");

// Class Weather.WeatherActorBase
// 0x0020 (0x0248 - 0x0228)
class AWeatherActorBase : public AActor
{
public:
	bool                                          bDynamicWeather;                                   // 0x0228(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_229[0x3];                                      // 0x0229(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TickInterval;                                      // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                        RootComp;                                          // 0x0230(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBillboardComponent*                    ICONComp;                                          // 0x0238(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EWeatherQuality                               CurrentQuality;                                    // 0x0240(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_241[0x7];                                      // 0x0241(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WeatherActorBase">();
	}
	static class AWeatherActorBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeatherActorBase>();
	}
};
static_assert(alignof(AWeatherActorBase) == 0x000008, "Wrong alignment on AWeatherActorBase");
static_assert(sizeof(AWeatherActorBase) == 0x000248, "Wrong size on AWeatherActorBase");
static_assert(offsetof(AWeatherActorBase, bDynamicWeather) == 0x000228, "Member 'AWeatherActorBase::bDynamicWeather' has a wrong offset!");
static_assert(offsetof(AWeatherActorBase, TickInterval) == 0x00022C, "Member 'AWeatherActorBase::TickInterval' has a wrong offset!");
static_assert(offsetof(AWeatherActorBase, RootComp) == 0x000230, "Member 'AWeatherActorBase::RootComp' has a wrong offset!");
static_assert(offsetof(AWeatherActorBase, ICONComp) == 0x000238, "Member 'AWeatherActorBase::ICONComp' has a wrong offset!");
static_assert(offsetof(AWeatherActorBase, CurrentQuality) == 0x000240, "Member 'AWeatherActorBase::CurrentQuality' has a wrong offset!");

// Class Weather.RainSource
// 0x0180 (0x03C8 - 0x0248)
class ARainSource final : public AWeatherActorBase
{
public:
	TMap<EWeatherQuality, class URainConfig*>     RainConfiges;                                      // 0x0248(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class ULightComponent*                        DirectionLightComponent;                           // 0x0298(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExponentialHeightFogComponent*         RawHeightFog;                                      // 0x02A0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPostProcessComponent*                  PostProcess;                                       // 0x02A8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   RainMesh;                                          // 0x02B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      RainParticle;                                      // 0x02B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNiagaraComponent*                      LightingParticle;                                  // 0x02C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneCaptureComponent2D*               ToTopCapture;                                      // 0x02C8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APostProcessVolume*                     SceneMainPost;                                     // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainFallParticleOffset;                            // 0x02D8(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                CaptureBoxExtent;                                  // 0x02DC(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialParameterCollection*           RainMatData;                                       // 0x02E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CaptureMaxMoveDistance;                            // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F4[0x4];                                      // 0x02F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ShowOnlyActors;                                    // 0x02F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPublic)
	TArray<EObjectTypeQuery>                      ShowOnlyActorsType;                                // 0x0308(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FRotator                               RawCaptureRotate;                                  // 0x0318(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               InversCaptureRotate;                               // 0x0324(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bUpdateLightingLight;                              // 0x0330(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_331[0x7];                                      // 0x0331(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class URainConfig*                            LastWeather;                                       // 0x0338(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URainConfig*                            StartBlendWeather;                                 // 0x0340(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URainConfig*                            EndBlendWeather;                                   // 0x0348(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainSoundVolumeScaler;                             // 0x0350(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightingSoundVolumeScaler;                         // 0x0354(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurRainSoundVolume;                                // 0x0358(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CurLightingSoundVolume;                            // 0x035C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDisableRainAll;                                   // 0x0360(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsInitOnly;                                       // 0x0361(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBlendingThunder;                                // 0x0362(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsBlendingRain;                                   // 0x0363(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_364[0x20];                                     // 0x0364(0x0020)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CurThunderTimer;                                   // 0x0384(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_388[0x2C];                                     // 0x0388(0x002C)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          InversGravity;                                     // 0x03B4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseCapture;                                       // 0x03B5(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3B6[0x2];                                      // 0x03B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UExponentialHeightFogComponent*         ExponentialHeightFog;                              // 0x03B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TempRainSoundVolume;                               // 0x03C0(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TempLightingSoundVolume;                           // 0x03C4(0x0004)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void BegineFastSwitch();
	void BeginInit();
	void BeginQualityChange(EWeatherQuality InQuality);
	void BindRain();
	void BlendFog(float _Alpha);
	void BlendLight(float _Alpha);
	void BlendMat(float _Alpha);
	void BlendRain();
	void BlendRainOffEvent();
	void BlendRainOnEvent();
	void BlendScenePost(float _Alpha);
	void BlendSky(float _Alpha);
	void BlendSky_BP(float _Alpha);
	void BlendSound(float _Alpha);
	void CheckAndSetEnvironment();
	void CheckAndSetSky();
	void DisableRain(bool bForce, bool bFast);
	void EnableRain(bool bForce, bool bFast);
	void EndFastSwitch();
	void EndQualityChange(EWeatherQuality InQuality);
	bool IsRainning();
	void PlayLightingSound();
	void PlayRainMainSound();
	void SetLightingSoundScaler(float Scaler);
	void SetLightingSoundVolume(float Volume);
	void SetQuality(EWeatherQuality InQuality);
	void SetQualityFast(EWeatherQuality InQuality);
	void SetRainMainSoundScaler(float Scaler);
	void SetRainMainSoundVolume(float Volume);
	void StopLightingEvent();
	void StopLightingSound();
	void StopRainMainSound();
	void UpdateCapture(bool bForce);
	void UpdateRain();
	void UpdateThunder();
	void UpdateThunderEvent();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"RainSource">();
	}
	static class ARainSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<ARainSource>();
	}
};
static_assert(alignof(ARainSource) == 0x000008, "Wrong alignment on ARainSource");
static_assert(sizeof(ARainSource) == 0x0003C8, "Wrong size on ARainSource");
static_assert(offsetof(ARainSource, RainConfiges) == 0x000248, "Member 'ARainSource::RainConfiges' has a wrong offset!");
static_assert(offsetof(ARainSource, DirectionLightComponent) == 0x000298, "Member 'ARainSource::DirectionLightComponent' has a wrong offset!");
static_assert(offsetof(ARainSource, RawHeightFog) == 0x0002A0, "Member 'ARainSource::RawHeightFog' has a wrong offset!");
static_assert(offsetof(ARainSource, PostProcess) == 0x0002A8, "Member 'ARainSource::PostProcess' has a wrong offset!");
static_assert(offsetof(ARainSource, RainMesh) == 0x0002B0, "Member 'ARainSource::RainMesh' has a wrong offset!");
static_assert(offsetof(ARainSource, RainParticle) == 0x0002B8, "Member 'ARainSource::RainParticle' has a wrong offset!");
static_assert(offsetof(ARainSource, LightingParticle) == 0x0002C0, "Member 'ARainSource::LightingParticle' has a wrong offset!");
static_assert(offsetof(ARainSource, ToTopCapture) == 0x0002C8, "Member 'ARainSource::ToTopCapture' has a wrong offset!");
static_assert(offsetof(ARainSource, SceneMainPost) == 0x0002D0, "Member 'ARainSource::SceneMainPost' has a wrong offset!");
static_assert(offsetof(ARainSource, RainFallParticleOffset) == 0x0002D8, "Member 'ARainSource::RainFallParticleOffset' has a wrong offset!");
static_assert(offsetof(ARainSource, CaptureBoxExtent) == 0x0002DC, "Member 'ARainSource::CaptureBoxExtent' has a wrong offset!");
static_assert(offsetof(ARainSource, RainMatData) == 0x0002E8, "Member 'ARainSource::RainMatData' has a wrong offset!");
static_assert(offsetof(ARainSource, CaptureMaxMoveDistance) == 0x0002F0, "Member 'ARainSource::CaptureMaxMoveDistance' has a wrong offset!");
static_assert(offsetof(ARainSource, ShowOnlyActors) == 0x0002F8, "Member 'ARainSource::ShowOnlyActors' has a wrong offset!");
static_assert(offsetof(ARainSource, ShowOnlyActorsType) == 0x000308, "Member 'ARainSource::ShowOnlyActorsType' has a wrong offset!");
static_assert(offsetof(ARainSource, RawCaptureRotate) == 0x000318, "Member 'ARainSource::RawCaptureRotate' has a wrong offset!");
static_assert(offsetof(ARainSource, InversCaptureRotate) == 0x000324, "Member 'ARainSource::InversCaptureRotate' has a wrong offset!");
static_assert(offsetof(ARainSource, bUpdateLightingLight) == 0x000330, "Member 'ARainSource::bUpdateLightingLight' has a wrong offset!");
static_assert(offsetof(ARainSource, LastWeather) == 0x000338, "Member 'ARainSource::LastWeather' has a wrong offset!");
static_assert(offsetof(ARainSource, StartBlendWeather) == 0x000340, "Member 'ARainSource::StartBlendWeather' has a wrong offset!");
static_assert(offsetof(ARainSource, EndBlendWeather) == 0x000348, "Member 'ARainSource::EndBlendWeather' has a wrong offset!");
static_assert(offsetof(ARainSource, RainSoundVolumeScaler) == 0x000350, "Member 'ARainSource::RainSoundVolumeScaler' has a wrong offset!");
static_assert(offsetof(ARainSource, LightingSoundVolumeScaler) == 0x000354, "Member 'ARainSource::LightingSoundVolumeScaler' has a wrong offset!");
static_assert(offsetof(ARainSource, CurRainSoundVolume) == 0x000358, "Member 'ARainSource::CurRainSoundVolume' has a wrong offset!");
static_assert(offsetof(ARainSource, CurLightingSoundVolume) == 0x00035C, "Member 'ARainSource::CurLightingSoundVolume' has a wrong offset!");
static_assert(offsetof(ARainSource, bDisableRainAll) == 0x000360, "Member 'ARainSource::bDisableRainAll' has a wrong offset!");
static_assert(offsetof(ARainSource, bIsInitOnly) == 0x000361, "Member 'ARainSource::bIsInitOnly' has a wrong offset!");
static_assert(offsetof(ARainSource, bIsBlendingThunder) == 0x000362, "Member 'ARainSource::bIsBlendingThunder' has a wrong offset!");
static_assert(offsetof(ARainSource, bIsBlendingRain) == 0x000363, "Member 'ARainSource::bIsBlendingRain' has a wrong offset!");
static_assert(offsetof(ARainSource, CurThunderTimer) == 0x000384, "Member 'ARainSource::CurThunderTimer' has a wrong offset!");
static_assert(offsetof(ARainSource, InversGravity) == 0x0003B4, "Member 'ARainSource::InversGravity' has a wrong offset!");
static_assert(offsetof(ARainSource, bUseCapture) == 0x0003B5, "Member 'ARainSource::bUseCapture' has a wrong offset!");
static_assert(offsetof(ARainSource, ExponentialHeightFog) == 0x0003B8, "Member 'ARainSource::ExponentialHeightFog' has a wrong offset!");
static_assert(offsetof(ARainSource, TempRainSoundVolume) == 0x0003C0, "Member 'ARainSource::TempRainSoundVolume' has a wrong offset!");
static_assert(offsetof(ARainSource, TempLightingSoundVolume) == 0x0003C4, "Member 'ARainSource::TempLightingSoundVolume' has a wrong offset!");

// Class Weather.SandstormConfig
// 0x0080 (0x00B0 - 0x0030)
class USandstormConfig final : public UPrimaryDataAsset
{
public:
	struct FSandstormParameter                    Parameter;                                         // 0x0030(0x0074)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_A4[0x4];                                       // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            BlendInCurve;                                      // 0x00A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SandstormConfig">();
	}
	static class USandstormConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<USandstormConfig>();
	}
};
static_assert(alignof(USandstormConfig) == 0x000008, "Wrong alignment on USandstormConfig");
static_assert(sizeof(USandstormConfig) == 0x0000B0, "Wrong size on USandstormConfig");
static_assert(offsetof(USandstormConfig, Parameter) == 0x000030, "Member 'USandstormConfig::Parameter' has a wrong offset!");
static_assert(offsetof(USandstormConfig, BlendInCurve) == 0x0000A8, "Member 'USandstormConfig::BlendInCurve' has a wrong offset!");

// Class Weather.SandstormSource
// 0x01A0 (0x03E8 - 0x0248)
class ASandstormSource final : public AWeatherActorBase
{
public:
	TMap<EWeatherQuality, class USandstormConfig*> SandstormConfiges;                                 // 0x0248(0x0050)(Edit, NativeAccessSpecifierPublic)
	class UNiagaraSystem*                         SandstromEffect;                                   // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableVolumetricFog;                              // 0x02A0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMesh*                            FogVolumeMesh;                                     // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                VolumeScale;                                       // 0x02B0(0x000C)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2BC[0x4];                                      // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     FogVolumeMaterial;                                 // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                     ExpFogMaterial;                                    // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPostProcessComponent*                  PostProcess;                                       // 0x02D0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UChildActorComponent*                   UsedWindActor;                                     // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E0[0x8];                                      // 0x02E0(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UExponentialHeightFogComponent*         ExponentialHeightFog;                              // 0x02E8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNiagaraComponent*                      SandstromEffectComponent;                          // 0x02F0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStaticMeshComponent*                   FogVolume;                                         // 0x02F8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AWindSource*                            WindActor;                                         // 0x0300(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UMaterialParameterCollection> SandstormParameterCollection;                      // 0x0308(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USandstormConfig*                       NewConfig;                                         // 0x0330(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USandstormConfig*                       OldConfig;                                         // 0x0338(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USandstormConfig*                       CurrentConfig;                                     // 0x0340(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_348[0xA0];                                     // 0x0348(0x00A0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void BeginQualityChange(EWeatherQuality InQuality);
	void BlendParameterEvent();
	void EndQualityChange(EWeatherQuality InQuality);
	EWeatherQuality GetQuality();
	void SetQuality(EWeatherQuality InQuality);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"SandstormSource">();
	}
	static class ASandstormSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<ASandstormSource>();
	}
};
static_assert(alignof(ASandstormSource) == 0x000008, "Wrong alignment on ASandstormSource");
static_assert(sizeof(ASandstormSource) == 0x0003E8, "Wrong size on ASandstormSource");
static_assert(offsetof(ASandstormSource, SandstormConfiges) == 0x000248, "Member 'ASandstormSource::SandstormConfiges' has a wrong offset!");
static_assert(offsetof(ASandstormSource, SandstromEffect) == 0x000298, "Member 'ASandstormSource::SandstromEffect' has a wrong offset!");
static_assert(offsetof(ASandstormSource, bEnableVolumetricFog) == 0x0002A0, "Member 'ASandstormSource::bEnableVolumetricFog' has a wrong offset!");
static_assert(offsetof(ASandstormSource, FogVolumeMesh) == 0x0002A8, "Member 'ASandstormSource::FogVolumeMesh' has a wrong offset!");
static_assert(offsetof(ASandstormSource, VolumeScale) == 0x0002B0, "Member 'ASandstormSource::VolumeScale' has a wrong offset!");
static_assert(offsetof(ASandstormSource, FogVolumeMaterial) == 0x0002C0, "Member 'ASandstormSource::FogVolumeMaterial' has a wrong offset!");
static_assert(offsetof(ASandstormSource, ExpFogMaterial) == 0x0002C8, "Member 'ASandstormSource::ExpFogMaterial' has a wrong offset!");
static_assert(offsetof(ASandstormSource, PostProcess) == 0x0002D0, "Member 'ASandstormSource::PostProcess' has a wrong offset!");
static_assert(offsetof(ASandstormSource, UsedWindActor) == 0x0002D8, "Member 'ASandstormSource::UsedWindActor' has a wrong offset!");
static_assert(offsetof(ASandstormSource, ExponentialHeightFog) == 0x0002E8, "Member 'ASandstormSource::ExponentialHeightFog' has a wrong offset!");
static_assert(offsetof(ASandstormSource, SandstromEffectComponent) == 0x0002F0, "Member 'ASandstormSource::SandstromEffectComponent' has a wrong offset!");
static_assert(offsetof(ASandstormSource, FogVolume) == 0x0002F8, "Member 'ASandstormSource::FogVolume' has a wrong offset!");
static_assert(offsetof(ASandstormSource, WindActor) == 0x000300, "Member 'ASandstormSource::WindActor' has a wrong offset!");
static_assert(offsetof(ASandstormSource, SandstormParameterCollection) == 0x000308, "Member 'ASandstormSource::SandstormParameterCollection' has a wrong offset!");
static_assert(offsetof(ASandstormSource, NewConfig) == 0x000330, "Member 'ASandstormSource::NewConfig' has a wrong offset!");
static_assert(offsetof(ASandstormSource, OldConfig) == 0x000338, "Member 'ASandstormSource::OldConfig' has a wrong offset!");
static_assert(offsetof(ASandstormSource, CurrentConfig) == 0x000340, "Member 'ASandstormSource::CurrentConfig' has a wrong offset!");

// Class Weather.WeatherConfigBase
// 0x0000 (0x0030 - 0x0030)
class UWeatherConfigBase final : public UPrimaryDataAsset
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WeatherConfigBase">();
	}
	static class UWeatherConfigBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWeatherConfigBase>();
	}
};
static_assert(alignof(UWeatherConfigBase) == 0x000008, "Wrong alignment on UWeatherConfigBase");
static_assert(sizeof(UWeatherConfigBase) == 0x000030, "Wrong size on UWeatherConfigBase");

// Class Weather.WindConfig
// 0x0018 (0x0048 - 0x0030)
class UWindConfig final : public UPrimaryDataAsset
{
public:
	struct FWindParameter                         Config;                                            // 0x0030(0x0018)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WindConfig">();
	}
	static class UWindConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWindConfig>();
	}
};
static_assert(alignof(UWindConfig) == 0x000008, "Wrong alignment on UWindConfig");
static_assert(sizeof(UWindConfig) == 0x000048, "Wrong size on UWindConfig");
static_assert(offsetof(UWindConfig, Config) == 0x000030, "Member 'UWindConfig::Config' has a wrong offset!");

// Class Weather.WindSource
// 0x00D8 (0x0320 - 0x0248)
class AWindSource final : public AWeatherActorBase
{
public:
	TSoftObjectPtr<class UMaterialParameterCollection> WindParameter;                                     // 0x0248(0x0028)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_270[0x18];                                     // 0x0270(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UArrowComponent*                        Arrow;                                             // 0x0288(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<EWeatherQuality, class UWindConfig*>     WindConfig;                                        // 0x0290(0x0050)(Edit, NativeAccessSpecifierPrivate)
	uint8                                         Pad_2E0[0x40];                                     // 0x02E0(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WindSource">();
	}
	static class AWindSource* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWindSource>();
	}
};
static_assert(alignof(AWindSource) == 0x000008, "Wrong alignment on AWindSource");
static_assert(sizeof(AWindSource) == 0x000320, "Wrong size on AWindSource");
static_assert(offsetof(AWindSource, WindParameter) == 0x000248, "Member 'AWindSource::WindParameter' has a wrong offset!");
static_assert(offsetof(AWindSource, Arrow) == 0x000288, "Member 'AWindSource::Arrow' has a wrong offset!");
static_assert(offsetof(AWindSource, WindConfig) == 0x000290, "Member 'AWindSource::WindConfig' has a wrong offset!");

}

