#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weather

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum Weather.EWeatherQuality
// NumValues: 0x0009
enum class EWeatherQuality : uint8
{
	None                                     = 0,
	Low                                      = 1,
	Medium                                   = 2,
	High                                     = 3,
	None_Night                               = 4,
	Low_Night                                = 5,
	Medium_Night                             = 6,
	High_Night                               = 7,
	EWeatherQuality_MAX                      = 8,
};

// Enum Weather.EWeatherType
// NumValues: 0x0005
enum class EWeatherType : uint8
{
	Sandstorm                                = 0,
	Rain                                     = 1,
	Wind                                     = 2,
	Fog                                      = 3,
	EWeatherType_MAX                         = 4,
};

// ScriptStruct Weather.SkyParameter
// 0x009C (0x009C - 0x0000)
struct FSkyParameter final
{
public:
	float                                         HorizonFalloff;                                    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ZenthColor;                                        // 0x0004(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           HorizonColor;                                      // 0x0014(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           CloudColor;                                        // 0x0024(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           OverallColor;                                      // 0x0034(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SunColor;                                          // 0x0044(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunBrightness;                                     // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunRadius;                                         // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunHeight;                                         // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SunDir;                                            // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StarsBrightness;                                   // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudSpeed;                                        // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudOpacity;                                      // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudOverallScale;                                 // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cloud01Brightness;                                 // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cloud01Range;                                      // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cloud01Opacity;                                    // 0x007C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CloudPower2;                                       // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cloud02Range;                                      // 0x0084(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cloud02Opacity;                                    // 0x0088(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkyLightBrightness;                                // 0x008C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkyLightHeight;                                    // 0x0090(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkyLightFalloff;                                   // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SkyLightRange;                                     // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSkyParameter) == 0x000004, "Wrong alignment on FSkyParameter");
static_assert(sizeof(FSkyParameter) == 0x00009C, "Wrong size on FSkyParameter");
static_assert(offsetof(FSkyParameter, HorizonFalloff) == 0x000000, "Member 'FSkyParameter::HorizonFalloff' has a wrong offset!");
static_assert(offsetof(FSkyParameter, ZenthColor) == 0x000004, "Member 'FSkyParameter::ZenthColor' has a wrong offset!");
static_assert(offsetof(FSkyParameter, HorizonColor) == 0x000014, "Member 'FSkyParameter::HorizonColor' has a wrong offset!");
static_assert(offsetof(FSkyParameter, CloudColor) == 0x000024, "Member 'FSkyParameter::CloudColor' has a wrong offset!");
static_assert(offsetof(FSkyParameter, OverallColor) == 0x000034, "Member 'FSkyParameter::OverallColor' has a wrong offset!");
static_assert(offsetof(FSkyParameter, SunColor) == 0x000044, "Member 'FSkyParameter::SunColor' has a wrong offset!");
static_assert(offsetof(FSkyParameter, SunBrightness) == 0x000054, "Member 'FSkyParameter::SunBrightness' has a wrong offset!");
static_assert(offsetof(FSkyParameter, SunRadius) == 0x000058, "Member 'FSkyParameter::SunRadius' has a wrong offset!");
static_assert(offsetof(FSkyParameter, SunHeight) == 0x00005C, "Member 'FSkyParameter::SunHeight' has a wrong offset!");
static_assert(offsetof(FSkyParameter, SunDir) == 0x000060, "Member 'FSkyParameter::SunDir' has a wrong offset!");
static_assert(offsetof(FSkyParameter, StarsBrightness) == 0x000064, "Member 'FSkyParameter::StarsBrightness' has a wrong offset!");
static_assert(offsetof(FSkyParameter, CloudSpeed) == 0x000068, "Member 'FSkyParameter::CloudSpeed' has a wrong offset!");
static_assert(offsetof(FSkyParameter, CloudOpacity) == 0x00006C, "Member 'FSkyParameter::CloudOpacity' has a wrong offset!");
static_assert(offsetof(FSkyParameter, CloudOverallScale) == 0x000070, "Member 'FSkyParameter::CloudOverallScale' has a wrong offset!");
static_assert(offsetof(FSkyParameter, Cloud01Brightness) == 0x000074, "Member 'FSkyParameter::Cloud01Brightness' has a wrong offset!");
static_assert(offsetof(FSkyParameter, Cloud01Range) == 0x000078, "Member 'FSkyParameter::Cloud01Range' has a wrong offset!");
static_assert(offsetof(FSkyParameter, Cloud01Opacity) == 0x00007C, "Member 'FSkyParameter::Cloud01Opacity' has a wrong offset!");
static_assert(offsetof(FSkyParameter, CloudPower2) == 0x000080, "Member 'FSkyParameter::CloudPower2' has a wrong offset!");
static_assert(offsetof(FSkyParameter, Cloud02Range) == 0x000084, "Member 'FSkyParameter::Cloud02Range' has a wrong offset!");
static_assert(offsetof(FSkyParameter, Cloud02Opacity) == 0x000088, "Member 'FSkyParameter::Cloud02Opacity' has a wrong offset!");
static_assert(offsetof(FSkyParameter, SkyLightBrightness) == 0x00008C, "Member 'FSkyParameter::SkyLightBrightness' has a wrong offset!");
static_assert(offsetof(FSkyParameter, SkyLightHeight) == 0x000090, "Member 'FSkyParameter::SkyLightHeight' has a wrong offset!");
static_assert(offsetof(FSkyParameter, SkyLightFalloff) == 0x000094, "Member 'FSkyParameter::SkyLightFalloff' has a wrong offset!");
static_assert(offsetof(FSkyParameter, SkyLightRange) == 0x000098, "Member 'FSkyParameter::SkyLightRange' has a wrong offset!");

// ScriptStruct Weather.RainParameter
// 0x00D8 (0x00D8 - 0x0000)
struct FRainParameter final
{
public:
	float                                         FogDensity;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogHeightFalloff;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondFogDensity;                                  // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SecondFogHeightFalloff;                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FogInscatteringColor;                              // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogMaxOpacity;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDistance;                                     // 0x0024(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DirectionalInscatteringColor;                      // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 VolumetricFogAlbedo;                               // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           VolumetricFogEmissive;                             // 0x003C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightIntensity;                                    // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LightColor;                                        // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainPostAlpha;                                     // 0x0060(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseRainPose;                                      // 0x0064(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ExposureCompensation;                              // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WhiteTemp;                                         // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseThunder;                                       // 0x0070(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ThunderBreakTime;                                  // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightingIntensity;                                 // 0x0078(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bMuteRain;                                         // 0x007C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7D[0x3];                                       // 0x007D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LayerBlend;                                        // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           RippleColorTint;                                   // 0x0084(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RippleTillingScale;                                // 0x0094(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RippleClipScale;                                   // 0x0098(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RippleSpeedScale;                                  // 0x009C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RippleSizeScale;                                   // 0x00A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SurfNormalTillingScale;                            // 0x00A4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SurfNormalSpeedScale;                              // 0x00A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SurfNormalFlatScale;                               // 0x00AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           RainColorTint;                                     // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainAlphaScale;                                    // 0x00C0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           SceneColorTint1;                                   // 0x00C4(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RainTexID;                                         // 0x00D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRainParameter) == 0x000004, "Wrong alignment on FRainParameter");
static_assert(sizeof(FRainParameter) == 0x0000D8, "Wrong size on FRainParameter");
static_assert(offsetof(FRainParameter, FogDensity) == 0x000000, "Member 'FRainParameter::FogDensity' has a wrong offset!");
static_assert(offsetof(FRainParameter, FogHeightFalloff) == 0x000004, "Member 'FRainParameter::FogHeightFalloff' has a wrong offset!");
static_assert(offsetof(FRainParameter, SecondFogDensity) == 0x000008, "Member 'FRainParameter::SecondFogDensity' has a wrong offset!");
static_assert(offsetof(FRainParameter, SecondFogHeightFalloff) == 0x00000C, "Member 'FRainParameter::SecondFogHeightFalloff' has a wrong offset!");
static_assert(offsetof(FRainParameter, FogInscatteringColor) == 0x000010, "Member 'FRainParameter::FogInscatteringColor' has a wrong offset!");
static_assert(offsetof(FRainParameter, FogMaxOpacity) == 0x000020, "Member 'FRainParameter::FogMaxOpacity' has a wrong offset!");
static_assert(offsetof(FRainParameter, StartDistance) == 0x000024, "Member 'FRainParameter::StartDistance' has a wrong offset!");
static_assert(offsetof(FRainParameter, DirectionalInscatteringColor) == 0x000028, "Member 'FRainParameter::DirectionalInscatteringColor' has a wrong offset!");
static_assert(offsetof(FRainParameter, VolumetricFogAlbedo) == 0x000038, "Member 'FRainParameter::VolumetricFogAlbedo' has a wrong offset!");
static_assert(offsetof(FRainParameter, VolumetricFogEmissive) == 0x00003C, "Member 'FRainParameter::VolumetricFogEmissive' has a wrong offset!");
static_assert(offsetof(FRainParameter, LightIntensity) == 0x00004C, "Member 'FRainParameter::LightIntensity' has a wrong offset!");
static_assert(offsetof(FRainParameter, LightColor) == 0x000050, "Member 'FRainParameter::LightColor' has a wrong offset!");
static_assert(offsetof(FRainParameter, RainPostAlpha) == 0x000060, "Member 'FRainParameter::RainPostAlpha' has a wrong offset!");
static_assert(offsetof(FRainParameter, bUseRainPose) == 0x000064, "Member 'FRainParameter::bUseRainPose' has a wrong offset!");
static_assert(offsetof(FRainParameter, ExposureCompensation) == 0x000068, "Member 'FRainParameter::ExposureCompensation' has a wrong offset!");
static_assert(offsetof(FRainParameter, WhiteTemp) == 0x00006C, "Member 'FRainParameter::WhiteTemp' has a wrong offset!");
static_assert(offsetof(FRainParameter, bUseThunder) == 0x000070, "Member 'FRainParameter::bUseThunder' has a wrong offset!");
static_assert(offsetof(FRainParameter, ThunderBreakTime) == 0x000074, "Member 'FRainParameter::ThunderBreakTime' has a wrong offset!");
static_assert(offsetof(FRainParameter, LightingIntensity) == 0x000078, "Member 'FRainParameter::LightingIntensity' has a wrong offset!");
static_assert(offsetof(FRainParameter, bMuteRain) == 0x00007C, "Member 'FRainParameter::bMuteRain' has a wrong offset!");
static_assert(offsetof(FRainParameter, LayerBlend) == 0x000080, "Member 'FRainParameter::LayerBlend' has a wrong offset!");
static_assert(offsetof(FRainParameter, RippleColorTint) == 0x000084, "Member 'FRainParameter::RippleColorTint' has a wrong offset!");
static_assert(offsetof(FRainParameter, RippleTillingScale) == 0x000094, "Member 'FRainParameter::RippleTillingScale' has a wrong offset!");
static_assert(offsetof(FRainParameter, RippleClipScale) == 0x000098, "Member 'FRainParameter::RippleClipScale' has a wrong offset!");
static_assert(offsetof(FRainParameter, RippleSpeedScale) == 0x00009C, "Member 'FRainParameter::RippleSpeedScale' has a wrong offset!");
static_assert(offsetof(FRainParameter, RippleSizeScale) == 0x0000A0, "Member 'FRainParameter::RippleSizeScale' has a wrong offset!");
static_assert(offsetof(FRainParameter, SurfNormalTillingScale) == 0x0000A4, "Member 'FRainParameter::SurfNormalTillingScale' has a wrong offset!");
static_assert(offsetof(FRainParameter, SurfNormalSpeedScale) == 0x0000A8, "Member 'FRainParameter::SurfNormalSpeedScale' has a wrong offset!");
static_assert(offsetof(FRainParameter, SurfNormalFlatScale) == 0x0000AC, "Member 'FRainParameter::SurfNormalFlatScale' has a wrong offset!");
static_assert(offsetof(FRainParameter, RainColorTint) == 0x0000B0, "Member 'FRainParameter::RainColorTint' has a wrong offset!");
static_assert(offsetof(FRainParameter, RainAlphaScale) == 0x0000C0, "Member 'FRainParameter::RainAlphaScale' has a wrong offset!");
static_assert(offsetof(FRainParameter, SceneColorTint1) == 0x0000C4, "Member 'FRainParameter::SceneColorTint1' has a wrong offset!");
static_assert(offsetof(FRainParameter, RainTexID) == 0x0000D4, "Member 'FRainParameter::RainTexID' has a wrong offset!");

// ScriptStruct Weather.SandstormParameter
// 0x0074 (0x0074 - 0x0000)
struct FSandstormParameter final
{
public:
	float                                         FogDensity;                                        // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogHeightFalloff;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           FogInscatteringColor;                              // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FogMaxOpacity;                                     // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StartDistance;                                     // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           DirectionalInscatteringColor;                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ScatteringDistribution;                            // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                 Albedo;                                            // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ViewDistance;                                      // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeFogHeightFalloff;                            // 0x003C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumeFogOpacity;                                  // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VolumetricScatteringIntensity;                     // 0x0044(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LightIntensity;                                    // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LightColor;                                        // 0x004C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           IndirectLightColor;                                // 0x005C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IndirectLightScale;                                // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         RabbonNum;                                         // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FSandstormParameter) == 0x000004, "Wrong alignment on FSandstormParameter");
static_assert(sizeof(FSandstormParameter) == 0x000074, "Wrong size on FSandstormParameter");
static_assert(offsetof(FSandstormParameter, FogDensity) == 0x000000, "Member 'FSandstormParameter::FogDensity' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, FogHeightFalloff) == 0x000004, "Member 'FSandstormParameter::FogHeightFalloff' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, FogInscatteringColor) == 0x000008, "Member 'FSandstormParameter::FogInscatteringColor' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, FogMaxOpacity) == 0x000018, "Member 'FSandstormParameter::FogMaxOpacity' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, StartDistance) == 0x00001C, "Member 'FSandstormParameter::StartDistance' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, DirectionalInscatteringColor) == 0x000020, "Member 'FSandstormParameter::DirectionalInscatteringColor' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, ScatteringDistribution) == 0x000030, "Member 'FSandstormParameter::ScatteringDistribution' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, Albedo) == 0x000034, "Member 'FSandstormParameter::Albedo' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, ViewDistance) == 0x000038, "Member 'FSandstormParameter::ViewDistance' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, VolumeFogHeightFalloff) == 0x00003C, "Member 'FSandstormParameter::VolumeFogHeightFalloff' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, VolumeFogOpacity) == 0x000040, "Member 'FSandstormParameter::VolumeFogOpacity' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, VolumetricScatteringIntensity) == 0x000044, "Member 'FSandstormParameter::VolumetricScatteringIntensity' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, LightIntensity) == 0x000048, "Member 'FSandstormParameter::LightIntensity' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, LightColor) == 0x00004C, "Member 'FSandstormParameter::LightColor' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, IndirectLightColor) == 0x00005C, "Member 'FSandstormParameter::IndirectLightColor' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, IndirectLightScale) == 0x00006C, "Member 'FSandstormParameter::IndirectLightScale' has a wrong offset!");
static_assert(offsetof(FSandstormParameter, RabbonNum) == 0x000070, "Member 'FSandstormParameter::RabbonNum' has a wrong offset!");

// ScriptStruct Weather.WindParameter
// 0x0018 (0x0018 - 0x0000)
struct FWindParameter final
{
public:
	bool                                          bUseDynamicWind;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         TimeDiv;                                           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Speed;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinGustAmount;                                     // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxGustAmount;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothingFactor;                                   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FWindParameter) == 0x000004, "Wrong alignment on FWindParameter");
static_assert(sizeof(FWindParameter) == 0x000018, "Wrong size on FWindParameter");
static_assert(offsetof(FWindParameter, bUseDynamicWind) == 0x000000, "Member 'FWindParameter::bUseDynamicWind' has a wrong offset!");
static_assert(offsetof(FWindParameter, TimeDiv) == 0x000004, "Member 'FWindParameter::TimeDiv' has a wrong offset!");
static_assert(offsetof(FWindParameter, Speed) == 0x000008, "Member 'FWindParameter::Speed' has a wrong offset!");
static_assert(offsetof(FWindParameter, MinGustAmount) == 0x00000C, "Member 'FWindParameter::MinGustAmount' has a wrong offset!");
static_assert(offsetof(FWindParameter, MaxGustAmount) == 0x000010, "Member 'FWindParameter::MaxGustAmount' has a wrong offset!");
