#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeawponSpecialHomingBulletBase

#include "Basic.hpp"

#include "Game_structs.hpp"


namespace SDK::Params
{

// Function WeawponSpecialHomingBulletBase.WeawponSpecialHomingBulletBase_C.ExecuteUbergraph_WeawponSpecialHomingBulletBase
// 0x0030 (0x0030 - 0x0000)
struct WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityComponentBase*                  CallFunc_GetAbility_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGameCharacter*                         CallFunc_GetOriginCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FQueryResult>                   CallFunc_QueryTargetsWithEmitterInfo_ReturnValue;  // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase) == 0x000008, "Wrong alignment on WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase");
static_assert(sizeof(WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase) == 0x000030, "Wrong size on WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase");
static_assert(offsetof(WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase, EntryPoint) == 0x000000, "Member 'WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase, CallFunc_GetAbility_ReturnValue) == 0x000008, "Member 'WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase::CallFunc_GetAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase, CallFunc_GetOriginCharacter_ReturnValue) == 0x000010, "Member 'WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase::CallFunc_GetOriginCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase, CallFunc_QueryTargetsWithEmitterInfo_ReturnValue) == 0x000018, "Member 'WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase::CallFunc_QueryTargetsWithEmitterInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase, CallFunc_Greater_IntInt_ReturnValue) == 0x00002C, "Member 'WeawponSpecialHomingBulletBase_C_ExecuteUbergraph_WeawponSpecialHomingBulletBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");

}

