#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeawponSpecialHomingBulletBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeawponSpecialHomingBulletBase.WeawponSpecialHomingBulletBase_C
// 0x0020 (0x0AD0 - 0x0AB0)
class AWeawponSpecialHomingBulletBase_C final : public AFireBullet
{
public:
	uint8                                         Pad_AA8[0x8];                                      // 0x0AA8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	int32                                         SearchEmitterID;                                   // 0x0AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bLookTarget;                                       // 0x0ABC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_ABD[0x3];                                      // 0x0ABD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RotSpeed;                                          // 0x0AC0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBulletFire();
	void ExecuteUbergraph_WeawponSpecialHomingBulletBase(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeawponSpecialHomingBulletBase_C">();
	}
	static class AWeawponSpecialHomingBulletBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeawponSpecialHomingBulletBase_C>();
	}
};
static_assert(alignof(AWeawponSpecialHomingBulletBase_C) == 0x000010, "Wrong alignment on AWeawponSpecialHomingBulletBase_C");
static_assert(sizeof(AWeawponSpecialHomingBulletBase_C) == 0x000AD0, "Wrong size on AWeawponSpecialHomingBulletBase_C");
static_assert(offsetof(AWeawponSpecialHomingBulletBase_C, UberGraphFrame) == 0x000AB0, "Member 'AWeawponSpecialHomingBulletBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWeawponSpecialHomingBulletBase_C, SearchEmitterID) == 0x000AB8, "Member 'AWeawponSpecialHomingBulletBase_C::SearchEmitterID' has a wrong offset!");
static_assert(offsetof(AWeawponSpecialHomingBulletBase_C, bLookTarget) == 0x000ABC, "Member 'AWeawponSpecialHomingBulletBase_C::bLookTarget' has a wrong offset!");
static_assert(offsetof(AWeawponSpecialHomingBulletBase_C, RotSpeed) == 0x000AC0, "Member 'AWeawponSpecialHomingBulletBase_C::RotSpeed' has a wrong offset!");

}

