#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WildHuntingComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Game_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass WildHuntingComponent.WildHuntingComponent_C
// 0x00A0 (0x0100 - 0x0060)
class UWildHuntingComponent_C final : public UAbilitySpecialAttribute
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FRuntimeFloatCurve                     Curve;                                             // 0x0068(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ElapesTime;                                        // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntervalTime;                                      // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         UM_____;                                           // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick___;                                           // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetAttribute(class UAbilityComponentBase* InOwner, float ChangeValue);
	void K2_ReceiveTick(float DeltaSeconds, const class UAbilityComponentBase* InOwner);
	void ExecuteUbergraph_WildHuntingComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WildHuntingComponent_C">();
	}
	static class UWildHuntingComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWildHuntingComponent_C>();
	}
};
static_assert(alignof(UWildHuntingComponent_C) == 0x000008, "Wrong alignment on UWildHuntingComponent_C");
static_assert(sizeof(UWildHuntingComponent_C) == 0x000100, "Wrong size on UWildHuntingComponent_C");
static_assert(offsetof(UWildHuntingComponent_C, UberGraphFrame) == 0x000060, "Member 'UWildHuntingComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWildHuntingComponent_C, Curve) == 0x000068, "Member 'UWildHuntingComponent_C::Curve' has a wrong offset!");
static_assert(offsetof(UWildHuntingComponent_C, ElapesTime) == 0x0000F0, "Member 'UWildHuntingComponent_C::ElapesTime' has a wrong offset!");
static_assert(offsetof(UWildHuntingComponent_C, IntervalTime) == 0x0000F4, "Member 'UWildHuntingComponent_C::IntervalTime' has a wrong offset!");
static_assert(offsetof(UWildHuntingComponent_C, UM_____) == 0x0000F8, "Member 'UWildHuntingComponent_C::UM_____' has a wrong offset!");
static_assert(offsetof(UWildHuntingComponent_C, Tick___) == 0x0000FC, "Member 'UWildHuntingComponent_C::Tick___' has a wrong offset!");

}

