#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WildHuntingComponent

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WildHuntingComponent.WildHuntingComponent_C
// 0x00A0 (0x0100 - 0x0060)
class UWildHuntingComponent_C final : public UAbilitySpecialAttribute
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FRuntimeFloatCurve                     Curve;                                             // 0x0068(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         ElapesTime;                                        // 0x00F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntervalTime;                                      // 0x00F4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         单位时间回复量;                                    // 0x00F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Tick回复量;                                        // 0x00FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void SetAttribute(class UAbilityComponentBase* InOwner, float ChangeValue);
	void K2_ReceiveTick(float DeltaSeconds, const class UAbilityComponentBase* InOwner);
	void ExecuteUbergraph_WildHuntingComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WildHuntingComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WildHuntingComponent_C")
	}
	static class UWildHuntingComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWildHuntingComponent_C>();
	}
};
DUMPER7_ASSERTS_UWildHuntingComponent_C;

}

