#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wwise

#include "Basic.hpp"

#include "Wwise_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Wwise.WwiseAmbientSound.IsPlaying
// 0x0001 (0x0001 - 0x0000)
struct WwiseAmbientSound_IsPlaying final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseAmbientSound_IsPlaying) == 0x000001, "Wrong alignment on WwiseAmbientSound_IsPlaying");
static_assert(sizeof(WwiseAmbientSound_IsPlaying) == 0x000001, "Wrong size on WwiseAmbientSound_IsPlaying");
static_assert(offsetof(WwiseAmbientSound_IsPlaying, ReturnValue) == 0x000000, "Member 'WwiseAmbientSound_IsPlaying::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseAmbientSound.IsPlayingT
// 0x0001 (0x0001 - 0x0000)
struct WwiseAmbientSound_IsPlayingT final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseAmbientSound_IsPlayingT) == 0x000001, "Wrong alignment on WwiseAmbientSound_IsPlayingT");
static_assert(sizeof(WwiseAmbientSound_IsPlayingT) == 0x000001, "Wrong size on WwiseAmbientSound_IsPlayingT");
static_assert(offsetof(WwiseAmbientSound_IsPlayingT, ReturnValue) == 0x000000, "Member 'WwiseAmbientSound_IsPlayingT::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseComponent.SetbDefaultUseSpatialAudio
// 0x0001 (0x0001 - 0x0000)
struct WwiseComponent_SetbDefaultUseSpatialAudio final
{
public:
	bool                                          bInDefaultUseSpatialAudio;                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_SetbDefaultUseSpatialAudio) == 0x000001, "Wrong alignment on WwiseComponent_SetbDefaultUseSpatialAudio");
static_assert(sizeof(WwiseComponent_SetbDefaultUseSpatialAudio) == 0x000001, "Wrong size on WwiseComponent_SetbDefaultUseSpatialAudio");
static_assert(offsetof(WwiseComponent_SetbDefaultUseSpatialAudio, bInDefaultUseSpatialAudio) == 0x000000, "Member 'WwiseComponent_SetbDefaultUseSpatialAudio::bInDefaultUseSpatialAudio' has a wrong offset!");

// Function Wwise.WwiseComponent.IsPlayingSomething
// 0x0001 (0x0001 - 0x0000)
struct WwiseComponent_IsPlayingSomething final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_IsPlayingSomething) == 0x000001, "Wrong alignment on WwiseComponent_IsPlayingSomething");
static_assert(sizeof(WwiseComponent_IsPlayingSomething) == 0x000001, "Wrong size on WwiseComponent_IsPlayingSomething");
static_assert(offsetof(WwiseComponent_IsPlayingSomething, ReturnValue) == 0x000000, "Member 'WwiseComponent_IsPlayingSomething::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseComponent.PauseWithTransition
// 0x0004 (0x0004 - 0x0000)
struct WwiseComponent_PauseWithTransition final
{
public:
	int32                                         InTransitionMS;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_PauseWithTransition) == 0x000004, "Wrong alignment on WwiseComponent_PauseWithTransition");
static_assert(sizeof(WwiseComponent_PauseWithTransition) == 0x000004, "Wrong size on WwiseComponent_PauseWithTransition");
static_assert(offsetof(WwiseComponent_PauseWithTransition, InTransitionMS) == 0x000000, "Member 'WwiseComponent_PauseWithTransition::InTransitionMS' has a wrong offset!");

// Function Wwise.WwiseComponent.PostEvent
// 0x0010 (0x0010 - 0x0000)
struct WwiseComponent_PostEvent final
{
public:
	class FString                                 InEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_PostEvent) == 0x000008, "Wrong alignment on WwiseComponent_PostEvent");
static_assert(sizeof(WwiseComponent_PostEvent) == 0x000010, "Wrong size on WwiseComponent_PostEvent");
static_assert(offsetof(WwiseComponent_PostEvent, InEventName) == 0x000000, "Member 'WwiseComponent_PostEvent::InEventName' has a wrong offset!");

// Function Wwise.WwiseComponent.PostEventWithCallback
// 0x0028 (0x0028 - 0x0000)
struct WwiseComponent_PostEventWithCallback final
{
public:
	class FString                                 InEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UWwiseComponent* WwiseComponent)> OnEndPlay;                                         // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bEnablePlayInfo;                                   // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_PostEventWithCallback) == 0x000008, "Wrong alignment on WwiseComponent_PostEventWithCallback");
static_assert(sizeof(WwiseComponent_PostEventWithCallback) == 0x000028, "Wrong size on WwiseComponent_PostEventWithCallback");
static_assert(offsetof(WwiseComponent_PostEventWithCallback, InEventName) == 0x000000, "Member 'WwiseComponent_PostEventWithCallback::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseComponent_PostEventWithCallback, OnEndPlay) == 0x000010, "Member 'WwiseComponent_PostEventWithCallback::OnEndPlay' has a wrong offset!");
static_assert(offsetof(WwiseComponent_PostEventWithCallback, bEnablePlayInfo) == 0x000020, "Member 'WwiseComponent_PostEventWithCallback::bEnablePlayInfo' has a wrong offset!");
static_assert(offsetof(WwiseComponent_PostEventWithCallback, ReturnValue) == 0x000024, "Member 'WwiseComponent_PostEventWithCallback::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseComponent.PostTrigger
// 0x0010 (0x0010 - 0x0000)
struct WwiseComponent_PostTrigger final
{
public:
	class FString                                 InTriggerName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_PostTrigger) == 0x000008, "Wrong alignment on WwiseComponent_PostTrigger");
static_assert(sizeof(WwiseComponent_PostTrigger) == 0x000010, "Wrong size on WwiseComponent_PostTrigger");
static_assert(offsetof(WwiseComponent_PostTrigger, InTriggerName) == 0x000000, "Member 'WwiseComponent_PostTrigger::InTriggerName' has a wrong offset!");

// Function Wwise.WwiseComponent.RestoreDefaultVolume
// 0x0018 (0x0018 - 0x0000)
struct WwiseComponent_RestoreDefaultVolume final
{
public:
	class FString                                 InRTPCName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDurationSec;                                     // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseComponent_RestoreDefaultVolume) == 0x000008, "Wrong alignment on WwiseComponent_RestoreDefaultVolume");
static_assert(sizeof(WwiseComponent_RestoreDefaultVolume) == 0x000018, "Wrong size on WwiseComponent_RestoreDefaultVolume");
static_assert(offsetof(WwiseComponent_RestoreDefaultVolume, InRTPCName) == 0x000000, "Member 'WwiseComponent_RestoreDefaultVolume::InRTPCName' has a wrong offset!");
static_assert(offsetof(WwiseComponent_RestoreDefaultVolume, InDurationSec) == 0x000010, "Member 'WwiseComponent_RestoreDefaultVolume::InDurationSec' has a wrong offset!");

// Function Wwise.WwiseComponent.ResumeWithTransition
// 0x0004 (0x0004 - 0x0000)
struct WwiseComponent_ResumeWithTransition final
{
public:
	int32                                         InTransitionMS;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_ResumeWithTransition) == 0x000004, "Wrong alignment on WwiseComponent_ResumeWithTransition");
static_assert(sizeof(WwiseComponent_ResumeWithTransition) == 0x000004, "Wrong size on WwiseComponent_ResumeWithTransition");
static_assert(offsetof(WwiseComponent_ResumeWithTransition, InTransitionMS) == 0x000000, "Member 'WwiseComponent_ResumeWithTransition::InTransitionMS' has a wrong offset!");

// Function Wwise.WwiseComponent.SetAttenuationScalingFactor
// 0x0004 (0x0004 - 0x0000)
struct WwiseComponent_SetAttenuationScalingFactor final
{
public:
	float                                         InValue;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_SetAttenuationScalingFactor) == 0x000004, "Wrong alignment on WwiseComponent_SetAttenuationScalingFactor");
static_assert(sizeof(WwiseComponent_SetAttenuationScalingFactor) == 0x000004, "Wrong size on WwiseComponent_SetAttenuationScalingFactor");
static_assert(offsetof(WwiseComponent_SetAttenuationScalingFactor, InValue) == 0x000000, "Member 'WwiseComponent_SetAttenuationScalingFactor::InValue' has a wrong offset!");

// Function Wwise.WwiseComponent.SetRTPCValue
// 0x0020 (0x0020 - 0x0000)
struct WwiseComponent_SetRTPCValue final
{
public:
	class FString                                 InRTPCName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InValue;                                           // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InInterpMS;                                        // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ERTPCValueCurveType                           InCurveType;                                       // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseComponent_SetRTPCValue) == 0x000008, "Wrong alignment on WwiseComponent_SetRTPCValue");
static_assert(sizeof(WwiseComponent_SetRTPCValue) == 0x000020, "Wrong size on WwiseComponent_SetRTPCValue");
static_assert(offsetof(WwiseComponent_SetRTPCValue, InRTPCName) == 0x000000, "Member 'WwiseComponent_SetRTPCValue::InRTPCName' has a wrong offset!");
static_assert(offsetof(WwiseComponent_SetRTPCValue, InValue) == 0x000010, "Member 'WwiseComponent_SetRTPCValue::InValue' has a wrong offset!");
static_assert(offsetof(WwiseComponent_SetRTPCValue, InInterpMS) == 0x000014, "Member 'WwiseComponent_SetRTPCValue::InInterpMS' has a wrong offset!");
static_assert(offsetof(WwiseComponent_SetRTPCValue, InCurveType) == 0x000018, "Member 'WwiseComponent_SetRTPCValue::InCurveType' has a wrong offset!");

// Function Wwise.WwiseComponent.SetSwitch
// 0x0020 (0x0020 - 0x0000)
struct WwiseComponent_SetSwitch final
{
public:
	class FString                                 InSwitchGroup;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InSwitchState;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_SetSwitch) == 0x000008, "Wrong alignment on WwiseComponent_SetSwitch");
static_assert(sizeof(WwiseComponent_SetSwitch) == 0x000020, "Wrong size on WwiseComponent_SetSwitch");
static_assert(offsetof(WwiseComponent_SetSwitch, InSwitchGroup) == 0x000000, "Member 'WwiseComponent_SetSwitch::InSwitchGroup' has a wrong offset!");
static_assert(offsetof(WwiseComponent_SetSwitch, InSwitchState) == 0x000010, "Member 'WwiseComponent_SetSwitch::InSwitchState' has a wrong offset!");

// Function Wwise.WwiseComponent.SetUseSpatialAudio
// 0x0001 (0x0001 - 0x0000)
struct WwiseComponent_SetUseSpatialAudio final
{
public:
	bool                                          bNewEnable;                                        // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_SetUseSpatialAudio) == 0x000001, "Wrong alignment on WwiseComponent_SetUseSpatialAudio");
static_assert(sizeof(WwiseComponent_SetUseSpatialAudio) == 0x000001, "Wrong size on WwiseComponent_SetUseSpatialAudio");
static_assert(offsetof(WwiseComponent_SetUseSpatialAudio, bNewEnable) == 0x000000, "Member 'WwiseComponent_SetUseSpatialAudio::bNewEnable' has a wrong offset!");

// Function Wwise.WwiseComponent.SetVolume
// 0x0020 (0x0020 - 0x0000)
struct WwiseComponent_SetVolume final
{
public:
	float                                         InVolumeValue;                                     // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDurationSec;                                     // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InRTPCName;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInBasedDefaultVolume;                             // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseComponent_SetVolume) == 0x000008, "Wrong alignment on WwiseComponent_SetVolume");
static_assert(sizeof(WwiseComponent_SetVolume) == 0x000020, "Wrong size on WwiseComponent_SetVolume");
static_assert(offsetof(WwiseComponent_SetVolume, InVolumeValue) == 0x000000, "Member 'WwiseComponent_SetVolume::InVolumeValue' has a wrong offset!");
static_assert(offsetof(WwiseComponent_SetVolume, InDurationSec) == 0x000004, "Member 'WwiseComponent_SetVolume::InDurationSec' has a wrong offset!");
static_assert(offsetof(WwiseComponent_SetVolume, InRTPCName) == 0x000008, "Member 'WwiseComponent_SetVolume::InRTPCName' has a wrong offset!");
static_assert(offsetof(WwiseComponent_SetVolume, bInBasedDefaultVolume) == 0x000018, "Member 'WwiseComponent_SetVolume::bInBasedDefaultVolume' has a wrong offset!");

// Function Wwise.WwiseComponent.SetVolumeMultipleBasedDefault
// 0x0018 (0x0018 - 0x0000)
struct WwiseComponent_SetVolumeMultipleBasedDefault final
{
public:
	class FString                                 InRTPCName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InMultiple;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDurationSec;                                     // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_SetVolumeMultipleBasedDefault) == 0x000008, "Wrong alignment on WwiseComponent_SetVolumeMultipleBasedDefault");
static_assert(sizeof(WwiseComponent_SetVolumeMultipleBasedDefault) == 0x000018, "Wrong size on WwiseComponent_SetVolumeMultipleBasedDefault");
static_assert(offsetof(WwiseComponent_SetVolumeMultipleBasedDefault, InRTPCName) == 0x000000, "Member 'WwiseComponent_SetVolumeMultipleBasedDefault::InRTPCName' has a wrong offset!");
static_assert(offsetof(WwiseComponent_SetVolumeMultipleBasedDefault, InMultiple) == 0x000010, "Member 'WwiseComponent_SetVolumeMultipleBasedDefault::InMultiple' has a wrong offset!");
static_assert(offsetof(WwiseComponent_SetVolumeMultipleBasedDefault, InDurationSec) == 0x000014, "Member 'WwiseComponent_SetVolumeMultipleBasedDefault::InDurationSec' has a wrong offset!");

// Function Wwise.WwiseComponent.Stop
// 0x0001 (0x0001 - 0x0000)
struct WwiseComponent_Stop final
{
public:
	bool                                          bInvokeCallbacks;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseComponent_Stop) == 0x000001, "Wrong alignment on WwiseComponent_Stop");
static_assert(sizeof(WwiseComponent_Stop) == 0x000001, "Wrong size on WwiseComponent_Stop");
static_assert(offsetof(WwiseComponent_Stop, bInvokeCallbacks) == 0x000000, "Member 'WwiseComponent_Stop::bInvokeCallbacks' has a wrong offset!");

// Function Wwise.WwiseComponent.StopWithTransition
// 0x0008 (0x0008 - 0x0000)
struct WwiseComponent_StopWithTransition final
{
public:
	int32                                         InTransitionMS;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInvokeCallbacks;                                  // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseComponent_StopWithTransition) == 0x000004, "Wrong alignment on WwiseComponent_StopWithTransition");
static_assert(sizeof(WwiseComponent_StopWithTransition) == 0x000008, "Wrong size on WwiseComponent_StopWithTransition");
static_assert(offsetof(WwiseComponent_StopWithTransition, InTransitionMS) == 0x000000, "Member 'WwiseComponent_StopWithTransition::InTransitionMS' has a wrong offset!");
static_assert(offsetof(WwiseComponent_StopWithTransition, bInvokeCallbacks) == 0x000004, "Member 'WwiseComponent_StopWithTransition::bInvokeCallbacks' has a wrong offset!");

// Function Wwise.WwiseLibrary.AddDefaultListener
// 0x0008 (0x0008 - 0x0000)
struct WwiseLibrary_AddDefaultListener final
{
public:
	class UWwiseComponent*                        InWwiseComponent;                                  // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_AddDefaultListener) == 0x000008, "Wrong alignment on WwiseLibrary_AddDefaultListener");
static_assert(sizeof(WwiseLibrary_AddDefaultListener) == 0x000008, "Wrong size on WwiseLibrary_AddDefaultListener");
static_assert(offsetof(WwiseLibrary_AddDefaultListener, InWwiseComponent) == 0x000000, "Member 'WwiseLibrary_AddDefaultListener::InWwiseComponent' has a wrong offset!");

// Function Wwise.WwiseLibrary.AddSequenceWwiseComponent
// 0x0008 (0x0008 - 0x0000)
struct WwiseLibrary_AddSequenceWwiseComponent final
{
public:
	class UWwiseComponent*                        InComponent;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_AddSequenceWwiseComponent) == 0x000008, "Wrong alignment on WwiseLibrary_AddSequenceWwiseComponent");
static_assert(sizeof(WwiseLibrary_AddSequenceWwiseComponent) == 0x000008, "Wrong size on WwiseLibrary_AddSequenceWwiseComponent");
static_assert(offsetof(WwiseLibrary_AddSequenceWwiseComponent, InComponent) == 0x000000, "Member 'WwiseLibrary_AddSequenceWwiseComponent::InComponent' has a wrong offset!");

// Function Wwise.WwiseLibrary.AsyncLoadBankByBank
// 0x0010 (0x0010 - 0x0000)
struct WwiseLibrary_AsyncLoadBankByBank final
{
public:
	TArray<int32>                                 InBankIds;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_AsyncLoadBankByBank) == 0x000008, "Wrong alignment on WwiseLibrary_AsyncLoadBankByBank");
static_assert(sizeof(WwiseLibrary_AsyncLoadBankByBank) == 0x000010, "Wrong size on WwiseLibrary_AsyncLoadBankByBank");
static_assert(offsetof(WwiseLibrary_AsyncLoadBankByBank, InBankIds) == 0x000000, "Member 'WwiseLibrary_AsyncLoadBankByBank::InBankIds' has a wrong offset!");

// Function Wwise.WwiseLibrary.AsyncLoadBankByEvent
// 0x0010 (0x0010 - 0x0000)
struct WwiseLibrary_AsyncLoadBankByEvent final
{
public:
	TArray<class FString>                         InEventNames;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_AsyncLoadBankByEvent) == 0x000008, "Wrong alignment on WwiseLibrary_AsyncLoadBankByEvent");
static_assert(sizeof(WwiseLibrary_AsyncLoadBankByEvent) == 0x000010, "Wrong size on WwiseLibrary_AsyncLoadBankByEvent");
static_assert(offsetof(WwiseLibrary_AsyncLoadBankByEvent, InEventNames) == 0x000000, "Member 'WwiseLibrary_AsyncLoadBankByEvent::InEventNames' has a wrong offset!");

// Function Wwise.WwiseLibrary.AsyncUnloadBanksByEvent
// 0x0010 (0x0010 - 0x0000)
struct WwiseLibrary_AsyncUnloadBanksByEvent final
{
public:
	TArray<class FString>                         InEventNames;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_AsyncUnloadBanksByEvent) == 0x000008, "Wrong alignment on WwiseLibrary_AsyncUnloadBanksByEvent");
static_assert(sizeof(WwiseLibrary_AsyncUnloadBanksByEvent) == 0x000010, "Wrong size on WwiseLibrary_AsyncUnloadBanksByEvent");
static_assert(offsetof(WwiseLibrary_AsyncUnloadBanksByEvent, InEventNames) == 0x000000, "Member 'WwiseLibrary_AsyncUnloadBanksByEvent::InEventNames' has a wrong offset!");

// Function Wwise.WwiseLibrary.ClearAllModifiedBankLanguage
// 0x0001 (0x0001 - 0x0000)
struct WwiseLibrary_ClearAllModifiedBankLanguage final
{
public:
	bool                                          bInUnloadBank;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_ClearAllModifiedBankLanguage) == 0x000001, "Wrong alignment on WwiseLibrary_ClearAllModifiedBankLanguage");
static_assert(sizeof(WwiseLibrary_ClearAllModifiedBankLanguage) == 0x000001, "Wrong size on WwiseLibrary_ClearAllModifiedBankLanguage");
static_assert(offsetof(WwiseLibrary_ClearAllModifiedBankLanguage, bInUnloadBank) == 0x000000, "Member 'WwiseLibrary_ClearAllModifiedBankLanguage::bInUnloadBank' has a wrong offset!");

// Function Wwise.WwiseLibrary.ClearModifiedBankLanguage
// 0x0018 (0x0018 - 0x0000)
struct WwiseLibrary_ClearModifiedBankLanguage final
{
public:
	class FString                                 InBankName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInUnloadBank;                                     // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseLibrary_ClearModifiedBankLanguage) == 0x000008, "Wrong alignment on WwiseLibrary_ClearModifiedBankLanguage");
static_assert(sizeof(WwiseLibrary_ClearModifiedBankLanguage) == 0x000018, "Wrong size on WwiseLibrary_ClearModifiedBankLanguage");
static_assert(offsetof(WwiseLibrary_ClearModifiedBankLanguage, InBankName) == 0x000000, "Member 'WwiseLibrary_ClearModifiedBankLanguage::InBankName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_ClearModifiedBankLanguage, bInUnloadBank) == 0x000010, "Member 'WwiseLibrary_ClearModifiedBankLanguage::bInUnloadBank' has a wrong offset!");

// Function Wwise.WwiseLibrary.ClearSequcneWwiseComponents
// 0x0001 (0x0001 - 0x0000)
struct WwiseLibrary_ClearSequcneWwiseComponents final
{
public:
	bool                                          bInStop;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_ClearSequcneWwiseComponents) == 0x000001, "Wrong alignment on WwiseLibrary_ClearSequcneWwiseComponents");
static_assert(sizeof(WwiseLibrary_ClearSequcneWwiseComponents) == 0x000001, "Wrong size on WwiseLibrary_ClearSequcneWwiseComponents");
static_assert(offsetof(WwiseLibrary_ClearSequcneWwiseComponents, bInStop) == 0x000000, "Member 'WwiseLibrary_ClearSequcneWwiseComponents::bInStop' has a wrong offset!");

// Function Wwise.WwiseLibrary.GetBankByEvent
// 0x0018 (0x0018 - 0x0000)
struct WwiseLibrary_GetBankByEvent final
{
public:
	class FString                                 InEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseLibrary_GetBankByEvent) == 0x000008, "Wrong alignment on WwiseLibrary_GetBankByEvent");
static_assert(sizeof(WwiseLibrary_GetBankByEvent) == 0x000018, "Wrong size on WwiseLibrary_GetBankByEvent");
static_assert(offsetof(WwiseLibrary_GetBankByEvent, InEventName) == 0x000000, "Member 'WwiseLibrary_GetBankByEvent::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_GetBankByEvent, ReturnValue) == 0x000010, "Member 'WwiseLibrary_GetBankByEvent::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.GetBankNameByEvent
// 0x0020 (0x0020 - 0x0000)
struct WwiseLibrary_GetBankNameByEvent final
{
public:
	class FString                                 InEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_GetBankNameByEvent) == 0x000008, "Wrong alignment on WwiseLibrary_GetBankNameByEvent");
static_assert(sizeof(WwiseLibrary_GetBankNameByEvent) == 0x000020, "Wrong size on WwiseLibrary_GetBankNameByEvent");
static_assert(offsetof(WwiseLibrary_GetBankNameByEvent, InEventName) == 0x000000, "Member 'WwiseLibrary_GetBankNameByEvent::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_GetBankNameByEvent, ReturnValue) == 0x000010, "Member 'WwiseLibrary_GetBankNameByEvent::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.GetEventDuration
// 0x0018 (0x0018 - 0x0000)
struct WwiseLibrary_GetEventDuration final
{
public:
	class FString                                 InEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseLibrary_GetEventDuration) == 0x000008, "Wrong alignment on WwiseLibrary_GetEventDuration");
static_assert(sizeof(WwiseLibrary_GetEventDuration) == 0x000018, "Wrong size on WwiseLibrary_GetEventDuration");
static_assert(offsetof(WwiseLibrary_GetEventDuration, InEventName) == 0x000000, "Member 'WwiseLibrary_GetEventDuration::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_GetEventDuration, ReturnValue) == 0x000010, "Member 'WwiseLibrary_GetEventDuration::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.GetLanguage
// 0x0010 (0x0010 - 0x0000)
struct WwiseLibrary_GetLanguage final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_GetLanguage) == 0x000008, "Wrong alignment on WwiseLibrary_GetLanguage");
static_assert(sizeof(WwiseLibrary_GetLanguage) == 0x000010, "Wrong size on WwiseLibrary_GetLanguage");
static_assert(offsetof(WwiseLibrary_GetLanguage, ReturnValue) == 0x000000, "Member 'WwiseLibrary_GetLanguage::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.GetModifiedBankLanguage
// 0x0020 (0x0020 - 0x0000)
struct WwiseLibrary_GetModifiedBankLanguage final
{
public:
	class FString                                 InBankName;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_GetModifiedBankLanguage) == 0x000008, "Wrong alignment on WwiseLibrary_GetModifiedBankLanguage");
static_assert(sizeof(WwiseLibrary_GetModifiedBankLanguage) == 0x000020, "Wrong size on WwiseLibrary_GetModifiedBankLanguage");
static_assert(offsetof(WwiseLibrary_GetModifiedBankLanguage, InBankName) == 0x000000, "Member 'WwiseLibrary_GetModifiedBankLanguage::InBankName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_GetModifiedBankLanguage, ReturnValue) == 0x000010, "Member 'WwiseLibrary_GetModifiedBankLanguage::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.GetModifiedBankLanguageByID
// 0x0018 (0x0018 - 0x0000)
struct WwiseLibrary_GetModifiedBankLanguageByID final
{
public:
	int32                                         InBankID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_GetModifiedBankLanguageByID) == 0x000008, "Wrong alignment on WwiseLibrary_GetModifiedBankLanguageByID");
static_assert(sizeof(WwiseLibrary_GetModifiedBankLanguageByID) == 0x000018, "Wrong size on WwiseLibrary_GetModifiedBankLanguageByID");
static_assert(offsetof(WwiseLibrary_GetModifiedBankLanguageByID, InBankID) == 0x000000, "Member 'WwiseLibrary_GetModifiedBankLanguageByID::InBankID' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_GetModifiedBankLanguageByID, ReturnValue) == 0x000008, "Member 'WwiseLibrary_GetModifiedBankLanguageByID::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.GetRecordEventNames
// 0x0010 (0x0010 - 0x0000)
struct WwiseLibrary_GetRecordEventNames final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_GetRecordEventNames) == 0x000008, "Wrong alignment on WwiseLibrary_GetRecordEventNames");
static_assert(sizeof(WwiseLibrary_GetRecordEventNames) == 0x000010, "Wrong size on WwiseLibrary_GetRecordEventNames");
static_assert(offsetof(WwiseLibrary_GetRecordEventNames, ReturnValue) == 0x000000, "Member 'WwiseLibrary_GetRecordEventNames::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.GetVolumeScale
// 0x0018 (0x0018 - 0x0000)
struct WwiseLibrary_GetVolumeScale final
{
public:
	class FString                                 InBusName;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseLibrary_GetVolumeScale) == 0x000008, "Wrong alignment on WwiseLibrary_GetVolumeScale");
static_assert(sizeof(WwiseLibrary_GetVolumeScale) == 0x000018, "Wrong size on WwiseLibrary_GetVolumeScale");
static_assert(offsetof(WwiseLibrary_GetVolumeScale, InBusName) == 0x000000, "Member 'WwiseLibrary_GetVolumeScale::InBusName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_GetVolumeScale, ReturnValue) == 0x000010, "Member 'WwiseLibrary_GetVolumeScale::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.GetWwiseActorType
// 0x0010 (0x0010 - 0x0000)
struct WwiseLibrary_GetWwiseActorType final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseActorType                               ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseLibrary_GetWwiseActorType) == 0x000008, "Wrong alignment on WwiseLibrary_GetWwiseActorType");
static_assert(sizeof(WwiseLibrary_GetWwiseActorType) == 0x000010, "Wrong size on WwiseLibrary_GetWwiseActorType");
static_assert(offsetof(WwiseLibrary_GetWwiseActorType, InWorldContext) == 0x000000, "Member 'WwiseLibrary_GetWwiseActorType::InWorldContext' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_GetWwiseActorType, ReturnValue) == 0x000008, "Member 'WwiseLibrary_GetWwiseActorType::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.GetWwiseQuality
// 0x0001 (0x0001 - 0x0000)
struct WwiseLibrary_GetWwiseQuality final
{
public:
	EWwiseQuality                                 ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_GetWwiseQuality) == 0x000001, "Wrong alignment on WwiseLibrary_GetWwiseQuality");
static_assert(sizeof(WwiseLibrary_GetWwiseQuality) == 0x000001, "Wrong size on WwiseLibrary_GetWwiseQuality");
static_assert(offsetof(WwiseLibrary_GetWwiseQuality, ReturnValue) == 0x000000, "Member 'WwiseLibrary_GetWwiseQuality::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.IsDisable
// 0x0001 (0x0001 - 0x0000)
struct WwiseLibrary_IsDisable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_IsDisable) == 0x000001, "Wrong alignment on WwiseLibrary_IsDisable");
static_assert(sizeof(WwiseLibrary_IsDisable) == 0x000001, "Wrong size on WwiseLibrary_IsDisable");
static_assert(offsetof(WwiseLibrary_IsDisable, ReturnValue) == 0x000000, "Member 'WwiseLibrary_IsDisable::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.IsExceededMaxNumOfPlayEvent
// 0x0018 (0x0018 - 0x0000)
struct WwiseLibrary_IsExceededMaxNumOfPlayEvent final
{
public:
	class FString                                 InEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseLibrary_IsExceededMaxNumOfPlayEvent) == 0x000008, "Wrong alignment on WwiseLibrary_IsExceededMaxNumOfPlayEvent");
static_assert(sizeof(WwiseLibrary_IsExceededMaxNumOfPlayEvent) == 0x000018, "Wrong size on WwiseLibrary_IsExceededMaxNumOfPlayEvent");
static_assert(offsetof(WwiseLibrary_IsExceededMaxNumOfPlayEvent, InEventName) == 0x000000, "Member 'WwiseLibrary_IsExceededMaxNumOfPlayEvent::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_IsExceededMaxNumOfPlayEvent, ReturnValue) == 0x000010, "Member 'WwiseLibrary_IsExceededMaxNumOfPlayEvent::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.IsExistVoiceEvent
// 0x0018 (0x0018 - 0x0000)
struct WwiseLibrary_IsExistVoiceEvent final
{
public:
	class FString                                 InVoiceEventName;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseLibrary_IsExistVoiceEvent) == 0x000008, "Wrong alignment on WwiseLibrary_IsExistVoiceEvent");
static_assert(sizeof(WwiseLibrary_IsExistVoiceEvent) == 0x000018, "Wrong size on WwiseLibrary_IsExistVoiceEvent");
static_assert(offsetof(WwiseLibrary_IsExistVoiceEvent, InVoiceEventName) == 0x000000, "Member 'WwiseLibrary_IsExistVoiceEvent::InVoiceEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_IsExistVoiceEvent, ReturnValue) == 0x000010, "Member 'WwiseLibrary_IsExistVoiceEvent::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.IsLoopedEvent
// 0x0018 (0x0018 - 0x0000)
struct WwiseLibrary_IsLoopedEvent final
{
public:
	class FString                                 InEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseLibrary_IsLoopedEvent) == 0x000008, "Wrong alignment on WwiseLibrary_IsLoopedEvent");
static_assert(sizeof(WwiseLibrary_IsLoopedEvent) == 0x000018, "Wrong size on WwiseLibrary_IsLoopedEvent");
static_assert(offsetof(WwiseLibrary_IsLoopedEvent, InEventName) == 0x000000, "Member 'WwiseLibrary_IsLoopedEvent::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_IsLoopedEvent, ReturnValue) == 0x000010, "Member 'WwiseLibrary_IsLoopedEvent::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.IsLowAmmunitionEffect
// 0x0002 (0x0002 - 0x0000)
struct WwiseLibrary_IsLowAmmunitionEffect final
{
public:
	EWwiseQuality                                 InWwiseQuality;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_IsLowAmmunitionEffect) == 0x000001, "Wrong alignment on WwiseLibrary_IsLowAmmunitionEffect");
static_assert(sizeof(WwiseLibrary_IsLowAmmunitionEffect) == 0x000002, "Wrong size on WwiseLibrary_IsLowAmmunitionEffect");
static_assert(offsetof(WwiseLibrary_IsLowAmmunitionEffect, InWwiseQuality) == 0x000000, "Member 'WwiseLibrary_IsLowAmmunitionEffect::InWwiseQuality' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_IsLowAmmunitionEffect, ReturnValue) == 0x000001, "Member 'WwiseLibrary_IsLowAmmunitionEffect::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.IsSupportAsyncLoadBank
// 0x0001 (0x0001 - 0x0000)
struct WwiseLibrary_IsSupportAsyncLoadBank final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_IsSupportAsyncLoadBank) == 0x000001, "Wrong alignment on WwiseLibrary_IsSupportAsyncLoadBank");
static_assert(sizeof(WwiseLibrary_IsSupportAsyncLoadBank) == 0x000001, "Wrong size on WwiseLibrary_IsSupportAsyncLoadBank");
static_assert(offsetof(WwiseLibrary_IsSupportAsyncLoadBank, ReturnValue) == 0x000000, "Member 'WwiseLibrary_IsSupportAsyncLoadBank::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.IsWwiseQuality
// 0x0002 (0x0002 - 0x0000)
struct WwiseLibrary_IsWwiseQuality final
{
public:
	EWwiseQuality                                 InWwiseQuality;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_IsWwiseQuality) == 0x000001, "Wrong alignment on WwiseLibrary_IsWwiseQuality");
static_assert(sizeof(WwiseLibrary_IsWwiseQuality) == 0x000002, "Wrong size on WwiseLibrary_IsWwiseQuality");
static_assert(offsetof(WwiseLibrary_IsWwiseQuality, InWwiseQuality) == 0x000000, "Member 'WwiseLibrary_IsWwiseQuality::InWwiseQuality' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_IsWwiseQuality, ReturnValue) == 0x000001, "Member 'WwiseLibrary_IsWwiseQuality::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.LoadBanksByBank
// 0x0010 (0x0010 - 0x0000)
struct WwiseLibrary_LoadBanksByBank final
{
public:
	TArray<int32>                                 InBankIds;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_LoadBanksByBank) == 0x000008, "Wrong alignment on WwiseLibrary_LoadBanksByBank");
static_assert(sizeof(WwiseLibrary_LoadBanksByBank) == 0x000010, "Wrong size on WwiseLibrary_LoadBanksByBank");
static_assert(offsetof(WwiseLibrary_LoadBanksByBank, InBankIds) == 0x000000, "Member 'WwiseLibrary_LoadBanksByBank::InBankIds' has a wrong offset!");

// Function Wwise.WwiseLibrary.LoadBanksByEvent
// 0x0010 (0x0010 - 0x0000)
struct WwiseLibrary_LoadBanksByEvent final
{
public:
	TArray<class FString>                         InEventNames;                                      // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_LoadBanksByEvent) == 0x000008, "Wrong alignment on WwiseLibrary_LoadBanksByEvent");
static_assert(sizeof(WwiseLibrary_LoadBanksByEvent) == 0x000010, "Wrong size on WwiseLibrary_LoadBanksByEvent");
static_assert(offsetof(WwiseLibrary_LoadBanksByEvent, InEventNames) == 0x000000, "Member 'WwiseLibrary_LoadBanksByEvent::InEventNames' has a wrong offset!");

// Function Wwise.WwiseLibrary.PauseAllWwiseEvents
// 0x0004 (0x0004 - 0x0000)
struct WwiseLibrary_PauseAllWwiseEvents final
{
public:
	int32                                         InTransitionDuration;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_PauseAllWwiseEvents) == 0x000004, "Wrong alignment on WwiseLibrary_PauseAllWwiseEvents");
static_assert(sizeof(WwiseLibrary_PauseAllWwiseEvents) == 0x000004, "Wrong size on WwiseLibrary_PauseAllWwiseEvents");
static_assert(offsetof(WwiseLibrary_PauseAllWwiseEvents, InTransitionDuration) == 0x000000, "Member 'WwiseLibrary_PauseAllWwiseEvents::InTransitionDuration' has a wrong offset!");

// Function Wwise.WwiseLibrary.PauseOnEvent
// 0x0018 (0x0018 - 0x0000)
struct WwiseLibrary_PauseOnEvent final
{
public:
	class FString                                 InEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTransitionDuration;                              // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(WwiseLibrary_PauseOnEvent) == 0x000008, "Wrong alignment on WwiseLibrary_PauseOnEvent");
static_assert(sizeof(WwiseLibrary_PauseOnEvent) == 0x000018, "Wrong size on WwiseLibrary_PauseOnEvent");
static_assert(offsetof(WwiseLibrary_PauseOnEvent, InEventName) == 0x000000, "Member 'WwiseLibrary_PauseOnEvent::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PauseOnEvent, InTransitionDuration) == 0x000010, "Member 'WwiseLibrary_PauseOnEvent::InTransitionDuration' has a wrong offset!");

// Function Wwise.WwiseLibrary.PauseOnPlayingID
// 0x0008 (0x0008 - 0x0000)
struct WwiseLibrary_PauseOnPlayingID final
{
public:
	int32                                         InPlayingID;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InTransitionDuration;                              // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_PauseOnPlayingID) == 0x000004, "Wrong alignment on WwiseLibrary_PauseOnPlayingID");
static_assert(sizeof(WwiseLibrary_PauseOnPlayingID) == 0x000008, "Wrong size on WwiseLibrary_PauseOnPlayingID");
static_assert(offsetof(WwiseLibrary_PauseOnPlayingID, InPlayingID) == 0x000000, "Member 'WwiseLibrary_PauseOnPlayingID::InPlayingID' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PauseOnPlayingID, InTransitionDuration) == 0x000004, "Member 'WwiseLibrary_PauseOnPlayingID::InTransitionDuration' has a wrong offset!");

// Function Wwise.WwiseLibrary.PauseSequcneWwiseComponents
// 0x0004 (0x0004 - 0x0000)
struct WwiseLibrary_PauseSequcneWwiseComponents final
{
public:
	int32                                         InTransitionDuration;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_PauseSequcneWwiseComponents) == 0x000004, "Wrong alignment on WwiseLibrary_PauseSequcneWwiseComponents");
static_assert(sizeof(WwiseLibrary_PauseSequcneWwiseComponents) == 0x000004, "Wrong size on WwiseLibrary_PauseSequcneWwiseComponents");
static_assert(offsetof(WwiseLibrary_PauseSequcneWwiseComponents, InTransitionDuration) == 0x000000, "Member 'WwiseLibrary_PauseSequcneWwiseComponents::InTransitionDuration' has a wrong offset!");

// Function Wwise.WwiseLibrary.PostEvent2D
// 0x0020 (0x0020 - 0x0000)
struct WwiseLibrary_PostEvent2D final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InEventName;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseComponent*                        ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_PostEvent2D) == 0x000008, "Wrong alignment on WwiseLibrary_PostEvent2D");
static_assert(sizeof(WwiseLibrary_PostEvent2D) == 0x000020, "Wrong size on WwiseLibrary_PostEvent2D");
static_assert(offsetof(WwiseLibrary_PostEvent2D, InWorldContext) == 0x000000, "Member 'WwiseLibrary_PostEvent2D::InWorldContext' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEvent2D, InEventName) == 0x000008, "Member 'WwiseLibrary_PostEvent2D::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEvent2D, ReturnValue) == 0x000018, "Member 'WwiseLibrary_PostEvent2D::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.PostEvent2DInSequence
// 0x0020 (0x0020 - 0x0000)
struct WwiseLibrary_PostEvent2DInSequence final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InEventName;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseComponent*                        ReturnValue;                                       // 0x0018(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_PostEvent2DInSequence) == 0x000008, "Wrong alignment on WwiseLibrary_PostEvent2DInSequence");
static_assert(sizeof(WwiseLibrary_PostEvent2DInSequence) == 0x000020, "Wrong size on WwiseLibrary_PostEvent2DInSequence");
static_assert(offsetof(WwiseLibrary_PostEvent2DInSequence, InWorldContext) == 0x000000, "Member 'WwiseLibrary_PostEvent2DInSequence::InWorldContext' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEvent2DInSequence, InEventName) == 0x000008, "Member 'WwiseLibrary_PostEvent2DInSequence::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEvent2DInSequence, ReturnValue) == 0x000018, "Member 'WwiseLibrary_PostEvent2DInSequence::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.PostEvent2DWithCallback
// 0x0030 (0x0030 - 0x0000)
struct WwiseLibrary_PostEvent2DWithCallback final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InEventName;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TDelegate<void(class UWwiseComponent* WwiseComponent)> OnEndPlay;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UWwiseComponent*                        ReturnValue;                                       // 0x0028(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_PostEvent2DWithCallback) == 0x000008, "Wrong alignment on WwiseLibrary_PostEvent2DWithCallback");
static_assert(sizeof(WwiseLibrary_PostEvent2DWithCallback) == 0x000030, "Wrong size on WwiseLibrary_PostEvent2DWithCallback");
static_assert(offsetof(WwiseLibrary_PostEvent2DWithCallback, InWorldContext) == 0x000000, "Member 'WwiseLibrary_PostEvent2DWithCallback::InWorldContext' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEvent2DWithCallback, InEventName) == 0x000008, "Member 'WwiseLibrary_PostEvent2DWithCallback::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEvent2DWithCallback, OnEndPlay) == 0x000018, "Member 'WwiseLibrary_PostEvent2DWithCallback::OnEndPlay' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEvent2DWithCallback, ReturnValue) == 0x000028, "Member 'WwiseLibrary_PostEvent2DWithCallback::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.PostEvent2DWithoutWorld
// 0x0010 (0x0010 - 0x0000)
struct WwiseLibrary_PostEvent2DWithoutWorld final
{
public:
	class FString                                 InEventName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_PostEvent2DWithoutWorld) == 0x000008, "Wrong alignment on WwiseLibrary_PostEvent2DWithoutWorld");
static_assert(sizeof(WwiseLibrary_PostEvent2DWithoutWorld) == 0x000010, "Wrong size on WwiseLibrary_PostEvent2DWithoutWorld");
static_assert(offsetof(WwiseLibrary_PostEvent2DWithoutWorld, InEventName) == 0x000000, "Member 'WwiseLibrary_PostEvent2DWithoutWorld::InEventName' has a wrong offset!");

// Function Wwise.WwiseLibrary.PostEventAtLocation
// 0x0040 (0x0040 - 0x0000)
struct WwiseLibrary_PostEventAtLocation final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InEventName;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InLocation;                                        // 0x0018(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               InRotation;                                        // 0x0024(0x000C)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         SwitchState;                                       // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseComponent*                        ReturnValue;                                       // 0x0038(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(WwiseLibrary_PostEventAtLocation) == 0x000008, "Wrong alignment on WwiseLibrary_PostEventAtLocation");
static_assert(sizeof(WwiseLibrary_PostEventAtLocation) == 0x000040, "Wrong size on WwiseLibrary_PostEventAtLocation");
static_assert(offsetof(WwiseLibrary_PostEventAtLocation, InWorldContext) == 0x000000, "Member 'WwiseLibrary_PostEventAtLocation::InWorldContext' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEventAtLocation, InEventName) == 0x000008, "Member 'WwiseLibrary_PostEventAtLocation::InEventName' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEventAtLocation, InLocation) == 0x000018, "Member 'WwiseLibrary_PostEventAtLocation::InLocation' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEventAtLocation, InRotation) == 0x000024, "Member 'WwiseLibrary_PostEventAtLocation::InRotation' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEventAtLocation, SwitchState) == 0x000030, "Member 'WwiseLibrary_PostEventAtLocation::SwitchState' has a wrong offset!");
static_assert(offsetof(WwiseLibrary_PostEventAtLocation, ReturnValue) == 0x000038, "Member 'WwiseLibrary_PostEventAtLocation::ReturnValue' has a wrong offset!");

// Function Wwise.WwiseLibrary.PostEventAtLocationInSequence
// 0x0040 (0x0040 - 0x0000)
struct WwiseLibrary_PostEventAtLocationInSequence final
{
public:
	class UObject*                                InWorldContext;                                    // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
