#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Wwise

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "Wwise_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class Wwise.WwiseAmbientSound
// 0x0020 (0x0248 - 0x0228)
class AWwiseAmbientSound final : public AActor
{
public:
	uint8                                         Pad_228[0x20];                                     // 0x0228(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsPlaying();
	bool IsPlayingT();
	void StartPlay();
	void StopPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseAmbientSound">();
	}
	static class AWwiseAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWwiseAmbientSound>();
	}
};
static_assert(alignof(AWwiseAmbientSound) == 0x000008, "Wrong alignment on AWwiseAmbientSound");
static_assert(sizeof(AWwiseAmbientSound) == 0x000248, "Wrong size on AWwiseAmbientSound");

// Class Wwise.WwiseComponent
// 0x0260 (0x0460 - 0x0200)
class UWwiseComponent final : public USceneComponent
{
public:
	uint8                                         bUseSpatialAudio : 1;                              // 0x01F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseReverbVolumes : 1;                             // 0x01F8(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bUseDefaultListeners : 1;                          // 0x01F8(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AttenuationScalingFactor;                          // 0x01FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bEnableSpotReflectors : 1;                         // 0x0200(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_201[0x7];                                      // 0x0201(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReflectionAuxBus;                                  // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReflectionOrder;                                   // 0x0228(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReflectionBusSendGain;                             // 0x022C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReflectionMaxPathLength;                           // 0x0230(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReverbAuxBusGain;                                  // 0x0234(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DiffractionMaxEdges;                               // 0x0238(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         DiffractionMaxPaths;                               // 0x023C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiffractionMaxPathLength;                          // 0x0240(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             CollisionChannel;                                  // 0x0244(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_245[0x3];                                      // 0x0245(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CollisionCheckInterval;                            // 0x0248(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoDestroy : 1;                                  // 0x024C(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bIsDefaultListener : 1;                            // 0x024C(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_24D[0x3];                                      // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<class UWwiseComponent*>                  Listeners;                                         // 0x0250(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TSet<class UWwiseComponent*>                  Emitters;                                          // 0x02A0(0x0050)(ExportObject, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F0[0x170];                                    // 0x02F0(0x0170)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static void SetbDefaultUseSpatialAudio(bool bInDefaultUseSpatialAudio);

	bool IsPlayingSomething();
	void PauseWithTransition(int32 InTransitionMS);
	void PostEvent(const class FString& InEventName);
	int32 PostEventWithCallback(const class FString& InEventName, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay, bool bEnablePlayInfo);
	void PostTrigger(const class FString& InTriggerName);
	void RestoreDefaultVolume(const class FString& InRTPCName, float InDurationSec);
	void ResumeWithTransition(int32 InTransitionMS);
	void SetAttenuationScalingFactor(float InValue);
	void SetRTPCValue(const class FString& InRTPCName, float InValue, int32 InInterpMS, ERTPCValueCurveType InCurveType);
	void SetSwitch(const class FString& InSwitchGroup, const class FString& InSwitchState);
	void SetUseSpatialAudio(const bool bNewEnable);
	void SetVolume(float InVolumeValue, float InDurationSec, const class FString& InRTPCName, bool bInBasedDefaultVolume);
	void SetVolumeMultipleBasedDefault(const class FString& InRTPCName, float InMultiple, float InDurationSec);
	void Stop(bool bInvokeCallbacks);
	void StopWithTransition(int32 InTransitionMS, bool bInvokeCallbacks);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseComponent">();
	}
	static class UWwiseComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseComponent>();
	}
};
static_assert(alignof(UWwiseComponent) == 0x000010, "Wrong alignment on UWwiseComponent");
static_assert(sizeof(UWwiseComponent) == 0x000460, "Wrong size on UWwiseComponent");
static_assert(offsetof(UWwiseComponent, AttenuationScalingFactor) == 0x0001FC, "Member 'UWwiseComponent::AttenuationScalingFactor' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, ReflectionAuxBus) == 0x000208, "Member 'UWwiseComponent::ReflectionAuxBus' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, EventName) == 0x000218, "Member 'UWwiseComponent::EventName' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, ReflectionOrder) == 0x000228, "Member 'UWwiseComponent::ReflectionOrder' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, ReflectionBusSendGain) == 0x00022C, "Member 'UWwiseComponent::ReflectionBusSendGain' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, ReflectionMaxPathLength) == 0x000230, "Member 'UWwiseComponent::ReflectionMaxPathLength' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, ReverbAuxBusGain) == 0x000234, "Member 'UWwiseComponent::ReverbAuxBusGain' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, DiffractionMaxEdges) == 0x000238, "Member 'UWwiseComponent::DiffractionMaxEdges' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, DiffractionMaxPaths) == 0x00023C, "Member 'UWwiseComponent::DiffractionMaxPaths' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, DiffractionMaxPathLength) == 0x000240, "Member 'UWwiseComponent::DiffractionMaxPathLength' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, CollisionChannel) == 0x000244, "Member 'UWwiseComponent::CollisionChannel' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, CollisionCheckInterval) == 0x000248, "Member 'UWwiseComponent::CollisionCheckInterval' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, Listeners) == 0x000250, "Member 'UWwiseComponent::Listeners' has a wrong offset!");
static_assert(offsetof(UWwiseComponent, Emitters) == 0x0002A0, "Member 'UWwiseComponent::Emitters' has a wrong offset!");

// Class Wwise.WwiseLateReverbComponent
// 0x0080 (0x0280 - 0x0200)
class UWwiseLateReverbComponent final : public USceneComponent
{
public:
	uint8                                         bEnabled : 1;                                      // 0x01F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1F9[0x7];                                      // 0x01F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 AuxBusName;                                        // 0x0200(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SendLevel;                                         // 0x0210(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FadeRate;                                          // 0x0214(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Priority;                                          // 0x0218(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21C[0x4];                                      // 0x021C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EnterSwitchGroup;                                  // 0x0220(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EnterSwitch;                                       // 0x0230(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaveSwitchGroup;                                  // 0x0240(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaveSwitch;                                       // 0x0250(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHasSwitch : 1;                                    // 0x0260(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_261[0x7];                                      // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWwiseLateReverbComponent*              NextLowerPriorityLateReverb;                       // 0x0268(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AVolume*                                Volume;                                            // 0x0270(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x8];                                      // 0x0278(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseLateReverbComponent">();
	}
	static class UWwiseLateReverbComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseLateReverbComponent>();
	}
};
static_assert(alignof(UWwiseLateReverbComponent) == 0x000010, "Wrong alignment on UWwiseLateReverbComponent");
static_assert(sizeof(UWwiseLateReverbComponent) == 0x000280, "Wrong size on UWwiseLateReverbComponent");
static_assert(offsetof(UWwiseLateReverbComponent, AuxBusName) == 0x000200, "Member 'UWwiseLateReverbComponent::AuxBusName' has a wrong offset!");
static_assert(offsetof(UWwiseLateReverbComponent, SendLevel) == 0x000210, "Member 'UWwiseLateReverbComponent::SendLevel' has a wrong offset!");
static_assert(offsetof(UWwiseLateReverbComponent, FadeRate) == 0x000214, "Member 'UWwiseLateReverbComponent::FadeRate' has a wrong offset!");
static_assert(offsetof(UWwiseLateReverbComponent, Priority) == 0x000218, "Member 'UWwiseLateReverbComponent::Priority' has a wrong offset!");
static_assert(offsetof(UWwiseLateReverbComponent, EnterSwitchGroup) == 0x000220, "Member 'UWwiseLateReverbComponent::EnterSwitchGroup' has a wrong offset!");
static_assert(offsetof(UWwiseLateReverbComponent, EnterSwitch) == 0x000230, "Member 'UWwiseLateReverbComponent::EnterSwitch' has a wrong offset!");
static_assert(offsetof(UWwiseLateReverbComponent, LeaveSwitchGroup) == 0x000240, "Member 'UWwiseLateReverbComponent::LeaveSwitchGroup' has a wrong offset!");
static_assert(offsetof(UWwiseLateReverbComponent, LeaveSwitch) == 0x000250, "Member 'UWwiseLateReverbComponent::LeaveSwitch' has a wrong offset!");
static_assert(offsetof(UWwiseLateReverbComponent, NextLowerPriorityLateReverb) == 0x000268, "Member 'UWwiseLateReverbComponent::NextLowerPriorityLateReverb' has a wrong offset!");
static_assert(offsetof(UWwiseLateReverbComponent, Volume) == 0x000270, "Member 'UWwiseLateReverbComponent::Volume' has a wrong offset!");

// Class Wwise.WwiseLibrary
// 0x0000 (0x0028 - 0x0028)
class UWwiseLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void AddDefaultListener(class UWwiseComponent* InWwiseComponent);
	static void AddSequenceWwiseComponent(class UWwiseComponent* InComponent);
	static void AsyncLoadBankByBank(const TArray<int32>& InBankIds);
	static void AsyncLoadBankByEvent(const TArray<class FString>& InEventNames);
	static void AsyncUnloadBanksByEvent(const TArray<class FString>& InEventNames);
	static void ClearAllModifiedBankLanguage(bool bInUnloadBank);
	static void ClearModifiedBankLanguage(const class FString& InBankName, bool bInUnloadBank);
	static void ClearSequcneWwiseComponents(bool bInStop);
	static int32 GetBankByEvent(const class FString& InEventName);
	static class FString GetBankNameByEvent(const class FString& InEventName);
	static float GetEventDuration(const class FString& InEventName);
	static class FString GetLanguage();
	static const class FString GetModifiedBankLanguage(const class FString& InBankName);
	static const class FString GetModifiedBankLanguageByID(int32 InBankID);
	static TArray<class FString> GetRecordEventNames();
	static float GetVolumeScale(const class FString& InBusName);
	static EWwiseActorType GetWwiseActorType(class UObject* InWorldContext);
	static EWwiseQuality GetWwiseQuality();
	static void Init();
	static bool IsDisable();
	static bool IsExceededMaxNumOfPlayEvent(const class FString& InEventName);
	static bool IsExistVoiceEvent(const class FString& InVoiceEventName);
	static bool IsLoopedEvent(const class FString& InEventName);
	static bool IsLowAmmunitionEffect(EWwiseQuality InWwiseQuality);
	static bool IsSupportAsyncLoadBank();
	static bool IsWwiseQuality(EWwiseQuality InWwiseQuality);
	static void LoadBanksByBank(const TArray<int32>& InBankIds);
	static void LoadBanksByEvent(const TArray<class FString>& InEventNames);
	static void LoadPlayEventNumLimitConfig();
	static void PauseAllWwiseEvents(int32 InTransitionDuration);
	static void PauseOnEvent(const class FString& InEventName, int32 InTransitionDuration);
	static void PauseOnPlayingID(int32 InPlayingID, int32 InTransitionDuration);
	static void PauseSequcneWwiseComponents(int32 InTransitionDuration);
	static class UWwiseComponent* PostEvent2D(class UObject* InWorldContext, const class FString& InEventName);
	static class UWwiseComponent* PostEvent2DInSequence(class UObject* InWorldContext, const class FString& InEventName);
	static class UWwiseComponent* PostEvent2DWithCallback(class UObject* InWorldContext, const class FString& InEventName, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay);
	static void PostEvent2DWithoutWorld(const class FString& InEventName);
	static class UWwiseComponent* PostEventAtLocation(class UObject* InWorldContext, const class FString& InEventName, const struct FVector& InLocation, const struct FRotator& InRotation, int32 SwitchState);
	static class UWwiseComponent* PostEventAtLocationInSequence(class UObject* InWorldContext, const class FString& InEventName, const struct FVector& InLocation, const struct FRotator& InRotation, int32 SwitchState);
	static class UWwiseComponent* PostEventAtLocationSwitch(class UObject* InWorldContext, const class FString& InEventName, const struct FVector& InLocation, const struct FRotator& InRotation, const TMap<class FString, class FString>& Switch, int32 SwitchState);
	static class UWwiseComponent* PostEventAtLocationWithCallback(class UObject* InWorldContext, const class FString& InEventName, const struct FVector& InLocation, const struct FRotator& InRotation, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay, int32 SwitchState);
	static class UWwiseComponent* PostEventAtLocationWithCallbackSwitch(class UObject* InWorldContext, const class FString& InEventName, const struct FVector& InLocation, const struct FRotator& InRotation, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay, const TMap<class FString, class FString>& Switch, int32 SwitchState);
	static class UWwiseComponent* PostEventAttachedActor(const class FString& InEventName, class AActor* InActor);
	static class UWwiseComponent* PostEventAttachedActorInSequence(const class FString& InEventName, class AActor* InActor);
	static class UWwiseComponent* PostEventAttachedActorSwitch(const class FString& InEventName, class AActor* InActor, const TMap<class FString, class FString>& Switch);
	static class UWwiseComponent* PostEventAttachedComponent(const class FString& InEventName, class USceneComponent* InAttachedComponent, const class FName& InSocketName, bool bAutoDestroy, int32 SwitchState);
	static class UWwiseComponent* PostEventAttachedComponentSwitch(const class FString& InEventName, class USceneComponent* InAttachedComponent, const TMap<class FString, class FString>& Switch, const class FName& InSocketName, bool bAutoDestroy, int32 SwitchState);
	static class UWwiseComponent* PostEventAttachedWithCallback(const class FString& InEventName, class USceneComponent* InAttachedComponent, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay, const class FName& InSocketName, bool bAutoDestroy, int32 SwitchState);
	static class UWwiseComponent* PostEventAttachedWithCallbackSwitch(const class FString& InEventName, class USceneComponent* InAttachedComponent, const TDelegate<void(class UWwiseComponent* WwiseComponent)>& OnEndPlay, const TMap<class FString, class FString>& Switch, const class FName& InSocketName, bool bAutoDestroy, int32 SwitchState);
	static int32 PostEventMulitplePosition(const class FString& InEventName, int64 InObjectID, const TArray<struct FTransform>& InTransforms, bool InNeedRegister);
	static void RecordEventName(const class FString& InName);
	static bool RegisterGameObj(int64 InObjectID, const class FString& InObjName);
	static void RemoveSequcneWwiseComponent(class UWwiseComponent* InComponent, bool bInStop);
	static void ResumeAllWwiseEvents(int32 InTransitionDuration);
	static void ResumeOnEvent(const class FString& InEventName, int32 InTransitionDuration);
	static void ResumeOnPlayingID(int32 InPlayingID, int32 InTransitionDuration);
	static void ResumeSequcneWwiseComponents(int32 InTransitionDuration);
	static bool SeekOnEvent(const class FString& InEventName, class UWwiseComponent* InComponent, float InPosition);
	static bool SeekOnEventFromObjectID(const class FString& InEventName, int64 InGameObjectID, float InPosition, bool bInSeekToNearestMarker);
	static void SeSupportAsyncLoadBank(bool bInSupportAsyncLoadBank);
	static void SetBackgroundSuspend(bool bInDontSuspendWhenBackground, bool bInRenderAudioWhenBackground);
	static void SetDeactivedSuspend(bool bInDontSuspendWhenDeactived, bool bInRenderAudioWhenDeactived);
	static void SetDisable(bool InValue);
	static void SetIgnorePreviewWorldClean(bool bInIgnorePreiveWorldClean);
	static void SetiOSFixInBackground(bool bIniOSFixBackgroud);
	static void SetiOSFixInterruption(bool bIniOSFixInterruption);
	static bool SetLanguage(const class FString& InLang);
	static void SetLowAmmunitionEffect(bool bInEffect);
	static bool SetModifiedBankLanguage(const class FString& InBankName, const class FString& InLanguage, bool bInUnloadBank);
	static void SetPluginEnable(uint8 bEnable);
	static void SetRecordEventNames(bool InEnable, int32 InCount);
	static void SetRTPCValue(const class FString& InRTPCName, float InValue, int32 InInterpMS, ERTPCValueCurveType InCurveType);
	static void SetState(const class FString& InStateGroup, const class FString& InStateName);
	static void SetStateGroup(const class FString& InStateGroup);
	static void SetSwitch(const class FString& InSwitchGroup, const class FString& InSwitchName, class UWwiseComponent* InComponent);
	static void SetSwitchFromActor(const class FString& InSwitchGroup, const class FString& InSwitchName, const class AActor* InActor);
	static void SetSwitchGroup(const class FString& InSwitchGroup, class UWwiseComponent* InComponent);
	static void SetSwitchState(class UObject* InWorldContext, class UWwiseComponent* InWwiseComponent, int32 SwitchState);
	static void SetSwitchStateByActorType(EWwiseActorType ActorType, class UWwiseComponent* InWwiseComponent, int32 SwitchState, const class FString& ActorName);
	static void SetVolumeScale(const class FString& InBusName, float InScale, float InFadeTime);
	static void SetVolumeScaleByObjectID(const class FString& InBusName, float InScale, float InFadeTime, int64 InGameObjectID);
	static void SetWwiseQuality(EWwiseQuality InWwiseQuality);
	static void StopAllAttachedActor(class AActor* InActor, int32 InTransitionMS);
	static void StopAllAttachedComponent(class USceneComponent* InAttachedComponent);
	static void StopPlayingID(int32 InPlayingID, float InDuration);
	static void UnloadBank(int32 InBankID);
	static bool UnloadBankAsync(int32 InBankID);
	static void UnloadBankByEvents(const TArray<class FString>& InEventNames);
	static void WwiseSuspend(bool bRenderAnyway);
	static void WwiseWakeupFromSuspend();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseLibrary">();
	}
	static class UWwiseLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseLibrary>();
	}
};
static_assert(alignof(UWwiseLibrary) == 0x000008, "Wrong alignment on UWwiseLibrary");
static_assert(sizeof(UWwiseLibrary) == 0x000028, "Wrong size on UWwiseLibrary");

// Class Wwise.WwiseMulitplePositionComponent
// 0x0020 (0x0220 - 0x0200)
class UWwiseMulitplePositionComponent final : public USceneComponent
{
public:
	class FString                                 SoundEvent;                                        // 0x01F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bAutoPlay : 1;                                     // 0x0208(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bEnabled : 1;                                      // 0x0208(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_209[0x17];                                     // 0x0209(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool IsPlaying();
	void StartPlay();
	void StopPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseMulitplePositionComponent">();
	}
	static class UWwiseMulitplePositionComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseMulitplePositionComponent>();
	}
};
static_assert(alignof(UWwiseMulitplePositionComponent) == 0x000010, "Wrong alignment on UWwiseMulitplePositionComponent");
static_assert(sizeof(UWwiseMulitplePositionComponent) == 0x000220, "Wrong size on UWwiseMulitplePositionComponent");
static_assert(offsetof(UWwiseMulitplePositionComponent, SoundEvent) == 0x0001F8, "Member 'UWwiseMulitplePositionComponent::SoundEvent' has a wrong offset!");

// Class Wwise.WwisePortalVolume
// 0x0090 (0x02F0 - 0x0260)
class AWwisePortalVolume final : public AVolume
{
public:
	ECollisionChannel                             CollisionChannel;                                  // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0x3];                                      // 0x0261(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CollisionCheckInterval;                            // 0x0264(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_268[0x88];                                     // 0x0268(0x0088)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePortal();
	bool IsOpened();
	void OpenPortal();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwisePortalVolume">();
	}
	static class AWwisePortalVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWwisePortalVolume>();
	}
};
static_assert(alignof(AWwisePortalVolume) == 0x000008, "Wrong alignment on AWwisePortalVolume");
static_assert(sizeof(AWwisePortalVolume) == 0x0002F0, "Wrong size on AWwisePortalVolume");
static_assert(offsetof(AWwisePortalVolume, CollisionChannel) == 0x000260, "Member 'AWwisePortalVolume::CollisionChannel' has a wrong offset!");
static_assert(offsetof(AWwisePortalVolume, CollisionCheckInterval) == 0x000264, "Member 'AWwisePortalVolume::CollisionCheckInterval' has a wrong offset!");

// Class Wwise.WwiseReverbVolume
// 0x0008 (0x0268 - 0x0260)
class AWwiseReverbVolume final : public AVolume
{
public:
	class UWwiseLateReverbComponent*              LateReverb;                                        // 0x0260(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseReverbVolume">();
	}
	static class AWwiseReverbVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWwiseReverbVolume>();
	}
};
static_assert(alignof(AWwiseReverbVolume) == 0x000008, "Wrong alignment on AWwiseReverbVolume");
static_assert(sizeof(AWwiseReverbVolume) == 0x000268, "Wrong size on AWwiseReverbVolume");
static_assert(offsetof(AWwiseReverbVolume, LateReverb) == 0x000260, "Member 'AWwiseReverbVolume::LateReverb' has a wrong offset!");

// Class Wwise.WwiseRoomComponent
// 0x0060 (0x0260 - 0x0200)
class UWwiseRoomComponent final : public USceneComponent
{
public:
	uint8                                         bEnable : 1;                                       // 0x01F8(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_1F9[0x3];                                      // 0x01F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Priority;                                          // 0x01FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WallOcclusion;                                     // 0x0200(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 EnterSwitchGroup;                                  // 0x0208(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EnterSwitch;                                       // 0x0218(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaveSwitchGroup;                                  // 0x0228(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LeaveSwitch;                                       // 0x0238(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseRoomComponent*                    NextLowerPriorityRoom;                             // 0x0248(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AVolume*                                Volume;                                            // 0x0250(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         bHasSwitch : 1;                                    // 0x0258(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseRoomComponent">();
	}
	static class UWwiseRoomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseRoomComponent>();
	}
};
static_assert(alignof(UWwiseRoomComponent) == 0x000010, "Wrong alignment on UWwiseRoomComponent");
static_assert(sizeof(UWwiseRoomComponent) == 0x000260, "Wrong size on UWwiseRoomComponent");
static_assert(offsetof(UWwiseRoomComponent, Priority) == 0x0001FC, "Member 'UWwiseRoomComponent::Priority' has a wrong offset!");
static_assert(offsetof(UWwiseRoomComponent, WallOcclusion) == 0x000200, "Member 'UWwiseRoomComponent::WallOcclusion' has a wrong offset!");
static_assert(offsetof(UWwiseRoomComponent, EnterSwitchGroup) == 0x000208, "Member 'UWwiseRoomComponent::EnterSwitchGroup' has a wrong offset!");
static_assert(offsetof(UWwiseRoomComponent, EnterSwitch) == 0x000218, "Member 'UWwiseRoomComponent::EnterSwitch' has a wrong offset!");
static_assert(offsetof(UWwiseRoomComponent, LeaveSwitchGroup) == 0x000228, "Member 'UWwiseRoomComponent::LeaveSwitchGroup' has a wrong offset!");
static_assert(offsetof(UWwiseRoomComponent, LeaveSwitch) == 0x000238, "Member 'UWwiseRoomComponent::LeaveSwitch' has a wrong offset!");
static_assert(offsetof(UWwiseRoomComponent, NextLowerPriorityRoom) == 0x000248, "Member 'UWwiseRoomComponent::NextLowerPriorityRoom' has a wrong offset!");
static_assert(offsetof(UWwiseRoomComponent, Volume) == 0x000250, "Member 'UWwiseRoomComponent::Volume' has a wrong offset!");

// Class Wwise.WwiseSetting
// 0x0088 (0x00B0 - 0x0028)
class UWwiseSetting final : public UObject
{
public:
	class FString                                 BaseAudioPath;                                     // 0x0028(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxPositioningPaths;                               // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        DefaultPoolSize;                                   // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MemoryCutoffThreshold;                             // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        CommandQueueSize;                                  // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        SamplesPerFrame;                                   // 0x0048(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwisePanningRule                             PanningRule;                                       // 0x004C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseChannelType                             ChannelType;                                       // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ChannelMask;                                       // 0x0054(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        ChannelCount;                                      // 0x0058(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxVolume;                                         // 0x005C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxMemoryPools;                                    // 0x0060(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StreamingLookAheadRatio;                           // 0x0064(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        StreamManagerPoolSize;                             // 0x0068(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        LowerEnginePoolSize;                               // 0x006C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LowerEngineMemoryCutoffThreshold;                  // 0x0070(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint16                                        MaxRefillsInVoice;                                 // 0x0074(0x0002)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	uint32                                        SpatialAudioPoolSize;                              // 0x0078(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        MaxSoundPropagationDepth;                          // 0x007C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        DiffractionFlags;                                  // 0x0080(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiffractionShadowDegrees;                          // 0x0084(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DiffractionShadowAttenuationFactor;                // 0x0088(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MovementThreshold;                                 // 0x008C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HitEffectGroupName;                                // 0x0090(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 HitEffectEventName;                                // 0x00A0(0x0010)(Edit, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseSetting">();
	}
	static class UWwiseSetting* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWwiseSetting>();
	}
};
static_assert(alignof(UWwiseSetting) == 0x000008, "Wrong alignment on UWwiseSetting");
static_assert(sizeof(UWwiseSetting) == 0x0000B0, "Wrong size on UWwiseSetting");
static_assert(offsetof(UWwiseSetting, BaseAudioPath) == 0x000028, "Member 'UWwiseSetting::BaseAudioPath' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, MaxPositioningPaths) == 0x000038, "Member 'UWwiseSetting::MaxPositioningPaths' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, DefaultPoolSize) == 0x00003C, "Member 'UWwiseSetting::DefaultPoolSize' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, MemoryCutoffThreshold) == 0x000040, "Member 'UWwiseSetting::MemoryCutoffThreshold' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, CommandQueueSize) == 0x000044, "Member 'UWwiseSetting::CommandQueueSize' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, SamplesPerFrame) == 0x000048, "Member 'UWwiseSetting::SamplesPerFrame' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, PanningRule) == 0x00004C, "Member 'UWwiseSetting::PanningRule' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, ChannelType) == 0x000050, "Member 'UWwiseSetting::ChannelType' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, ChannelMask) == 0x000054, "Member 'UWwiseSetting::ChannelMask' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, ChannelCount) == 0x000058, "Member 'UWwiseSetting::ChannelCount' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, MaxVolume) == 0x00005C, "Member 'UWwiseSetting::MaxVolume' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, MaxMemoryPools) == 0x000060, "Member 'UWwiseSetting::MaxMemoryPools' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, StreamingLookAheadRatio) == 0x000064, "Member 'UWwiseSetting::StreamingLookAheadRatio' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, StreamManagerPoolSize) == 0x000068, "Member 'UWwiseSetting::StreamManagerPoolSize' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, LowerEnginePoolSize) == 0x00006C, "Member 'UWwiseSetting::LowerEnginePoolSize' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, LowerEngineMemoryCutoffThreshold) == 0x000070, "Member 'UWwiseSetting::LowerEngineMemoryCutoffThreshold' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, MaxRefillsInVoice) == 0x000074, "Member 'UWwiseSetting::MaxRefillsInVoice' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, SpatialAudioPoolSize) == 0x000078, "Member 'UWwiseSetting::SpatialAudioPoolSize' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, MaxSoundPropagationDepth) == 0x00007C, "Member 'UWwiseSetting::MaxSoundPropagationDepth' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, DiffractionFlags) == 0x000080, "Member 'UWwiseSetting::DiffractionFlags' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, DiffractionShadowDegrees) == 0x000084, "Member 'UWwiseSetting::DiffractionShadowDegrees' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, DiffractionShadowAttenuationFactor) == 0x000088, "Member 'UWwiseSetting::DiffractionShadowAttenuationFactor' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, MovementThreshold) == 0x00008C, "Member 'UWwiseSetting::MovementThreshold' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, HitEffectGroupName) == 0x000090, "Member 'UWwiseSetting::HitEffectGroupName' has a wrong offset!");
static_assert(offsetof(UWwiseSetting, HitEffectEventName) == 0x0000A0, "Member 'UWwiseSetting::HitEffectEventName' has a wrong offset!");

// Class Wwise.WwiseSpatialAudioVolume
// 0x0010 (0x0270 - 0x0260)
class AWwiseSpatialAudioVolume final : public AVolume
{
public:
	class UWwiseLateReverbComponent*              LateReverb;                                        // 0x0260(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseRoomComponent*                    Room;                                              // 0x0268(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WwiseSpatialAudioVolume">();
	}
	static class AWwiseSpatialAudioVolume* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWwiseSpatialAudioVolume>();
	}
};
static_assert(alignof(AWwiseSpatialAudioVolume) == 0x000008, "Wrong alignment on AWwiseSpatialAudioVolume");
static_assert(sizeof(AWwiseSpatialAudioVolume) == 0x000270, "Wrong size on AWwiseSpatialAudioVolume");
static_assert(offsetof(AWwiseSpatialAudioVolume, LateReverb) == 0x000260, "Member 'AWwiseSpatialAudioVolume::LateReverb' has a wrong offset!");
static_assert(offsetof(AWwiseSpatialAudioVolume, Room) == 0x000268, "Member 'AWwiseSpatialAudioVolume::Room' has a wrong offset!");

}

