#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XGSDK

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum XGSDK.EXGSDKQrStatus
// NumValues: 0x0006
enum class EXGSDKQrStatus : uint8
{
	INIT                                     = 0,
	SCAN_CODE                                = 1,
	LOGIN                                    = 2,
	EXPIRE                                   = 11,
	LOGIN_FAIL                               = 13,
	EXGSDKQrStatus_MAX                       = 14,
};

// ScriptStruct XGSDK.BaseInfo
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FBaseInfo
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBaseInfo) == 0x000008, "Wrong alignment on FBaseInfo");
static_assert(sizeof(FBaseInfo) == 0x000050, "Wrong size on FBaseInfo");

// ScriptStruct XGSDK.BaseEvent
// 0x0010 (0x0060 - 0x0050)
struct FBaseEvent : public FBaseInfo
{
public:
	uint8                                         Pad_50[0x10];                                      // 0x0050(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBaseEvent) == 0x000008, "Wrong alignment on FBaseEvent");
static_assert(sizeof(FBaseEvent) == 0x000060, "Wrong size on FBaseEvent");

// ScriptStruct XGSDK.CustomEvent
// 0x0020 (0x0080 - 0x0060)
struct FCustomEvent final : public FBaseEvent
{
public:
	uint8                                         Pad_60[0x20];                                      // 0x0060(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FCustomEvent) == 0x000008, "Wrong alignment on FCustomEvent");
static_assert(sizeof(FCustomEvent) == 0x000080, "Wrong size on FCustomEvent");

// ScriptStruct XGSDK.FunCodeInfo
// 0x0040 (0x0090 - 0x0050)
struct FFunCodeInfo final : public FBaseInfo
{
public:
	uint8                                         Pad_50[0x40];                                      // 0x0050(0x0040)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FFunCodeInfo) == 0x000008, "Wrong alignment on FFunCodeInfo");
static_assert(sizeof(FFunCodeInfo) == 0x000090, "Wrong size on FFunCodeInfo");

// ScriptStruct XGSDK.Heartbeat
// 0x0030 (0x0030 - 0x0000)
struct alignas(0x08) FHeartbeat final
{
public:
	uint8                                         Pad_0[0x30];                                       // 0x0000(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FHeartbeat) == 0x000008, "Wrong alignment on FHeartbeat");
static_assert(sizeof(FHeartbeat) == 0x000030, "Wrong size on FHeartbeat");

// ScriptStruct XGSDK.WItemInfo
// 0x0030 (0x0080 - 0x0050)
struct FWItemInfo : public FBaseInfo
{
public:
	uint8                                         Pad_50[0x30];                                      // 0x0050(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWItemInfo) == 0x000008, "Wrong alignment on FWItemInfo");
static_assert(sizeof(FWItemInfo) == 0x000080, "Wrong size on FWItemInfo");

// ScriptStruct XGSDK.ItemConsumeInfo
// 0x0020 (0x00A0 - 0x0080)
struct FItemConsumeInfo final : public FWItemInfo
{
public:
	uint8                                         Pad_80[0x20];                                      // 0x0080(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FItemConsumeInfo) == 0x000008, "Wrong alignment on FItemConsumeInfo");
static_assert(sizeof(FItemConsumeInfo) == 0x0000A0, "Wrong size on FItemConsumeInfo");

// ScriptStruct XGSDK.ItemGainInfo
// 0x0020 (0x00A0 - 0x0080)
struct FItemGainInfo final : public FWItemInfo
{
public:
	uint8                                         Pad_80[0x20];                                      // 0x0080(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FItemGainInfo) == 0x000008, "Wrong alignment on FItemGainInfo");
static_assert(sizeof(FItemGainInfo) == 0x0000A0, "Wrong size on FItemGainInfo");

// ScriptStruct XGSDK.MissionInfo
// 0x0028 (0x0078 - 0x0050)
struct FMissionInfo final : public FBaseInfo
{
public:
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FMissionInfo) == 0x000008, "Wrong alignment on FMissionInfo");
static_assert(sizeof(FMissionInfo) == 0x000078, "Wrong size on FMissionInfo");

// ScriptStruct XGSDK.WPayInfo
// 0x0028 (0x0078 - 0x0050)
struct FWPayInfo final : public FBaseInfo
{
public:
	uint8                                         Pad_50[0x28];                                      // 0x0050(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWPayInfo) == 0x000008, "Wrong alignment on FWPayInfo");
static_assert(sizeof(FWPayInfo) == 0x000078, "Wrong size on FWPayInfo");

// ScriptStruct XGSDK.WRoleInfo
// 0x0098 (0x00E8 - 0x0050)
struct FWRoleInfo final : public FBaseInfo
{
public:
	uint8                                         Pad_50[0x98];                                      // 0x0050(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWRoleInfo) == 0x000008, "Wrong alignment on FWRoleInfo");
static_assert(sizeof(FWRoleInfo) == 0x0000E8, "Wrong size on FWRoleInfo");

// ScriptStruct XGSDK.VirtualCurrencyInfo
// 0x0020 (0x0070 - 0x0050)
struct FVirtualCurrencyInfo : public FBaseInfo
{
public:
	uint8                                         Pad_50[0x20];                                      // 0x0050(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualCurrencyInfo) == 0x000008, "Wrong alignment on FVirtualCurrencyInfo");
static_assert(sizeof(FVirtualCurrencyInfo) == 0x000070, "Wrong size on FVirtualCurrencyInfo");

// ScriptStruct XGSDK.VirtualCurrencyConsumeInfo
// 0x0028 (0x0098 - 0x0070)
struct FVirtualCurrencyConsumeInfo final : public FVirtualCurrencyInfo
{
public:
	uint8                                         Pad_70[0x28];                                      // 0x0070(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualCurrencyConsumeInfo) == 0x000008, "Wrong alignment on FVirtualCurrencyConsumeInfo");
static_assert(sizeof(FVirtualCurrencyConsumeInfo) == 0x000098, "Wrong size on FVirtualCurrencyConsumeInfo");

// ScriptStruct XGSDK.VirtualCurrencyGainInfo
// 0x0020 (0x0090 - 0x0070)
struct FVirtualCurrencyGainInfo final : public FVirtualCurrencyInfo
{
public:
	uint8                                         Pad_70[0x20];                                      // 0x0070(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FVirtualCurrencyGainInfo) == 0x000008, "Wrong alignment on FVirtualCurrencyGainInfo");
static_assert(sizeof(FVirtualCurrencyGainInfo) == 0x000090, "Wrong size on FVirtualCurrencyGainInfo");

// ScriptStruct XGSDK.WhaleSDKConfig
// 0x0150 (0x0150 - 0x0000)
struct alignas(0x08) FWhaleSDKConfig final
{
public:
	uint8                                         Pad_0[0x150];                                      // 0x0000(0x0150)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWhaleSDKConfig) == 0x000008, "Wrong alignment on FWhaleSDKConfig");
static_assert(sizeof(FWhaleSDKConfig) == 0x000150, "Wrong size on FWhaleSDKConfig");

// ScriptStruct XGSDK.WhaleSDKTimmer
// 0x0050 (0x0050 - 0x0000)
struct alignas(0x08) FWhaleSDKTimmer final
{
public:
	uint8                                         Pad_0[0x50];                                       // 0x0000(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FWhaleSDKTimmer) == 0x000008, "Wrong alignment on FWhaleSDKTimmer");
static_assert(sizeof(FWhaleSDKTimmer) == 0x000050, "Wrong size on FWhaleSDKTimmer");

// ScriptStruct XGSDK.XGSDKQRData
// 0x0038 (0x0038 - 0x0000)
struct FXGSDKQRData final
{
public:
	class FString                                 QrCode;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                         QrData;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                         QrWidth;                                           // 0x0020(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              QrTime;                                            // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EXGSDKQrStatus                                PreviousStatus;                                    // 0x0030(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FXGSDKQRData) == 0x000008, "Wrong alignment on FXGSDKQRData");
static_assert(sizeof(FXGSDKQRData) == 0x000038, "Wrong size on FXGSDKQRData");
static_assert(offsetof(FXGSDKQRData, QrCode) == 0x000000, "Member 'FXGSDKQRData::QrCode' has a wrong offset!");
static_assert(offsetof(FXGSDKQRData, QrData) == 0x000010, "Member 'FXGSDKQRData::QrData' has a wrong offset!");
static_assert(offsetof(FXGSDKQRData, QrWidth) == 0x000020, "Member 'FXGSDKQRData::QrWidth' has a wrong offset!");
static_assert(offsetof(FXGSDKQRData, QrTime) == 0x000028, "Member 'FXGSDKQRData::QrTime' has a wrong offset!");
static_assert(offsetof(FXGSDKQRData, PreviousStatus) == 0x000030, "Member 'FXGSDKQRData::PreviousStatus' has a wrong offset!");

// ScriptStruct XGSDK.AdjustAdRevenue
// 0x0110 (0x0110 - 0x0000)
struct FAdjustAdRevenue final
{
public:
	class FString                                 Source;                                            // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Revenue;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Currency;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdImpressionsCount;                                // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdRevenueNetwork;                                  // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdRevenueUnit;                                     // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdRevenuePlacement;                                // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            CallbackParameters;                                // 0x0070(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            PartnerParameters;                                 // 0x00C0(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAdjustAdRevenue) == 0x000008, "Wrong alignment on FAdjustAdRevenue");
static_assert(sizeof(FAdjustAdRevenue) == 0x000110, "Wrong size on FAdjustAdRevenue");
static_assert(offsetof(FAdjustAdRevenue, Source) == 0x000000, "Member 'FAdjustAdRevenue::Source' has a wrong offset!");
static_assert(offsetof(FAdjustAdRevenue, Revenue) == 0x000010, "Member 'FAdjustAdRevenue::Revenue' has a wrong offset!");
static_assert(offsetof(FAdjustAdRevenue, Currency) == 0x000020, "Member 'FAdjustAdRevenue::Currency' has a wrong offset!");
static_assert(offsetof(FAdjustAdRevenue, AdImpressionsCount) == 0x000030, "Member 'FAdjustAdRevenue::AdImpressionsCount' has a wrong offset!");
static_assert(offsetof(FAdjustAdRevenue, AdRevenueNetwork) == 0x000040, "Member 'FAdjustAdRevenue::AdRevenueNetwork' has a wrong offset!");
static_assert(offsetof(FAdjustAdRevenue, AdRevenueUnit) == 0x000050, "Member 'FAdjustAdRevenue::AdRevenueUnit' has a wrong offset!");
static_assert(offsetof(FAdjustAdRevenue, AdRevenuePlacement) == 0x000060, "Member 'FAdjustAdRevenue::AdRevenuePlacement' has a wrong offset!");
static_assert(offsetof(FAdjustAdRevenue, CallbackParameters) == 0x000070, "Member 'FAdjustAdRevenue::CallbackParameters' has a wrong offset!");
static_assert(offsetof(FAdjustAdRevenue, PartnerParameters) == 0x0000C0, "Member 'FAdjustAdRevenue::PartnerParameters' has a wrong offset!");

// ScriptStruct XGSDK.AdjustEvent
// 0x00F0 (0x00F0 - 0x0000)
struct FAdjustEvent final
{
public:
	class FString                                 EventToken;                                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Revenue;                                           // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Currency;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            CallbackParameters;                                // 0x0030(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            PartnerParameters;                                 // 0x0080(0x0050)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FString                                 OrderId;                                           // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CallbackId;                                        // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FAdjustEvent) == 0x000008, "Wrong alignment on FAdjustEvent");
static_assert(sizeof(FAdjustEvent) == 0x0000F0, "Wrong size on FAdjustEvent");
static_assert(offsetof(FAdjustEvent, EventToken) == 0x000000, "Member 'FAdjustEvent::EventToken' has a wrong offset!");
static_assert(offsetof(FAdjustEvent, Revenue) == 0x000010, "Member 'FAdjustEvent::Revenue' has a wrong offset!");
static_assert(offsetof(FAdjustEvent, Currency) == 0x000020, "Member 'FAdjustEvent::Currency' has a wrong offset!");
static_assert(offsetof(FAdjustEvent, CallbackParameters) == 0x000030, "Member 'FAdjustEvent::CallbackParameters' has a wrong offset!");
static_assert(offsetof(FAdjustEvent, PartnerParameters) == 0x000080, "Member 'FAdjustEvent::PartnerParameters' has a wrong offset!");
static_assert(offsetof(FAdjustEvent, OrderId) == 0x0000D0, "Member 'FAdjustEvent::OrderId' has a wrong offset!");
static_assert(offsetof(FAdjustEvent, CallbackId) == 0x0000E0, "Member 'FAdjustEvent::CallbackId' has a wrong offset!");

// ScriptStruct XGSDK.QuestInfo
// 0x0050 (0x0050 - 0x0000)
struct FQuestInfo final
{
public:
	class FString                                 QuestId;                                           // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 QuestName;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MissionId;                                         // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 MissionName;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CustomParams;                                      // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FQuestInfo) == 0x000008, "Wrong alignment on FQuestInfo");
static_assert(sizeof(FQuestInfo) == 0x000050, "Wrong size on FQuestInfo");
static_assert(offsetof(FQuestInfo, QuestId) == 0x000000, "Member 'FQuestInfo::QuestId' has a wrong offset!");
static_assert(offsetof(FQuestInfo, QuestName) == 0x000010, "Member 'FQuestInfo::QuestName' has a wrong offset!");
static_assert(offsetof(FQuestInfo, MissionId) == 0x000020, "Member 'FQuestInfo::MissionId' has a wrong offset!");
static_assert(offsetof(FQuestInfo, MissionName) == 0x000030, "Member 'FQuestInfo::MissionName' has a wrong offset!");
static_assert(offsetof(FQuestInfo, CustomParams) == 0x000040, "Member 'FQuestInfo::CustomParams' has a wrong offset!");

// ScriptStruct XGSDK.ShareInfoV2
// 0x0108 (0x0108 - 0x0000)
struct FShareInfoV2 final
{
public:
	class FString                                 Uid;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoneId;                                            // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerID;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ShouldRewarded;                                    // 0x0040(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Channel;                                           // 0x0048(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Mode;                                              // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 Title;                                             // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Desc;                                              // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ContentType;                                       // 0x0080(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_84[0x4];                                       // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CoverPath;                                         // 0x0088(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImageUrl;                                          // 0x0098(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoUrl;                                          // 0x00A8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ImagePath;                                         // 0x00B8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VideoPath;                                         // 0x00C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LinkUrl;                                           // 0x00D8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Tag;                                               // 0x00E8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdditParams;                                       // 0x00F8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FShareInfoV2) == 0x000008, "Wrong alignment on FShareInfoV2");
static_assert(sizeof(FShareInfoV2) == 0x000108, "Wrong size on FShareInfoV2");
static_assert(offsetof(FShareInfoV2, Uid) == 0x000000, "Member 'FShareInfoV2::Uid' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, RoleId) == 0x000010, "Member 'FShareInfoV2::RoleId' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, ZoneId) == 0x000020, "Member 'FShareInfoV2::ZoneId' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, ServerID) == 0x000030, "Member 'FShareInfoV2::ServerID' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, ShouldRewarded) == 0x000040, "Member 'FShareInfoV2::ShouldRewarded' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, Channel) == 0x000048, "Member 'FShareInfoV2::Channel' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, Mode) == 0x000058, "Member 'FShareInfoV2::Mode' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, Title) == 0x000060, "Member 'FShareInfoV2::Title' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, Desc) == 0x000070, "Member 'FShareInfoV2::Desc' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, ContentType) == 0x000080, "Member 'FShareInfoV2::ContentType' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, CoverPath) == 0x000088, "Member 'FShareInfoV2::CoverPath' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, ImageUrl) == 0x000098, "Member 'FShareInfoV2::ImageUrl' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, VideoUrl) == 0x0000A8, "Member 'FShareInfoV2::VideoUrl' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, ImagePath) == 0x0000B8, "Member 'FShareInfoV2::ImagePath' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, VideoPath) == 0x0000C8, "Member 'FShareInfoV2::VideoPath' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, LinkUrl) == 0x0000D8, "Member 'FShareInfoV2::LinkUrl' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, Tag) == 0x0000E8, "Member 'FShareInfoV2::Tag' has a wrong offset!");
static_assert(offsetof(FShareInfoV2, AdditParams) == 0x0000F8, "Member 'FShareInfoV2::AdditParams' has a wrong offset!");

// ScriptStruct XGSDK.ShareInfo
// 0x0080 (0x0080 - 0x0000)
struct FShareInfo final
{
public:
	class FString                                 Uid;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShareChannel;                                      // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShareLinkUrl;                                      // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShareTitle;                                        // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ShareContent;                                      // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SharePictureUrl;                                   // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 SharePicturePath;                                  // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FShareInfo) == 0x000008, "Wrong alignment on FShareInfo");
static_assert(sizeof(FShareInfo) == 0x000080, "Wrong size on FShareInfo");
static_assert(offsetof(FShareInfo, Uid) == 0x000000, "Member 'FShareInfo::Uid' has a wrong offset!");
static_assert(offsetof(FShareInfo, RoleId) == 0x000010, "Member 'FShareInfo::RoleId' has a wrong offset!");
static_assert(offsetof(FShareInfo, ShareChannel) == 0x000020, "Member 'FShareInfo::ShareChannel' has a wrong offset!");
static_assert(offsetof(FShareInfo, ShareLinkUrl) == 0x000030, "Member 'FShareInfo::ShareLinkUrl' has a wrong offset!");
static_assert(offsetof(FShareInfo, ShareTitle) == 0x000040, "Member 'FShareInfo::ShareTitle' has a wrong offset!");
static_assert(offsetof(FShareInfo, ShareContent) == 0x000050, "Member 'FShareInfo::ShareContent' has a wrong offset!");
static_assert(offsetof(FShareInfo, SharePictureUrl) == 0x000060, "Member 'FShareInfo::SharePictureUrl' has a wrong offset!");
static_assert(offsetof(FShareInfo, SharePicturePath) == 0x000070, "Member 'FShareInfo::SharePicturePath' has a wrong offset!");

// ScriptStruct XGSDK.PayInfo
// 0x0140 (0x0140 - 0x0000)
struct FPayInfo final
{
public:
	class FString                                 Uid;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProductID;                                         // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProductName;                                       // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProductDesc;                                       // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ProductUnit;                                       // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProductQuantity;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ProductUnitPrice;                                  // 0x0054(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         TotalAmount;                                       // 0x0058(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PayAmount;                                         // 0x005C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CurrencyName;                                      // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 UserName;                                          // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleLevel;                                         // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleVipLevel;                                      // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerID;                                          // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoneId;                                            // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartyName;                                         // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VirtualCurrencyBalance;                            // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 CustomInfo;                                        // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameTradeNo;                                       // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 GameCallbackUrl;                                   // 0x0120(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AdditionalParams;                                  // 0x0130(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FPayInfo) == 0x000008, "Wrong alignment on FPayInfo");
static_assert(sizeof(FPayInfo) == 0x000140, "Wrong size on FPayInfo");
static_assert(offsetof(FPayInfo, Uid) == 0x000000, "Member 'FPayInfo::Uid' has a wrong offset!");
static_assert(offsetof(FPayInfo, ProductID) == 0x000010, "Member 'FPayInfo::ProductID' has a wrong offset!");
static_assert(offsetof(FPayInfo, ProductName) == 0x000020, "Member 'FPayInfo::ProductName' has a wrong offset!");
static_assert(offsetof(FPayInfo, ProductDesc) == 0x000030, "Member 'FPayInfo::ProductDesc' has a wrong offset!");
static_assert(offsetof(FPayInfo, ProductUnit) == 0x000040, "Member 'FPayInfo::ProductUnit' has a wrong offset!");
static_assert(offsetof(FPayInfo, ProductQuantity) == 0x000050, "Member 'FPayInfo::ProductQuantity' has a wrong offset!");
static_assert(offsetof(FPayInfo, ProductUnitPrice) == 0x000054, "Member 'FPayInfo::ProductUnitPrice' has a wrong offset!");
static_assert(offsetof(FPayInfo, TotalAmount) == 0x000058, "Member 'FPayInfo::TotalAmount' has a wrong offset!");
static_assert(offsetof(FPayInfo, PayAmount) == 0x00005C, "Member 'FPayInfo::PayAmount' has a wrong offset!");
static_assert(offsetof(FPayInfo, CurrencyName) == 0x000060, "Member 'FPayInfo::CurrencyName' has a wrong offset!");
static_assert(offsetof(FPayInfo, RoleId) == 0x000070, "Member 'FPayInfo::RoleId' has a wrong offset!");
static_assert(offsetof(FPayInfo, UserName) == 0x000080, "Member 'FPayInfo::UserName' has a wrong offset!");
static_assert(offsetof(FPayInfo, RoleName) == 0x000090, "Member 'FPayInfo::RoleName' has a wrong offset!");
static_assert(offsetof(FPayInfo, RoleLevel) == 0x0000A0, "Member 'FPayInfo::RoleLevel' has a wrong offset!");
static_assert(offsetof(FPayInfo, RoleVipLevel) == 0x0000B0, "Member 'FPayInfo::RoleVipLevel' has a wrong offset!");
static_assert(offsetof(FPayInfo, ServerID) == 0x0000C0, "Member 'FPayInfo::ServerID' has a wrong offset!");
static_assert(offsetof(FPayInfo, ZoneId) == 0x0000D0, "Member 'FPayInfo::ZoneId' has a wrong offset!");
static_assert(offsetof(FPayInfo, PartyName) == 0x0000E0, "Member 'FPayInfo::PartyName' has a wrong offset!");
static_assert(offsetof(FPayInfo, VirtualCurrencyBalance) == 0x0000F0, "Member 'FPayInfo::VirtualCurrencyBalance' has a wrong offset!");
static_assert(offsetof(FPayInfo, CustomInfo) == 0x000100, "Member 'FPayInfo::CustomInfo' has a wrong offset!");
static_assert(offsetof(FPayInfo, GameTradeNo) == 0x000110, "Member 'FPayInfo::GameTradeNo' has a wrong offset!");
static_assert(offsetof(FPayInfo, GameCallbackUrl) == 0x000120, "Member 'FPayInfo::GameCallbackUrl' has a wrong offset!");
static_assert(offsetof(FPayInfo, AdditionalParams) == 0x000130, "Member 'FPayInfo::AdditionalParams' has a wrong offset!");

// ScriptStruct XGSDK.RoleInfo
// 0x0120 (0x0120 - 0x0000)
struct FRoleInfo final
{
public:
	class FString                                 Uid;                                               // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleId;                                            // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleName;                                          // 0x0020(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleType;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleCreateTime;                                    // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleLevel;                                         // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleVipLevel;                                      // 0x0060(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerID;                                          // 0x0070(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoneId;                                            // 0x0080(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ServerName;                                        // 0x0090(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ZoneName;                                          // 0x00A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 PartyName;                                         // 0x00B0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Gender;                                            // 0x00C0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 balance;                                           // 0x00D0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AgeInGame;                                         // 0x00E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 AccountAgeInGame;                                  // 0x00F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 RoleFigure;                                        // 0x0100(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 Ext;                                               // 0x0110(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FRoleInfo) == 0x000008, "Wrong alignment on FRoleInfo");
static_assert(sizeof(FRoleInfo) == 0x000120, "Wrong size on FRoleInfo");
static_assert(offsetof(FRoleInfo, Uid) == 0x000000, "Member 'FRoleInfo::Uid' has a wrong offset!");
static_assert(offsetof(FRoleInfo, RoleId) == 0x000010, "Member 'FRoleInfo::RoleId' has a wrong offset!");
static_assert(offsetof(FRoleInfo, RoleName) == 0x000020, "Member 'FRoleInfo::RoleName' has a wrong offset!");
static_assert(offsetof(FRoleInfo, RoleType) == 0x000030, "Member 'FRoleInfo::RoleType' has a wrong offset!");
static_assert(offsetof(FRoleInfo, RoleCreateTime) == 0x000040, "Member 'FRoleInfo::RoleCreateTime' has a wrong offset!");
static_assert(offsetof(FRoleInfo, RoleLevel) == 0x000050, "Member 'FRoleInfo::RoleLevel' has a wrong offset!");
