#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XGSDK

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class XGSDK.XGSDKCoreKit
// 0x0000 (0x0028 - 0x0028)
class UXGSDKCoreKit final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKCoreKit">();
	}
	static class UXGSDKCoreKit* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKCoreKit>();
	}
};
static_assert(alignof(UXGSDKCoreKit) == 0x000008, "Wrong alignment on UXGSDKCoreKit");
static_assert(sizeof(UXGSDKCoreKit) == 0x000028, "Wrong size on UXGSDKCoreKit");

// Class XGSDK.XGSDKMgr
// 0x0000 (0x0028 - 0x0028)
class UXGSDKMgr : public UObject
{
public:
	static TSoftObjectPtr<class UXGSDKMgr> GetInstance(class UGameInstance* GameInst);
	static TSoftObjectPtr<class UXGSDKListener> GetListener();
	static class FString GetXgAppId();
	static void Shutdown();
	static class FString SubclassName();

	void ActivationExchange(const class FString& Code);
	void ActivationRequest();
	void AddTimelineEvent(const class FString& Json_params);
	void BindAccount(const TMap<class FString, class FString>& Data);
	void BindMobile(const class FString& Mobile, const class FString& Uid, const class FString& ServerID, const class FString& ZoneId, const class FString& RoleId, const class FString& RoleName, const class FString& Captcha);
	class FString CallXGMethod(const class FString& MethodName, const class FString& Params_0, const class FString& CustomInfo);
	void ClosePay();
	void CreateRoleName();
	void DeleteAccount();
	void EnterGameStore();
	void ExchangeGiftCode(const class FString& Uid, const class FString& RoleId, const class FString& ZoneId, const class FString& ServerID, const class FString& Cdkey, const class FString& UserInfoUrl, const class FString& DispatchUrl, const class FString& CustomInfo);
	void Exit(const class FString& Param);
	void FreshQRCode();
	const TArray<struct FColor> GenQRCode(const class FString& Content, int32* Width);
	void GetAccountInfo();
	class FString GetAdChannelId();
	void GetBindInfoByMobile(const class FString& Mobile);
	void GetBindInfoByUid(const class FString& Uid);
	class FString GetChannelAppId();
	class FString GetChannelId();
	void GetIPRegion();
	struct FPayInfo GetPayInfo();
	class FString GetPlanId();
	void GetQRCode();
	class FString GetSystemLanguage();
	void GetUidInfo();
	bool HasPackedChannel();
	void Invite(const class FString& JsonInfo);
	void Login(const class FString& Param);
	void Logout(const class FString& Param);
	void ManageBackgroundMode(bool IsActive, bool IsDuringReview);
	void OnAccountCreate(const class FString& AccountId, const class FString& ServerID, const class FString& ServerName, const class FString& ServerVersion, const class FString& ZoneId, const class FString& ZoneName, const class FString& CustomParams);
	void OnCloseAnnouncement();
	void OnCreateRole(const struct FRoleInfo& RoleInfo);
	void OnEnterGame(const struct FRoleInfo& RoleInfo);
	void OnEvent(const struct FRoleInfo& RoleInfo, const class FString& EventId, const class FString& EventDesc, int32 EventVal, const class FString& EventBodyJson);
	void OnGameCreateOrder(const class FString& ProductID, const class FString& State, const class FString& GameTradeNo, const class FString& NOrderCreateCode, const class FString& SzOrderCreateMsg);
	void OnGameLoadConfig();
	void OnGameLoadResource();
	void OnLogoutGame(const class FString& Param);
	void OnMissionBegin(const struct FRoleInfo& RoleInfo, const class FString& MissionId, const class FString& MissionName, int32 DoMissionTimes, int32 RoleCurrentPower, const class FString& Param);
	void OnNewUserMission(const struct FRoleInfo& RoleInfo);
	void OnOpenAnnouncement();
	void OnPayFinish(const struct FPayInfo& PayInfo);
	void OnPrivateFunCodeUse(const struct FRoleInfo& RoleInfo, const class FString& FunCode, const class FString& FunCodeDesc, const class FString& FunCodeType, const class FString& FunCodeBatchId);
	void OnPublicFunCodeUse(const struct FRoleInfo& RoleInfo, const class FString& FunCode, const class FString& FunCodeDesc, const class FString& FunCodeType, const class FString& FunCodeBatchId);
	void OnRoleLevelup(const struct FRoleInfo& RoleInfo);
	void OnSelectProduct(const class FString& ProductID);
	void OpenAnnouncement();
	void OpenUserCenter(const class FString& Param);
	void OpenWebActivity(const class FString& Uid, const class FString& ActivityType, const class FString& RoleId, const class FString& ZoneId, const class FString& ServerID);
	void OpenXgQuestionnaire(int32 WidthPercent, int32 HeightPercent, const class FString& CustomParams);
	void OpenXgShare(const struct FShareInfo& ShareInfo);
	void Pay(const struct FPayInfo& PayInfo);
	void QRCodeInvalid();
	void QueryQRStatus();
	void RefreshQuestionnaire(const struct FRoleInfo& RoleInfo, const class FString& MissionId, const class FString& MissionName, const class FString& CustomParams);
	void RefreshQuestionnaireByQuestInfo(const struct FRoleInfo& RoleInfo, const struct FQuestInfo& QuestInfo);
	void RequestChallenge(const class FString& JsonInfo);
	void ScanQRCode(const class FString& Info);
	void SendCaptcha(const class FString& Mobile, const class FString& Uid, const class FString& ServerID, const class FString& ZoneId, const class FString& RoleId, const class FString& RoleName);
	void SetFirebaseDefaultEventParameters(const TMap<class FString, class FString>& DefaultEventParameters);
	void ShareV2(const struct FShareInfoV2& ShareInfo);
	void SwitchAccount(const class FString& Param);
	void SwitchLanguage(const class FString& Language);
	void TrackAdjustAdRevenue(const struct FAdjustAdRevenue& AdjustAdRevenue);
	void TrackAdjustEvent(const struct FAdjustEvent& AdjustEvent);
	void TrackEventSync(const class FString& EventId, const class FString& EventDesc, const class FString& EventBodyJson);
	void TrackFirebaseEvent(const class FString& EventName, const TMap<class FString, class FString>& EventBody);
	void UnbindAccount(const TMap<class FString, class FString>& Data);
	void UpdateBackgroundNotification(const TMap<class FString, class FString>& Data);
	void XgFeedBack(const class FString& Appuserid, const class FString& RoleId, const class FString& RoleName);
	void XgShare(const struct FShareInfo& ShareInfo);
	void XgShareViaChannel(const struct FShareInfo& ShareInfo);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKMgr">();
	}
	static class UXGSDKMgr* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKMgr>();
	}
};
static_assert(alignof(UXGSDKMgr) == 0x000008, "Wrong alignment on UXGSDKMgr");
static_assert(sizeof(UXGSDKMgr) == 0x000028, "Wrong size on UXGSDKMgr");

// Class XGSDK.HyperLinkRichTextBlockDecorator
// 0x0500 (0x0528 - 0x0028)
class UHyperLinkRichTextBlockDecorator final : public URichTextBlockDecorator
{
public:
	struct FHyperlinkStyle                        M_Style;                                           // 0x0028(0x0500)(Edit, NativeAccessSpecifierPublic)

public:
	void ClickFun(const TMap<class FString, class FString>& MetaData);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HyperLinkRichTextBlockDecorator">();
	}
	static class UHyperLinkRichTextBlockDecorator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHyperLinkRichTextBlockDecorator>();
	}
};
static_assert(alignof(UHyperLinkRichTextBlockDecorator) == 0x000008, "Wrong alignment on UHyperLinkRichTextBlockDecorator");
static_assert(sizeof(UHyperLinkRichTextBlockDecorator) == 0x000528, "Wrong size on UHyperLinkRichTextBlockDecorator");
static_assert(offsetof(UHyperLinkRichTextBlockDecorator, M_Style) == 0x000028, "Member 'UHyperLinkRichTextBlockDecorator::M_Style' has a wrong offset!");

// Class XGSDK.MyActor
// 0x0010 (0x0238 - 0x0228)
class AMyActor final : public AActor
{
public:
	uint8                                         Pad_228[0x10];                                     // 0x0228(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"MyActor">();
	}
	static class AMyActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMyActor>();
	}
};
static_assert(alignof(AMyActor) == 0x000008, "Wrong alignment on AMyActor");
static_assert(sizeof(AMyActor) == 0x000238, "Wrong size on AMyActor");

// Class XGSDK.testGameModeBase
// 0x0000 (0x02C8 - 0x02C8)
class ATestGameModeBase final : public AGameModeBase
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"testGameModeBase">();
	}
	static class ATestGameModeBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATestGameModeBase>();
	}
};
static_assert(alignof(ATestGameModeBase) == 0x000008, "Wrong alignment on ATestGameModeBase");
static_assert(sizeof(ATestGameModeBase) == 0x0002C8, "Wrong size on ATestGameModeBase");

// Class XGSDK.WhaleSDK
// 0x0408 (0x0430 - 0x0028)
class UWhaleSDK final : public UObject
{
public:
	uint8                                         Pad_28[0x408];                                     // 0x0028(0x0408)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"WhaleSDK">();
	}
	static class UWhaleSDK* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWhaleSDK>();
	}
};
static_assert(alignof(UWhaleSDK) == 0x000008, "Wrong alignment on UWhaleSDK");
static_assert(sizeof(UWhaleSDK) == 0x000430, "Wrong size on UWhaleSDK");

// Class XGSDK.XGSDKAndroidHelper
// 0x0000 (0x0028 - 0x0028)
class UXGSDKAndroidHelper final : public UXGSDKMgr
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKAndroidHelper">();
	}
	static class UXGSDKAndroidHelper* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKAndroidHelper>();
	}
};
static_assert(alignof(UXGSDKAndroidHelper) == 0x000008, "Wrong alignment on UXGSDKAndroidHelper");
static_assert(sizeof(UXGSDKAndroidHelper) == 0x000028, "Wrong size on UXGSDKAndroidHelper");

// Class XGSDK.XGSDKCustomReporter
// 0x0000 (0x0028 - 0x0028)
class UXGSDKCustomReporter final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKCustomReporter">();
	}
	static class UXGSDKCustomReporter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKCustomReporter>();
	}
};
static_assert(alignof(UXGSDKCustomReporter) == 0x000008, "Wrong alignment on UXGSDKCustomReporter");
static_assert(sizeof(UXGSDKCustomReporter) == 0x000028, "Wrong size on UXGSDKCustomReporter");

// Class XGSDK.XGSDKSaveDataMonitorV2
// 0x0010 (0x0038 - 0x0028)
class UXGSDKSaveDataMonitorV2 final : public USaveGame
{
public:
	class FString                                 Guid;                                              // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKSaveDataMonitorV2">();
	}
	static class UXGSDKSaveDataMonitorV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKSaveDataMonitorV2>();
	}
};
static_assert(alignof(UXGSDKSaveDataMonitorV2) == 0x000008, "Wrong alignment on UXGSDKSaveDataMonitorV2");
static_assert(sizeof(UXGSDKSaveDataMonitorV2) == 0x000038, "Wrong size on UXGSDKSaveDataMonitorV2");
static_assert(offsetof(UXGSDKSaveDataMonitorV2, Guid) == 0x000028, "Member 'UXGSDKSaveDataMonitorV2::Guid' has a wrong offset!");

// Class XGSDK.XGSDKDataMonitorV2
// 0x0098 (0x00C0 - 0x0028)
class UXGSDKDataMonitorV2 final : public UObject
{
public:
	uint8                                         Pad_28[0x98];                                      // 0x0028(0x0098)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKDataMonitorV2">();
	}
	static class UXGSDKDataMonitorV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKDataMonitorV2>();
	}
};
static_assert(alignof(UXGSDKDataMonitorV2) == 0x000008, "Wrong alignment on UXGSDKDataMonitorV2");
static_assert(sizeof(UXGSDKDataMonitorV2) == 0x0000C0, "Wrong size on UXGSDKDataMonitorV2");

// Class XGSDK.XGSDKDataReport
// 0x00F0 (0x0118 - 0x0028)
class UXGSDKDataReport final : public UObject
{
public:
	uint8                                         Pad_28[0xF0];                                      // 0x0028(0x00F0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKDataReport">();
	}
	static class UXGSDKDataReport* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKDataReport>();
	}
};
static_assert(alignof(UXGSDKDataReport) == 0x000008, "Wrong alignment on UXGSDKDataReport");
static_assert(sizeof(UXGSDKDataReport) == 0x000118, "Wrong size on UXGSDKDataReport");

// Class XGSDK.XGSDKIOSHelperV2
// 0x0000 (0x0028 - 0x0028)
class UXGSDKIOSHelperV2 final : public UXGSDKMgr
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKIOSHelperV2">();
	}
	static class UXGSDKIOSHelperV2* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKIOSHelperV2>();
	}
};
static_assert(alignof(UXGSDKIOSHelperV2) == 0x000008, "Wrong alignment on UXGSDKIOSHelperV2");
static_assert(sizeof(UXGSDKIOSHelperV2) == 0x000028, "Wrong size on UXGSDKIOSHelperV2");

// Class XGSDK.XGSDKListener
// 0x0018 (0x0040 - 0x0028)
class UXGSDKListener final : public UObject
{
public:
	uint8                                         Pad_28[0x18];                                      // 0x0028(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DealWithCustomAction(const class FString& Msg);
	void DealWithCustomMessage(const class FString& MsgCustom);
	void DealWithDeviceToken(const class FString& Token);
	void DealWithNotificationMessage(const class FString& MsgCustom);
	void DoExit();
	void DoFinishQuestionnaire(const class FString& ResultJsonString);
	void DoFreshQuestionnaire(const class FString& ResultJsonString);
	void LaunchApp(const class FString& Msg);
	void OnBindAccountFail(int32 Code, const class FString& Msg);
	void OnBindAccountSuccess();
	void OnBindMobileFinish(const class FString& Code, const class FString& Msg);
	void OnCreateRoleNameFail();
	void OnCreateRoleNameSuccess();
	void OnEnterGameStoreFail();
	void OnEnterGameStoreSuccess(const class FString& Age);
	void OnExchangeGiftCodeFinish(const class FString& Code, const class FString& Msg);
	void OnGetAccountInfoFail(int32 Code, const class FString& Msg);
	void OnGetAccountInfoSuccess(const class FString& ResultJsonString);
	void OnGetBindInfo(const class FString& Code, const class FString& Msg);
	void OnGetBindInfoByMobile(const class FString& Code, const class FString& Msg);
	void OnGetBindInfoByUid(const class FString& Code, const class FString& Msg);
	void OnGetIPRegionFail(int32 Code, const class FString& Msg);
	void OnGetIPRegionSuccess(const class FString& ResultJsonString);
	void OnGetUidInfoFail(int32 Code, const class FString& Msg);
	void OnGetUidInfoSuccess(const class FString& Json_content);
	void OnHeadsetAvailable(bool IsAvailable);
	void OnInitFail(int32 Code, const class FString& Msg, const class FString& ChannelCode);
	void OnInitSuccess(int32 Code, const class FString& Msg, const class FString& ChannelCode);
	void OnLoginCancel(int32 Code, const class FString& Msg);
	void OnLoginFail(int32 Code, const class FString& Msg, const class FString& ChannelCode);
	void OnLoginSuccess(int32 Code, const class FString& AuthInfo);
	void OnLogoutFail(int32 Code, const class FString& Msg);
	void OnLogoutFinish(int32 Code, const class FString& Msg);
	void OnNoChannelExiter();
	void OnPayCancel(int32 Code, const class FString& Msg, const class FString& GameTradeNo, const class FString& ChannelCode, const class FString& ChannelMsg);
	void OnPayFail(int32 Code, const class FString& Msg, const class FString& GameTradeNo, const class FString& ChannelCode, const class FString& ChannelMsg);
	void OnPayOthers(int32 Code, const class FString& Msg, const class FString& GameTradeNo, const class FString& ChannelCode, const class FString& ChannelMsg);
	void OnPayProgress(int32 Code, const class FString& Msg, const class FString& GameTradeNo, const class FString& ChannelCode, const class FString& ChannelMsg);
	void OnPaySuccess(int32 Code, const class FString& Msg, const class FString& GameTradeNo, const class FString& XgTradeNo);
	void OnSendCaptchaFinish(const class FString& Code, const class FString& Msg);
	void OnShareFail(const class FString& ResultJsonString);
	void OnShareSuccess(const class FString& ResultJsonString);
	void OnShareV2Fail(const class FString& Channel, int32 Code, const class FString& Msg);
	void OnShareV2Success(const class FString& Channel, const class FString& JsonData);
	void OnUnbindAccountFail(int32 Code, const class FString& Msg);
	void OnUnbindAccountSuccess();
	void OnXGGenericCallBack(int32 Code, const class FString& CustomInfo, const class FString& ResultJsonString);
	void OpenActivity(const class FString& Msg);
	void OpenUrl(const class FString& Msg);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKListener">();
	}
	static class UXGSDKListener* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKListener>();
	}
};
static_assert(alignof(UXGSDKListener) == 0x000008, "Wrong alignment on UXGSDKListener");
static_assert(sizeof(UXGSDKListener) == 0x000040, "Wrong size on UXGSDKListener");

// Class XGSDK.XGSDKSaveGame
// 0x0010 (0x0038 - 0x0028)
class UXGSDKSaveGame final : public USaveGame
{
public:
	class FString                                 Language;                                          // 0x0028(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKSaveGame">();
	}
	static class UXGSDKSaveGame* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKSaveGame>();
	}
};
static_assert(alignof(UXGSDKSaveGame) == 0x000008, "Wrong alignment on UXGSDKSaveGame");
static_assert(sizeof(UXGSDKSaveGame) == 0x000038, "Wrong size on UXGSDKSaveGame");
static_assert(offsetof(UXGSDKSaveGame, Language) == 0x000028, "Member 'UXGSDKSaveGame::Language' has a wrong offset!");

// Class XGSDK.XGSDKShareManager
// 0x0000 (0x0028 - 0x0028)
class UXGSDKShareManager final : public UObject
{
public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGSDKShareManager">();
	}
	static class UXGSDKShareManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGSDKShareManager>();
	}
};
static_assert(alignof(UXGSDKShareManager) == 0x000008, "Wrong alignment on UXGSDKShareManager");
static_assert(sizeof(UXGSDKShareManager) == 0x000028, "Wrong size on UXGSDKShareManager");

// Class XGSDK.XGWebBrowser
// 0x0048 (0x0170 - 0x0128)
class UXGWebBrowser final : public UWidget
{
public:
	FMulticastInlineDelegateProperty_             OnUrlChanged;                                      // 0x0128(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_             OnBeforePopup;                                     // 0x0138(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                 InitialURL;                                        // 0x0148(0x0010)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportsTransparency;                             // 0x0158(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_159[0x17];                                     // 0x0159(0x0017)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	bool CanGoBack();
	void ExecuteJavascript(const class FString& ScriptText);
	void GoBack();
	void LoadString(const class FString& Contents, const class FString& DummyURL);
	void LoadURL(const class FString& NewURL);
	void OnBeforePopup__DelegateSignature(const class FString& URL, const class FString& Frame);
	void OnUrlChanged__DelegateSignature(const class FText& Text);

	class FText GetTitleText() const;
	class FString GetUrl() const;

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"XGWebBrowser">();
	}
	static class UXGWebBrowser* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXGWebBrowser>();
	}
};
static_assert(alignof(UXGWebBrowser) == 0x000008, "Wrong alignment on UXGWebBrowser");
static_assert(sizeof(UXGWebBrowser) == 0x000170, "Wrong size on UXGWebBrowser");
static_assert(offsetof(UXGWebBrowser, OnUrlChanged) == 0x000128, "Member 'UXGWebBrowser::OnUrlChanged' has a wrong offset!");
static_assert(offsetof(UXGWebBrowser, OnBeforePopup) == 0x000138, "Member 'UXGWebBrowser::OnBeforePopup' has a wrong offset!");
static_assert(offsetof(UXGWebBrowser, InitialURL) == 0x000148, "Member 'UXGWebBrowser::InitialURL' has a wrong offset!");
static_assert(offsetof(UXGWebBrowser, bSupportsTransparency) == 0x000158, "Member 'UXGWebBrowser::bSupportsTransparency' has a wrong offset!");

}

