#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: XinhuoComponent

#include "Basic.hpp"

#include "Game_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass XinhuoComponent.XinhuoComponent_C
// 0x00C0 (0x0120 - 0x0060)
class UXinhuoComponent_C final : public UAbilitySpecialAttribute
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0060(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         ElapesTime;                                        // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntervalTime;                                      // 0x006C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ModifierID;                                        // 0x0070(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CurRecoverTime;                                    // 0x0074(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRuntimeFloatCurve                     RecoverCurve;                                      // 0x0078(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAbilityAttribute*                      ChangeAttribute;                                   // 0x0100(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAddedModifeir;                                    // 0x0108(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 AddedModifers;                                     // 0x0110(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void CheckAddAttribute();
	void AddModifier(class UAbilityComponentBase* InOwner);
	void SetAttribute(class UAbilityComponentBase* InOwner, float ChangeValue, class UAbilityAttribute* InAttribute);
	void K2_ReceiveTick(float DeltaSeconds, const class UAbilityComponentBase* InOwner);
	void K2_ReceiveActive(const class UObject* Instigator, bool bReActive);
	void OnApplyModifier(int32 ModifierID_0, bool IsApply);
	void K2_ReceiveDeActive(const class UGameAbilityComponent* Pawn);
	void ExecuteUbergraph_XinhuoComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("XinhuoComponent_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"XinhuoComponent_C")
	}
	static class UXinhuoComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UXinhuoComponent_C>();
	}
};
DUMPER7_ASSERTS_UXinhuoComponent_C;

}

